graph main_graph (
  %onnx::Sub_1[INT8, 2x1], exponents: [-5]
  %onnx::Sub_0[INT8, 8x2x5], exponents: [-5]
) {
  %2 = Sub[quant_type = 'S8'](%onnx::Sub_0, %onnx::Sub_1)
  return %2
}


initializers value:



values info:
%onnx::Sub_1[INT8, 2x1], exponents: [-5]
%onnx::Sub_0[INT8, 8x2x5], exponents: [-5]
%2[INT8, 8x2x5], exponents: [-5]


test inputs value:
%onnx::Sub_0, shape: [8, 2, 5], exponents: [-5], 
value: array([ 3, 14, 16, 12, 32,  6, 27, 16, 20, 22, 27,  3, 13,  9, 24, 26, 18,
        3, 18, 15,  4, 30, 24,  4, 10,  3, 11, 21, 11, 19,  1, 13,  8, 14,
       13, 10, 32, 29,  0,  9, 11, 27, 24, 19, 23, 18, 32,  9, 15, 21, 11,
       26, 19,  6,  4, 29, 17, 14, 16,  7, 27, 19, 15, 24,  3,  1, 14, 24,
       22, 16, 14,  9, 22, 13,  1,  4, 31,  2, 22,  2], dtype=int8)
%onnx::Sub_1, shape: [2, 1], exponents: [-5], 
value: array([19,  6], dtype=int8)


test outputs value:
%2, shape: [8, 2, 5], exponents: [-5], 
value: array([-16,  -5,  -3,  -7,  13,   0,  21,  10,  14,  16,   8, -16,  -6,
       -10,   5,  20,  12,  -3,  12,   9, -15,  11,   5, -15,  -9,  -3,
         5,  15,   5,  13, -18,  -6, -11,  -5,  -6,   4,  26,  23,  -6,
         3,  -8,   8,   5,   0,   4,  12,  26,   3,   9,  15,  -8,   7,
         0, -13, -15,  23,  11,   8,  10,   1,   8,   0,  -4,   5, -16,
        -5,   8,  18,  16,  10,  -5, -10,   3,  -6, -18,  -2,  25,  -4,
        16,  -4], dtype=int8)