graph main_graph (
  %onnx::Sub_1[INT16, 1x1x1x1], exponents: [-18]
  %onnx::Sub_0[INT16, 1x1x1x1], exponents: [-18]
) {
  %2 = Sub[quant_type = 'S16'](%onnx::Sub_0, %onnx::Sub_1)
  return %2
}


initializers value:



values info:
%2[INT16, 1x1x1x1], exponents: [-18]
%onnx::Sub_1[INT16, 1x1x1x1], exponents: [-18]
%onnx::Sub_0[INT16, 1x1x1x1], exponents: [-18]


test inputs value:
%onnx::Sub_0, shape: [1, 1, 1, 1], exponents: [-18], 
value: array([32767], dtype=int16)
%onnx::Sub_1, shape: [1, 1, 1, 1], exponents: [-18], 
value: array([32767], dtype=int16)


test outputs value:
%2, shape: [1, 1, 1, 1], exponents: [-18], 
value: array([0], dtype=int16)