graph main_graph (
  %onnx::Sub_1[INT16, 2x1x1x1], exponents: [-14]
  %onnx::Sub_0[INT16, 1x3x4x5], exponents: [-14]
) {
  %2 = Sub[quant_type = 'S16'](%onnx::Sub_0, %onnx::Sub_1)
  return %2
}


initializers value:



values info:
%2[INT16, 2x3x4x5], exponents: [-14]
%onnx::Sub_1[INT16, 2x1x1x1], exponents: [-14]
%onnx::Sub_0[INT16, 1x3x4x5], exponents: [-14]


test inputs value:
%onnx::Sub_0, shape: [1, 3, 4, 5], exponents: [-14], 
value: array([ 9779, 10804,  3458,  2078,  2031, 13540,  1942, 15165, 13019,
        2049,  9906,  1914, 10783,  3752, 14033,  5006,  8898, 11167,
        6753, 12468,  1780, 10492,  7699, 13770, 10746,  5951, 12376,
       10207,  2180,  4572,  4582, 10595,  1758, 12752, 15498, 10843,
        9930, 15083,  8152, 10470, 15355,  1885,  5992,  9552, 13784,
       13156,   628,  1323, 15679, 13219,  6337,  3708,  4947,  7799,
       13186, 16297,  6053,  2541,  7409,  9694], dtype=int16)
%onnx::Sub_1, shape: [2, 1, 1, 1], exponents: [-14], 
value: array([11631,  2785], dtype=int16)


test outputs value:
%2, shape: [2, 3, 4, 5], exponents: [-14], 
value: array([ -1852,   -827,  -8173,  -9553,  -9600,   1909,  -9689,   3534,
         1388,  -9582,  -1725,  -9717,   -848,  -7879,   2402,  -6625,
        -2733,   -464,  -4878,    837,  -9851,  -1139,  -3932,   2139,
         -885,  -5680,    745,  -1424,  -9451,  -7059,  -7049,  -1036,
        -9873,   1121,   3867,   -788,  -1701,   3452,  -3479,  -1161,
         3724,  -9746,  -5639,  -2079,   2153,   1525, -11003, -10308,
         4048,   1588,  -5294,  -7923,  -6684,  -3832,   1555,   4666,
        -5578,  -9090,  -4222,  -1937,   6994,   8019,    673,   -707,
         -754,  10755,   -843,  12380,  10234,   -736,   7121,   -871,
         7998,    967,  11248,   2221,   6113,   8382,   3968,   9683,
        -1005,   7707,   4914,  10985,   7961,   3166,   9591,   7422,
         -605,   1787,   1797,   7810,  -1027,   9967,  12713,   8058,
         7145,  12298,   5367,   7685,  12570,   -900,   3207,   6767,
        10999,  10371,  -2157,  -1462,  12894,  10434,   3552,    923,
         2162,   5014,  10401,  13512,   3268,   -244,   4624,   6909],
      dtype=int16)