graph main_graph (
  %onnx::Sub_1[INT16, 1x96x5x1], exponents: [-12]
  %onnx::Sub_0[INT16, 1x96x5x49], exponents: [-12]
) {
  %2 = Sub[quant_type = 'S16'](%onnx::Sub_0, %onnx::Sub_1)
  return %2
}


initializers value:



values info:
%2[INT16, 1x96x5x49], exponents: [-12]
%onnx::Sub_1[INT16, 1x96x5x1], exponents: [-12]
%onnx::Sub_0[INT16, 1x96x5x49], exponents: [-12]


test inputs value:
%onnx::Sub_0, shape: [1, 96, 5, 49], exponents: [-12], 
value: array([ 662,  487, 2634, 2697, 1739, 3644,  376,  338, 1549,  861, 1242,
       3392, 3998, 3897,  240, 2575,  194, 1880, 2916, 2366,  311, 3760,
       1640, 2593, 2904, 2334, 1118, 2081,  386, 2383, 1720, 3071, 1265,
       3827, 3861,  719,   58, 3654, 1091, 1466, 1857,   36, 1088,  199,
       3570,    6, 1797, 2782, 2071, 3924, 2635, 2037, 3370, 2804, 2990,
         65, 3792, 1282, 2503, 2392, 2113, 3315,  736, 2357, 1867, 1530,
       3407, 3593,  543, 1334, 1413, 1562,  328, 3116, 1624,  622,  549,
        959,   82,   24, 2175, 2590, 1416, 2009, 1528, 2436, 3692, 1656,
       4088, 3362, 3299,  248, 3392, 3610,   84, 3577, 2884,  205,   77,
       1344, 1739, 3157, 4004, 3569, 1399,  324, 1621, 2865,  942, 3633,
        155,  209, 3940, 2192,   82, 4063, 2046, 1011, 1661, 2685, 1612,
       2393, 4036, 3978,   58, 3498, 1773, 2294, 2684, 1285, 4054, 3774,
       1977,  583, 3552, 3433,  839, 3448,  255,  146, 3297, 3482,  326,
       3515, 3641, 1667, 1549,  864, 1267, 3986,  792, 1868,  722, 2601,
       1269, 2742, 1171, 1271, 2953, 2258, 3535, 2759, 2577, 1185, 1427,
       3220, 2967, 1418, 3533, 3301,  931, 3252, 1678, 2312, 1996, 3989,
        935, 3029,   40,  846, 3528, 1849, 3199, 4041, 4082,  235, 2229,
       2386, 3742, 3165,  147,   13, 1907,  240,  177, 4035,  647, 1302,
       1829,  480,  101,  564,  642,  924, 3595,  158, 2007,  215, 3940,
       2795, 2873, 1682, 1367, 2300, 1881, 2143, 3590, 1340,  648, 3874,
       2657, 1309, 2492, 2606, 1508, 2906, 4039, 3916, 3327,  693, 3055,
       2093, 2784, 1271, 1201,  848, 1186, 1145, 3765, 2931, 2808, 2874,
       2406,  327, 2947,  540,  679, 1055, 1762, 2852, 2662, 2338, 3501,
       2503, 1545,  140, 3155, 3912,  719, 3563, 1201, 1460, 2246, 3814,
       4043, 3574, 2898, 2707, 3470, 2302, 1849, 3275, 2454, 2587,  474,
       1802, 1753, 2541, 1875, 3790, 2724, 3869,  969, 1310, 1855, 1198,
       3360, 3796,  223, 2874, 2666,  468, 2088,  311,  231, 2411, 1518,
       3414, 2066,  219, 2110, 1772,  956,  861, 1041, 4054,  247, 3600,
       2215,  484, 3144,  120, 3772,  791, 2235,  280, 3150,  414, 3993,
       3715, 3759, 2816, 1807, 4019, 3078, 4077,  942, 3688, 3450, 4007,
       2200, 1471, 2954, 1619,  689, 1297, 1903, 2228, 1118, 2352, 3307,
        467, 2515, 1604, 4014, 3252,  788, 1198, 3097, 3997, 1886, 1187,
       2775, 2002,  877,  689,  176,  500, 2712, 3618, 2067, 2208,  440,
       3390, 2799, 2972, 1897, 1251, 3143, 1779, 1797,  991, 3326, 3071,
         90, 3950, 2604, 1945,  729, 2205,  258, 1858, 3772, 3989, 3587,
        603, 2347, 2667, 3379,  351, 1521, 2076, 2411, 1324, 2210, 2721,
       3719, 2353, 3050, 2828, 3142, 2185, 2171, 3811, 1631, 1377, 1953,
       2884, 3341, 2350,   68, 3053, 2370, 1548, 1622, 2997, 3826, 2051,
       1657,  746, 3322, 3290, 3930, 1520,  219, 2541, 1772, 3406, 1380,
        391,  484,  209, 1238, 3465,  442,  546, 3546, 2588,   10,  633,
       2331, 1313, 4052, 2798, 1474, 2721,   43, 2033, 3087,  856, 3693,
       1207, 2186, 2176, 2947, 2519, 3316,  943, 3817,  465, 3781,  102,
       3244, 2718,  598, 2441, 3648, 2521, 1696,  231, 1051, 4028, 3763,
       1197, 1458, 1026, 3553, 1033,  837, 1516,  453, 4085, 1883, 2282,
        946, 3213, 2567, 3305, 2881, 3532,   56, 2584, 1362,   64, 1986,
       2715,  204,  980, 3272, 3002, 1111, 3508, 3178,  387, 2648, 1378,
       3401,  783,  638, 3535, 3969,  887, 3456,  421, 3401, 2894,  787,
       1710, 1085,   51, 2268,  177,  756, 2093, 1730, 2831, 2938, 1643,
        792, 1887, 2236, 2711,  705, 1898,  947, 2420, 3337, 1435, 3063,
       2517,  810, 1590, 3892,  517,   85,   33, 1862, 4003, 2923, 2864,
       1509,  484, 2428, 1330,  767, 3972, 2798, 1258, 3451, 2263, 2759,
       2030, 2022, 2793, 4083, 3627,  374, 2369, 4065, 2468,  349, 2627,
       2239, 1225, 3369, 2773, 1957, 2213,  720, 1468, 1452, 2562, 3057,
       3875, 2070, 1463, 1501, 3991, 2251, 2417,  761,  448, 3723, 2621,
       3111, 3923, 3316, 1709, 2981, 1346,  635, 1979, 2069, 3882, 2323,
        514, 2415, 1744, 3848, 2458,  873, 2041, 1297,  168,  232,  424,
        471, 3441, 3554, 3762, 3970,  447, 1375, 3611, 3261, 2663, 2472,
       1933,  559,  902, 2177, 1078, 2948, 1933, 3958, 2024, 1162, 4076,
        132,  554, 2029, 3689, 1178, 2763, 1242, 3414, 2382, 1614, 2345,
        306, 2997, 1872, 1161, 1328,  848, 2737, 2744,  152, 3708, 3117,
       3301, 3192, 1037, 1763, 3422, 2914, 3643, 1260,  688, 2282,  221,
       1749, 2392,  915,  598, 1504, 3931, 1786, 2269, 3728, 2632, 3741,
       3999,  309, 3151, 2986, 2800, 3696, 3378, 3039, 1201, 3852, 3253,
        588, 2231, 1396, 3721, 3223,  857,   94, 1527,  302, 3432, 2223,
       1694, 3156,   22, 1242, 3557, 1742, 1679, 3429, 2267, 1161, 1815,
       1713, 2778,  985,  909,  185, 2432, 1590, 1239, 2668, 3719,   50,
        393, 1102, 2021, 1997, 3925, 2418, 3960, 2216, 2657, 3255, 2466,
       1230, 2850, 3966,  908, 1845, 2702, 2953, 1776, 1371,  834,  263,
        197, 2876, 3320,  967, 2628, 2267, 1223, 3746, 1370, 3460,  250,
        712, 3711,   14, 3948, 2949, 1791, 1138, 3523, 2534, 2728, 1584,
       1781, 2004, 1781,  651,  975,  289, 1045, 1833, 2998, 2340, 2753,
       1972, 1953, 3142, 3259, 2452, 1597, 1944,  797, 4060, 3565, 3861,
       3149, 2894,  705,  522, 4035, 3320, 3126, 2058, 2751,  773,  344,
       3837,  214, 2653, 2273,   15, 2939, 2902,  679, 2091,   59,   13,
        686, 3394, 2262, 1919,  545,  757, 1057,  481,  627, 4053, 3273,
       2408, 3017, 2737, 3910, 3374,  554,  191,  451,  707, 1115, 3163,
       3154, 2267, 2534,  814, 1408,  699,  167, 3065, 3213, 3562,  918,
       3908, 2770, 2769, 2932, 3330,  443, 3661, 2364,  791,  784, 2280,
       1688, 3368, 3576, 2497, 2780, 2512, 2712,  385, 3846, 3681, 2678,
       1810, 1876,  160, 2343, 3992,  163, 1050,  721, 1535,  621, 1739,
        958, 2302,  744,  590, 3835, 2239, 1470, 3083, 3117, 1121, 1302,
          9, 2849, 1425,  629, 1299,  211, 3598,  582, 2717,   18, 2400,
       3946, 2023, 1944, 3244,  286, 1600, 3623, 1949, 1281, 2480, 3617,
       3749, 2956, 1289,   98, 3075, 1601,  408, 2362, 2077,  705, 2213,
       4037, 3290, 1548, 2291, 2542, 1735,  440, 1712, 3970, 1542, 3061,
       1414,  895,  100,  192, 3363,  743, 1945,  210, 2906, 4052, 3164,
        926, 1814, 1961, 2980, 1055, 1592, 2797, 3689, 3636, 2898, 2345,
        136, 1228, 3930, 2425,  711, 1024, 3977, 3784, 3635,  916, 3900,
       1629, 4080, 3706,  671, 1646,  271,  572, 3837, 2939, 2135, 2155,
       3523,  590, 2226, 3065, 2973, 1869,  278,  522, 1999, 1764, 4096,
        863,  781,  136, 1011, 1311, 2025, 2402, 2308, 2506,  676, 3971,
       3740, 3007, 3473,  418, 1535, 2899, 3709, 3787, 1947,  417, 2174,
        149, 3823, 2829, 2594, 2723,  863,  159, 2763, 3570, 3229, 1494,
       3767, 3828, 2984, 2416,  402, 2105, 3820, 3151, 2830,  485,  388,
       2653,  864, 2347, 2319,  168, 2794,  938, 2644, 3399, 1058,  930,
       3660, 2321,  713, 2844,  369, 2779,  323, 2496,  408, 1264,  417,
        459, 3391, 2192, 2840, 3953,  683, 3113, 1343,  571,  603, 1150,
       3402,  594, 3574,   51,  946, 3263, 3564, 2234, 2597, 2289, 1615,
       2978,  215, 2754, 3210, 2152, 1341, 1211, 1371, 3474,  748,  249,
       1354,  508, 3758, 2818, 3006, 1266, 2364, 1538,  930, 3746, 1285,
        248,  410,  214, 1133, 3586, 3332,  132,  916, 1566, 1783, 1056,
       1322, 1795, 3143, 2108, 3313,  215, 3777, 2189, 3423,  264, 3213,
       2967,  848,  392, 3133, 2762,  281, 1100,  751, 3134,  752, 1808,
       2322, 2666, 2480,  204, 3583, 3426,  550, 3735, 1074,  810,  109,
       2245, 2504, 1424, 4007, 1817, 3522, 3996, 2666, 2132, 2887, 2463,
        804, 3610, 1934, 4096, 1046, 1107, 1292,  508, 1237,  565,    9,
       3842,  142, 3127, 2332, 1276,  460, 2096, 2389, 3602, 1362, 3910,
       1043, 3416, 3749, 2136,  496,  655, 3010, 2150, 3309, 2058,  541,
        903, 3007, 2170, 3256, 2454, 3949, 1394, 1373, 2497,  424,  105,
       3273, 1480,  610, 3782,  974, 3357, 2256, 2690, 1046, 1746, 4065,
       3177, 2028, 1705, 1376, 2957, 3085,  978,  663, 2059, 2713, 3267,
        817, 1511, 2992, 2041, 1096, 1777,  896, 3292, 1007,  197, 2561,
       1240,  672, 4077, 1111, 1838, 1524, 2167, 1882, 2400, 2004, 1010,
        656,   54, 2374, 2007, 2154, 2427, 2551, 4054,  139, 3166, 1653,
       1251,  964, 1223, 1578,  804, 3502, 2618, 1617, 1367, 1872, 2119,
       3009, 1471,  118, 3996, 2893, 3630, 3874, 3221, 3219, 2447,  354,
       2484, 2430, 3465, 1161, 2920, 2316, 1376,  308,  111, 3155, 3538,
        519, 1700, 3060, 1056, 1293,  743, 1313, 2184,  500, 4044, 2178,
       1641, 3921,  907, 3442, 2090,  408,  206, 3173,  664, 3068,  165,
       3819, 2722, 3515, 2625, 2079, 3517, 3802, 3211, 2738, 1572, 3196,
       1915, 2974,  503, 1487,  180, 3173, 3872,   58, 1002, 2724, 3013,
        962,  137,  444,   76,  274, 2728, 3210, 1776, 3826, 3861, 2836,
       1092, 3863, 3333,  392, 3536,  973, 2489, 1923, 2675, 2264, 3710,
       2985, 1415, 1294, 2163, 3962,   73, 1912, 2625, 2666, 1366, 2060,
        386, 1573, 1642, 1318, 3460, 2231, 1672, 1076, 2063, 1091,  598,
       2688, 1643, 3928,  467, 3024, 1387, 1736, 3115, 3164, 2008, 2337,
       3184, 2469, 2919, 1360, 2366, 3923, 2831, 3403, 2946,  334, 2372,
       2548, 1016, 2121, 2673, 1344, 3160, 3989,  367,  386,  233, 2285,
       3231,  694, 1748, 1981,  857,  843,  695, 1568, 1673, 1702, 1664,
       2670, 2876, 3526, 1748,  949, 2124, 3185, 1275,  246, 1483, 2065,
        627, 1050, 4014, 2072, 2672, 1187, 2067, 2827, 3432, 2237, 2483,
       1734, 3066, 2054, 2524, 1809,   39, 3381, 3052, 2327, 1119, 2025,
       3722,  152,  936,  287, 2103,  656, 4060, 4022,   53, 2588, 1695,
        677, 3083, 3607, 2118, 2920, 2297, 1606, 2370,  639, 3394, 2714,
       1372,  414, 3742, 1717, 2729,   31, 3967, 1879,  297, 3759,  762,
       2313, 1310, 2144, 2029, 1620, 2399,  563, 3135, 2721, 3932, 3145,
       3764, 1542, 3393,  880, 1475, 2427, 3217, 2163,  629, 1581,  945,
        183,  993, 1400, 3848, 3001, 1541, 2413,  356, 1889, 2292, 3246,
        946, 4042, 1998, 3372, 1212, 1020, 3056, 2170, 1502, 1979, 3874,
       2803, 1333, 2733, 2757, 2648, 3892, 2001, 1064,  210,   72, 2579,
       1906, 1085, 2436,  740, 1602, 2988, 3184, 3904,  359, 3553,   73,
       3113, 2643,  606, 3340, 2300, 4090,  246, 4063, 3242, 1221, 3599,
       2965, 3144, 3346, 3000, 2664,   46, 3355, 3607,  229,   47, 2205,
       3531, 2573, 3577, 1144,  354,  842, 1002, 3747, 1894, 2986, 2478,
       1191, 1281,  569, 1652, 3170,   96, 3384, 2216, 3038, 1540, 3491,
        865,  150,  358, 2934, 1364,  232, 1601, 3891,  802, 1065, 1577,
       3273, 4003, 1969, 3080, 3016, 3824, 2133, 1242, 2202,  511, 1733,
        984, 1956, 2138, 3605, 3193,  140, 1498, 1160, 1712, 3898, 1772,
       1712,  631, 2031, 4056,  212, 2138, 3268, 2484, 1778,   24, 3021,
        450, 3573, 3707,  342,  256,  467,  105,  148, 2616, 1401, 1103,
       1116, 3407,  292, 1359, 2158, 1201, 1514, 3088, 2467, 2895, 2679,
       3127, 3732,  349, 3057,  802, 3121, 1948, 3273, 1113, 3164, 3593,
       1627, 2014,  435, 2545, 2495, 1205, 2659,  487, 1396, 2751, 1091,
        982, 1430, 3691, 2796, 1563, 1620, 3948, 1996, 3583,  411, 3381,
       1159, 3977, 3873,  349,  720, 3806, 1030, 3606, 1317, 3097,  171,
       4087, 2700, 3448, 2115, 1920, 2836,  181,  381, 1421,  930, 2613,
       1440,  153, 1990, 3997,  302, 3608,  787, 1304, 1069, 1364, 3050,
        779, 1026, 3695, 1863, 1973, 2483, 3825, 3548, 3846,  459, 2523,
       3007,  368, 2486, 3473, 3173, 2526, 3946, 3296, 1398, 2626, 1679,
       3757, 4053, 2919, 2904, 2434,   95, 3671,  320,  345, 3182, 1968,
       3334, 2148,  117, 2481,  584,  668, 2609, 3873,  588, 1904, 3942,
        161, 1358, 1920, 2037,   81,  304,  254, 3572, 2058, 3202, 1473,
        384, 1918, 1978, 2887, 3845,  355,  654, 3792, 2588, 3148, 3629,
        833, 1032, 3700, 1653,  649, 3262, 3895,  387, 3151, 3136,  441,
       1322, 3501, 3485, 1505, 1550, 3019, 3280, 1477, 3113, 2646, 2794,
       1213, 2680, 3712, 2430, 3324, 3409, 2785, 1171, 1478, 3090, 1740,
       1648, 2339, 2103, 1175, 2631, 2325, 2365, 1523,  504,   89,  611,
        956, 2335,  364, 1774,  754, 4083, 2441, 3199, 2361, 2761,  622,
         86, 2916, 1651, 1330, 1958, 3835, 3255, 3779,  169, 1048, 1089,
       2871, 1666, 1918,  430, 3638,  411, 1981, 2943,  481,   62, 1604,
       1317, 3086, 1575, 3058,  388, 1566, 1467, 3031, 3693, 1519, 2036,
        228,  765, 2268, 3101, 1854, 2431, 2970,  458, 2781, 1914,  722,
       3828,  309,  817, 1449, 3862, 2392, 2719, 1077,  406, 3439, 1831,
       2812,   84, 1308, 3403, 1897, 3547,  455, 2322, 3830, 2505, 2799,
       2255, 3431,  211,  432, 3347,  216, 3560, 2801, 3162, 3189, 1998,
       1847,  882, 3082, 2092, 2680, 1110, 2162,  822, 1571,  266, 4040,
       1329, 3375, 2443,  215, 2091, 3167, 1795, 2676,  839, 1358,   45,
        494, 2975,  808,  249, 3823,  321,  495,  468,  333, 1250,  114,
       3713, 1400, 3930, 3721, 1924, 1771,  154, 2621,  190,  619, 3180,
       2581,  198, 1007, 3352, 1480, 3755,  720, 3335, 4063, 3077,  530,
       2069, 2760, 3322, 1746,  647, 1940, 3935, 2037,  203, 3961, 3845,
       3685, 3080,  124, 1395, 3477, 2145,  543, 1230, 3607,  282,  405,
       3141, 1435, 2361, 2412, 3114, 2572,  914, 2204, 2358,  630, 3639,
        277, 4094,  184, 3821, 2174, 3468, 3573,  243, 1667, 3887,  315,
        937,  497, 2028, 2517,   22,  602,  770, 3435,  550,  231, 3954,
       2738,  864, 3433,   26, 1745, 1308, 4081,  709, 3121, 1679, 3397,
       1089,  755, 3299, 3653, 3226, 1128, 1186,  574,  248,  954, 3051,
       2511, 1358, 2772,  643, 1532, 2082, 1102, 1197, 3772,  875, 1168,
       2053, 1683, 2615, 2507, 1074,  308,  807, 1217, 2892,  654, 2289,
       3557, 3765, 1747, 1814, 2911, 1758, 3591, 3464, 2680, 2771, 1306,
       1484, 1512, 1785, 1857,  664, 3375, 1616, 2605,  928, 1343,  945,
       1727, 2201, 2935, 4069, 3863, 3515, 2367,  283, 1880,  542, 2259,
       1392, 2894, 1129, 1212, 3343, 2385,  931, 3286, 2755, 1774, 1389,
        403, 3583, 2349, 1977, 1018, 1853, 3420, 1866,  174, 3395, 1338,
       1516, 4074,   70, 2086, 2251,  929, 2090, 3767, 3469, 3236, 1724,
       2698, 1259, 1905, 1343, 3406, 2885,  768, 3468, 2298, 2183, 2987,
       3748, 1962,  538, 3262, 3011,  504, 3040,  600,  562,  114, 1403,
       3456,  875, 1322, 3346, 2549,  903, 1910, 1665, 1771, 3036, 1406,
       3716, 1490,  313, 1007,  882, 1577, 2192, 1554, 3296, 2105, 3917,
       1752,  618,  867, 3044, 2688, 3089, 1462, 3611, 3891,  372, 3932,
       2321, 4062, 2962, 3282, 1985, 3122,  311, 2144, 1748, 1331, 3472,
       2255,  665, 2464, 3492, 2058, 1107,  309,  301, 2370, 1038, 2364,
       2663, 2647, 1458, 2895, 1479,  525, 1916, 2784,   26,  720, 3437,
       2644, 1892, 1383, 1148,  230,  605, 1968, 1067,  137, 2334, 1987,
       1882, 2748,  212, 2188,  384, 2467,  509, 2933, 3741, 1077, 1389,
       4063,  237, 1212,  384,  252, 1245,  260, 1419,  101, 2261, 3378,
        678, 1675, 3481, 1950,  930,  625, 1491, 4073, 3573,  114, 3310,
       3409, 1122, 1206,  181, 2768, 2216, 2691, 2968,  104, 1689, 2822,
        701, 2274, 2929, 2953, 2170, 2670, 3056,  669, 1796, 2719, 1122,
       1918, 2074, 2276, 2215, 2054, 2033, 3619, 3735, 1407, 1850, 2922,
        192, 1514,  271, 1738, 2062, 3894, 1227, 3159, 1500, 2164, 1621,
       3723, 1454, 3741, 1073, 1518, 2613,   79,  986,  622, 1516, 1578,
       1874, 2899,  170, 3156, 1271, 1300, 3878, 1940, 2089, 2453, 1387,
       3581, 1041,  992, 3778, 1000, 2664, 3193,  172, 3446, 3996, 1019,
        934,  596, 1369,  110,  338, 2662, 2493, 2653, 2626,   48, 2737,
       3984, 2023,  390, 3434, 2416, 2248,  346, 1084, 4080,  603, 4067,
       2921, 3610, 3900,   13, 2665,  374, 1169,  990,  121,  275, 1567,
       1536, 2331, 1475, 2054, 3711, 3453, 1790, 4010, 2933, 1596, 3564,
        656, 3682,  194,  338, 3862, 1898, 3867, 1864, 3118,  683,  738,
       2496, 1484, 3371, 3313, 3818, 4083, 2133, 2619,  961, 1749,  916,
        779, 2111, 3684, 2359, 1193, 3936, 2068,  384,  289, 2896, 1798,
       2879,  785, 3556,  464, 1622, 2091, 3211, 1937, 1336,  349, 4032,
       3666, 1640,  553, 3467, 3878, 1818, 1031, 2098,  791, 3288,  705,
       1189, 2758, 3280, 1520, 1916, 2752, 3939,  430, 1947,  670, 2646,
       2059, 3477, 2874,  751, 1476, 2747, 3478,  117, 3034, 1296, 3896,
       1510, 1587, 3717, 1792,  613, 1310, 1318, 2569, 1576,  945,  765,
       2564, 2272, 1296,   87, 1234, 1245, 1412, 3357,  833, 2231, 4053,
        385,    3,  127, 3693,  948, 3730, 3611,  340, 3455, 1616, 1644,
       3468,  725, 1787, 3581, 1073, 3912, 2341,   32, 3833, 3500, 2509,
       3278, 3625,  688, 3028,  749,  827, 3736,  742, 2290,  616, 3011,
        927, 2691, 3421, 3224, 3070, 2085, 3300, 2820,  576, 3921, 3808,
       1328, 3896, 2449, 1123,  283, 1516, 3853, 3410, 2304,  551, 3984,
        737, 1650,  112,  109,  941, 2391, 1327, 1448,  632, 2103, 3809,
       1440, 2063, 4046, 1998,  257,  449, 1424, 2135,  326, 1460, 2081,
        749, 2346, 3684,  940, 2111, 1958, 3662, 1925, 3437, 1174,   60,
       3143, 3684, 1730, 3740, 2415,  383, 3237, 3647, 3502, 3231, 4029,
       2349, 3351, 2745, 2847,  851,  735, 3644,  170, 3400, 1228, 2337,
       3512, 3984,  462, 3995, 3210, 4051, 3743,  357, 1258, 2192, 2663,
       2057, 2027, 2341, 1007, 1176,  986,  205, 2344,  672, 1014,  611,
       3597, 1286, 1651, 3588, 1571, 3692, 1686, 2765, 3035, 4078, 1671,
       2527, 1041,  554, 3203, 1585,  539,  924, 1026,  308, 3978,  757,
        277, 1682, 3712, 2070, 3156,  267, 1027, 1472, 1651,  335, 2183,
         27,  107, 1068, 2582,  566,  799, 1938,  743,  239, 3141, 1065,
       2263, 1119, 2111, 2432, 3999, 3066,  472, 1075, 1343, 2725, 3533,
       2097, 3493, 3101, 3904, 3747,  644, 3320,  515, 3994,  605, 1570,
       3546, 2382,  816, 3666, 2200, 3698,  195, 1548, 4017, 4046,  589,
       3041,  156, 1107, 2970,   97, 2214, 2605, 1074,  156,  902, 3582,
       2707, 1461, 2813,  238, 2400, 4035, 1347, 2273, 1610, 1162, 3762,
       1599, 2390, 1778,  207, 2957, 3026, 1094, 1951, 3465, 1132, 1962,
       3198, 3224, 1897, 1555, 3091, 3226, 2902,  254, 2197, 1758, 4013,
       1738, 1862, 2044, 1031, 1600, 1039, 3281,   71,  774, 2445,  996,
       1274, 2643, 1629, 3958,  667, 2528, 2156, 2541, 1601, 1256, 3839,
       1572, 1402,  628, 1702, 2871, 1001,  657, 2951, 3164, 3780, 2275,
        935, 1145, 3735,  422, 3639, 3542, 1711, 3605, 2336, 1526,  810,
        792, 3821,  287, 3500,  655, 3345, 2323, 1975, 3073, 1003, 3378,
       2352, 2867, 3618,  369, 1876, 1028, 1461, 1361, 1167, 1426, 2447,
       2072, 2665, 1597, 1067,  494,  123, 3504, 1772, 2044, 3769, 2089,
       3379, 2791, 3488, 3079,  417, 2927,  743,  830,   32,  844, 3743,
       3744,  420, 2881, 2293,  958, 2993, 3934, 3945, 3280, 1471, 1261,
        834, 1130, 1623, 3600, 2533, 1204, 3886,  303,  586, 3758, 3816,
       1355, 3019,  370, 1087,  327,  309, 1229, 3187, 1088, 2092,  724,
        368, 1448, 2705, 2331, 2084, 3472, 2016, 1336, 3102, 2418,  857,
       2005, 3626, 3843, 3919, 2731, 2740, 3015, 2577, 2927, 3867, 1685,
        241, 2968,  908, 2778, 1370, 1450, 4023, 4017, 2192, 1917, 2916,
       2692, 3587,    1, 3210, 4094, 3506,  105, 1182, 3060,   18, 1558,
       2782, 3224, 2122, 2758, 3292, 1464, 3399,  161, 2126,  789, 1251,
       1181, 3164, 2576,  611, 1160,  521, 2933, 2005, 3021, 1444,  655,
        694, 1665, 2335,   16, 1486, 1335, 1300,  536, 1914, 3690, 1615,
       3182, 2716,  148, 2643,  287, 2837, 3560, 2472, 2405, 2060, 2710,
       3997, 2207, 1896, 2365,  917, 3751, 3927, 3015, 3846, 1317,  972,
       3193, 2250,  629, 1689, 3907, 1343, 2278,  497, 1679, 1965,  500,
       2579, 3553,  107, 3123, 1488, 1101,  400, 3710, 2721, 2763, 3475,
       1550, 2822, 3173, 4026, 2582, 2896,   76, 1263,  354, 1382, 1168,
       1518,  977, 2214, 3346, 2765, 1057, 3867, 2007,  829, 2550, 1885,
       1650, 2731, 1010, 1334, 1835, 1143, 1146, 1668, 2524, 3707, 3285,
        203, 3017, 2849, 3476,  570, 2108,   54, 3939, 3718, 1734, 1863,
        423, 3556, 1772, 3016, 1130,  968, 2248, 3871, 1956,  319, 3316,
        492, 1270, 1486, 2899, 3292, 3248,  207, 3138, 3420, 2668, 1526,
       2342, 1197, 2647, 3260, 1403, 2338, 3742,  669, 1298, 2904, 1944,
       3064, 1835, 1834,   29,  595, 1719,  766, 2201,  347,  151,  177,
       2454, 3523,  767, 2301, 3433, 1677,  601, 1106, 2596, 2363, 2406,
       3419, 2911, 3250, 2360,  349, 2832, 3262, 4057, 4033,   91, 2527,
        111, 1015, 3136, 3115,  659, 2937,  873, 3488, 2340, 2558, 2809,
       1284, 4029, 3209, 3770,  361, 2580, 1693, 3824,  801,  886, 3701,
       2713, 2563, 2457, 3034,  387, 2738, 2541, 2973, 1716, 2915, 3012,
       3209,  927, 3320, 1253,  833, 2905, 2956,  636, 3133, 3677, 2289,
       3386, 1325, 2429, 2357, 3405,   65, 1312, 2250,  812, 1147, 3017,
       1114, 3117, 2265, 3609, 1393, 1466, 1521, 2318, 2477, 2596, 2065,
       2894, 3122,  975, 3758,  602,   78, 2225,  566, 3115, 1630, 3505,
        980,  454,  918, 2962, 4055, 3610, 1927, 1632, 2222, 2524,  696,
       3087, 1799, 2965, 1004, 1548, 2085,  823, 2326, 2299, 1823, 2563,
       3251,  108, 2652, 1256, 1395, 3569, 2118, 1897, 3040, 3133, 1025,
       1332,  722, 3967,  994, 2974, 2114, 1866, 2527, 3047,  563, 3516,
       2811, 2884,  443, 3801, 3701,  875,  654,  508, 1408, 2514, 2474,
       2319, 2818, 4093, 2718, 4049,  839, 1704, 3053, 2127, 2655,  560,
       3545, 4013, 1549,  410, 3567, 2248, 1245,  392,   93, 3398, 3826,
       1934, 2963,  899, 3400, 3269, 3308, 2493, 3615,  971, 2905, 2899,
       3752,  991, 1962, 1500, 1232, 1272,  607, 2028,  992, 2167, 1734,
       3647,  999, 1084, 1730, 1969, 3081, 1211, 2831, 3024, 1571, 2863,
       3724,  857, 3899, 2029,  940, 3955, 1892,   69, 3475, 2860, 3876,
       2704, 2023, 1846, 3612, 1220, 2275, 3684, 2525, 1320, 1004, 3077,
       3244, 3715, 1058,   66, 3967, 1095, 1230,  375,  663, 1195,  510,
        587, 3130, 2011, 2647, 2995, 3645, 1014, 2214,  612, 3781, 1542,
       2698, 2257,  568, 1567,  789,  258,  812,  491, 2843, 1437, 2272,
        660, 3256,  913, 2125, 1445, 1085, 4046, 1829, 3565, 2190,  688,
       2344, 1829, 3015, 3236, 3934, 3401, 2154,  824,  116,  655,  199,
       2655, 1995, 1329, 3305, 3904, 2178, 2559, 3348, 1013,  187,  752,
        905, 2956, 1438, 1813, 1104,  170, 3386, 2326,  238, 2327, 2848,
       3670,  761, 2924, 2422, 3014, 1801, 2121, 1815, 2504, 3018, 2022,
       1698, 2948, 3532, 2705,  809, 1439, 3828, 1175, 1613, 1658, 2120,
       2563, 4043, 1790, 2563,  365, 2041,   43, 1003, 1583, 2296,  301,
       4080, 2221, 2756,  956,  314, 3184, 1893,   12, 1655, 1826, 2665,
       2258, 2757, 1609, 3324, 1007, 3771, 1534,  136,   22, 1684,  645,
       4014, 4024, 3865,  957, 2849, 2997, 3174, 2764,    6, 2034, 1183,
       3600, 3477, 3530, 1651, 3790, 1971, 2720,  919, 1656, 1145, 2002,
       3955, 2283, 2361, 3673, 2231, 2666, 3891, 2657, 3795,  376,  892,
        997, 2018, 2017, 1257, 2120, 3085, 1864, 1159, 2306, 2202, 2581,
       2850, 3158, 1241, 4004,  569, 2412,  211, 1087, 1759, 1339,  898,
       2326, 1201, 1656, 1638, 3751,  797,  554, 3884,  164, 1353, 3990,
       2154, 3251, 2149,   15, 4038, 1129, 1314, 1378, 2703, 3228, 1078,
       3357,  597,  895, 3331, 3703, 2807, 2089, 3157, 1086, 1388, 3442,
       1091, 1047, 4069, 2848,  237, 3091, 1792,  833, 2486, 3059, 2607,
       1521,  969, 3947,  636, 2097, 1499, 1218, 2309, 3801, 1180, 2565,
       4041, 1257, 2276, 4036, 3468,  628,  944,   28, 2793, 3908, 2093,
        284,  977,  843, 2112, 2728, 2096, 3674,  983, 1533, 1951, 1584,
       3620, 2408,  472, 1358,  227, 3673, 3215, 1980,  747, 2447, 1602,
       3606, 2847, 2117, 3678, 2546,  831,  232,  419,  559, 3860, 2046,
       2526, 1773,   32,  617, 2713, 1009, 3955, 3624, 2738, 1072, 4066,
       2009, 2666,  946, 1159, 3867, 3687, 3022, 2960, 1937, 2015,  718,
       3519, 2634, 3394, 3237, 1852, 2313,  335,  785, 3743, 2835, 1993,
       1745, 1380, 1269, 2205, 2903, 2939,  965, 3061,  801, 3282,  955,
       3725, 1227, 3721, 1762, 2624, 1639, 2736,  428, 2379, 1795, 2832,
       3006,  169,  273,  821, 2024, 1922, 2352,  863, 3864, 1591,  797,
       3387,   46,  267, 1687, 1881, 1547, 2714, 2351, 3196, 3605, 1139,
       1432, 1861, 3013, 4009, 3044, 1068, 1319,  226,  979, 1537,  408,
       1610, 3383, 3222, 2426, 2655,  917, 2437, 3834,  437, 2111, 1297,
       3153, 1110, 2380, 1733, 3582, 3480,  126, 2698, 1393, 3416, 2960,
       3709,  525, 1362,  448, 2873, 3274, 1223, 3674, 1195, 2568, 2227,
       1387, 2163, 3308, 3463, 2930, 1840,   81, 1465,  751, 1096,  345,
       3743, 2994, 2830, 1313,  334, 1329, 2740, 2008, 1670, 2521, 3936,
       1690,  658, 1865, 3872,  530, 2207,  910, 1965,  215, 2981, 1438,
        810, 1282, 3733, 3886,  324, 3948,  639, 4089,  341, 2442, 3770,
       1536, 2867, 2206, 3583, 3619, 1831, 3574,  415, 2846, 2737,  948,
        837, 3193, 3267, 3493, 3249, 2179, 4076,   11,  543, 1159, 4038,
       2522,  953,  607,  234, 2890, 2776, 2213,   87, 3044, 1498, 3003,
        407, 1274, 1472, 2357, 1984, 2785, 3340, 1191,  157, 3928, 1401,
       1723,  133, 1237, 1550, 2123, 1330, 1491, 1040, 1521, 4033,  998,
       3015, 2651, 3451, 3987, 3326, 1820, 3552, 2080, 2085,   43, 1028,
       1232, 3161,  774, 2497,   87, 1078, 2717, 3162, 1673, 1842, 2456,
        709, 2929, 3592, 1907, 1904, 2450,  750,  979, 2472, 3534, 1475,
       2880, 1567, 2666, 1436, 1236,  720, 3693, 2752, 1534, 2493, 2866,
       2034, 2578, 4074, 2127, 1582, 1855, 3458,   73,  865, 3684, 1771,
       3686, 3994, 1438, 2758, 1243, 2817, 3176, 1511,  219, 1734,   68,
       3613, 2558, 1922, 3276, 1192, 4076, 2200, 3327, 1526, 2419, 1146,
       1552, 2046, 2630,  190, 3587, 1626, 1426, 2718, 2078,  572, 3642,
       2838, 1799,  677, 1594, 1424, 1037, 2063, 2661, 3440, 2913, 1843,
       3439, 2079,  853, 2084, 2132, 2090, 3050,  897, 3703,  354, 3503,
       2531, 2403, 3863, 1090,    3,  579, 3977,  121, 3405, 3186, 1831,
        804, 2944, 3627, 1132, 3003,  181, 4017, 2403, 2773, 1747, 4034,
       1835,  266, 3845, 2113, 1760, 3295, 2616,  528, 3898, 1085, 3035,
        314, 1818,  977, 1659,  864,  625, 2982, 3700, 3951,  438, 3066,
       3949,  739,  529, 2948, 1636, 3994,  343, 3546, 3737, 1812,  911,
       3953,  169,  794, 2312,  565,  645, 3417, 3288, 3699, 3912, 3311,
       2534,  703,  504, 2349, 1828, 3625, 1099, 3513, 1876, 4003, 2930,
        786,   72,  584, 3295,    9, 3190,  267, 1337, 3201, 3530, 1487,
       2295, 3320, 1452, 2347, 3194,  398, 3745, 1103, 3959, 1623, 1972,
       3709, 3783, 2716, 2098, 1206, 3019, 3311, 2092, 1230, 2698, 1808,
        944, 2149,  633, 1132, 3314, 3258, 2633, 2589,  677,  885, 2107,
       1691, 3446,  664, 1387, 1527, 1636, 1002,  488,  841,  211, 1476,
       1333, 2268, 1653, 3400, 1982,  306, 2316,  672,  358, 2898,   28,
        805,  902,  529, 1383,  890,  986, 2373,    5, 2062, 1288, 2556,
       2283, 3621,  614, 2231, 2649, 2909,  438, 1187, 2207, 3454, 2559,
       3145, 2361,  658, 1049,  213, 3476,  235, 2751, 3550,  799,  313,
        482, 2970, 1419,  422,  978, 2236, 1137, 3817, 3459, 1027, 3310,
       1354, 1488,  580, 3422, 3262, 2870,  332, 3536, 1294, 2902,  716,
       2490, 3932, 2086,  628, 2971, 2155, 1210, 3342, 1780, 2541, 3710,
       2895, 1826,  744,  120, 3102, 1414, 1323, 3843, 1717,  475, 2440,
       1342, 3008, 3138, 3004, 4084, 3421, 1777, 1251,  343,  341,  965,
       3033, 2164, 3169, 1671,   55,  362, 2570, 2671,  733,  279, 3705,
       1486,  503, 2100, 1070,  140, 2620, 2515,  715, 1908, 1203,  156,
       2587, 1317, 4089,  398, 1384, 1665, 1733, 1407, 2913, 1622, 1649,
       2324,  472, 3545, 2441,  362, 2704, 2691, 1290, 1185,  240, 3948,
        330, 2134, 1279,  398, 3672,  358, 1643, 4028, 2662, 3131, 1642,
       2848, 3441, 2240, 3953, 3558, 1536, 1903, 3344, 1601, 1060,  427,
       3423, 3357, 3978, 1358,  117, 2115,  398, 1915,  451, 1779, 1423,
        920,  222, 2004,  465, 3620, 2714, 4031, 3463, 2200, 2985,  382,
       3872,  192, 1994, 2434,   15, 1864, 1871, 1468,  226, 3650, 3908,
       1035, 2660, 1975, 2002,  852, 1059,  804, 1109, 1574, 3445,  221,
       2220, 1528, 1886, 3938, 3737, 1793, 2642, 2099,  302, 3962,  406,
       1561,  593, 3446, 1285, 3676,  774, 3362, 2608, 1217, 2396, 2400,
       1029, 3130, 3068,  911, 2812, 1203, 1607, 1009,  961, 3783, 2414,
        359, 1123, 1261,   18, 1746,  404,  636, 1116, 3121, 2971, 1435,
       1797, 2266, 3544, 1956, 1285,  953, 2459,  153, 3094, 2288,   97,
        401, 1303, 1045, 2953, 2332, 1194, 1992,  414, 3394,   39, 3759,
       1294, 1350, 3696,  309,  583, 1842, 2767, 1034, 2438, 2029, 1502,
       3689, 1914, 2350, 3472, 2312,  352,  392,  213, 3384,  457, 2275,
       2651, 1155, 2987, 2981, 2520, 3738, 1666, 1710, 2475,  219, 4059,
       1960, 2481, 2144,  789, 2486, 3527, 1155, 3834,  314,  573, 1156,
       1117, 1568, 3024, 3506, 1313,  335, 3817, 1185,  420,  915,  530,
       1570, 2586,  374, 2519, 3550, 2167, 2793, 1665, 3719,  347, 1305,
       2993, 3636,  630, 1771, 1326,  737, 1780, 2634, 3459,  960, 3489,
        691, 3462, 2593,  217, 3906, 2136, 1247,  357, 2690, 4020,  158,
       3403, 3595, 3106, 3764, 3559,  653, 3272,  309, 1346, 1961, 3149,
        232, 3386, 1413, 3840,  599,  705, 1750,  634, 3810, 4038, 2262,
       2842, 3891, 2803, 2196, 2239,  753, 1319, 1124, 4032, 3523, 2722,
        298,  714, 1953, 2243,  188, 3156, 1703, 3183, 2720, 2560, 2421,
       3308, 2335,  552,  417, 2874, 1392,  336, 2900, 1536,   15,  455,
       2941, 1340,  274, 3302, 3145, 3906, 2701, 1338, 2648, 1330, 3529,
       3003,  591, 1304,  513, 2091,  832, 2712,  662, 2653, 3404, 2173,
        754, 2877, 3345, 3495, 2801, 1023,  978, 4020, 3907, 1229, 1604,
       3161, 1988, 1326, 1988,  747, 2532, 2726, 2893, 2926,  372, 3691,
       1096,  953,   51,  871, 3439, 2454,  892, 1767, 2022, 1010, 2195,
        665, 2319, 3458, 2721, 3800, 1553, 2702,  702,  751, 1356,  288,
       1023, 2834, 2948, 2822, 4038, 1196,  875,  992, 2096, 2051, 1386,
        674, 2819, 3194, 1571,  792, 2345, 4052,  244,   77, 3950, 2205,
       3675, 1067, 1448, 3235,  900, 1053,    6, 2303, 2315, 3841, 4078,
       3856,   23,  790, 2096, 1404, 3462, 3360, 1400, 2134,  719, 1064,
       1905, 1457, 3245, 2571, 3139, 1863, 1945,  250,   68, 3831, 2994,
       3538, 1030, 3390, 1028,  779, 2950,  214, 1112,  244, 2278, 3169,
       2114,  875, 3086, 3965, 2397, 1453, 1956, 3952, 1581,  763, 3898,
        421, 2640,  447, 1900, 1613, 1134,  582, 2636, 1712, 2276, 1014,
       3287,  321, 1457, 2043, 2197, 3296, 3715, 1344,  112, 1032, 3047,
       1091,  465,  442,  858, 3219, 3553, 2087, 3748, 3472, 2111, 1722,
       1151, 3197, 1259, 3920,  198, 3806, 1639, 3755,   87, 1930, 1032,
        286, 1403, 3946, 1550, 3249,  649, 3322, 3091, 2448, 3142,  860,
         85, 2950, 3184, 4004,  678, 2459, 2361, 1614, 4008, 3336, 3329,
       3734,  532, 1844, 1088, 3704, 2326, 3412,  515, 1762, 1510, 1256,
       3265,   86, 1465, 1684, 4016, 4016, 1466, 1172,  380, 3991, 1332,
       1162, 3489, 1535, 1356, 1948, 3555, 1784, 3530,  601, 1088,  695,
       3088, 3156, 2121,  648, 3845, 3254, 1910, 1073, 1530, 1809,  228,
       3064, 1071, 2419, 2263, 3922, 1915, 4000, 3087, 2268, 1088, 2717,
       1829, 1962, 1128, 2354, 2757, 2821, 3993, 2325, 2555, 1473, 1779,
       1704, 1552,  129, 2839, 2243, 4050, 1018, 1725, 3100, 3753, 1107,
       1918, 1421,   76, 2006, 3575, 1484,  926,  837, 2099, 2323, 1284,
       2751, 2603, 3234,  544, 3421,  185, 1888, 3976, 1258, 1525,  325,
       2967, 3749,  535, 2098, 3311, 3922, 3443, 3871, 1248, 4062, 2968,
        986,  925, 3489, 3063, 3185,  612, 3187,  489,  723,  863, 2659,
       2438,   38,  486,  942,  870, 3867, 1868,  881,  918, 3228,  611,
       3230, 1167, 2806, 2590,  373, 2762,  906, 1814, 3490, 1162, 1191,
        596, 1235, 3763, 1515, 3512, 1935, 3505, 1794, 3074, 2625, 3108,
       1446, 2122, 4075, 3533, 1863, 2808, 1800, 1753, 1873, 1049, 3665,
       1766, 2556, 1603, 1532, 1922, 3797, 4005,  737, 2565, 1652, 4059,
        479, 1635,  730, 1683, 3710, 1960, 2484,  709, 3210, 3673,  499,
       4041, 3375, 3855, 1972, 3036, 2355, 3777, 3657, 1097, 2726, 2419,
       2575, 3153, 3863, 2522,  987,  768, 1450, 1527,  996, 1956, 2343,
       3742, 3005,  184,  597,   19,  472, 1405, 2522, 3201, 2107,  870,
       1586, 2097, 2439, 2584, 3042,   99, 2976, 2845, 2010,  440, 3214,
        764, 3686, 2762, 3610, 3034, 3477, 3264, 2548, 2241,  338, 3505,
       1954, 2855,  595, 1647, 3882, 2805,  895,  692,  642, 1839,   99,
       4078, 3628, 2311, 3792, 3875, 1155,   44, 1568, 3381, 2233, 3982,
       2638, 2983,  790, 1950, 3269,  543, 3855, 1452, 1854, 1038, 1461,
       2306, 2109, 1080, 2302, 1780, 2997, 2268, 2497, 3232, 3832, 3682,
        306,  572,  911, 3690, 3139, 1033, 2629,  162, 3846, 2612, 2071,
       1751,  433,  446, 3411, 1885, 1901, 1736,  438, 1454, 1001, 3023,
        498,  928, 2658,  245, 1055, 2206, 2643, 2188, 1288, 3029, 1062,
       3548, 3281, 1169, 2478, 1270,  108, 2590, 1949, 1303, 2729, 3887,
        685, 3856, 3171,  373,  166,  934, 2856, 3945, 2493, 3468, 1451,
       3713, 2806,  743, 2440, 2965, 3563, 2357, 2750, 3194, 2866, 1395,
        932, 2053, 2788, 2124,  469, 2270, 2010, 2483, 2973, 3439,  763,
         66,  133, 3616, 2507,  200,  338, 1830, 3368,  355,  962, 1562,
       2296, 3092, 3900, 1497, 3367, 1897,  562, 3248,  426,  797, 3534,
       2543,  706, 3188, 2320, 4085,  338, 3361, 1910, 1397, 2207,  988,
       3905, 3867, 2116, 1744, 2195, 2184,  982, 3658,  765, 2604, 3591,
        958, 3003, 1579, 3591,    6, 1452, 2808,  134,  195, 1261, 1018,
       3081, 3519, 1692, 3629, 3691, 2014,  585,  481, 1490, 1455, 3440,
        718, 1029, 3257, 3376,  929,  856, 2590, 1658, 2406, 1071, 2035,
       1127, 2139, 1501, 2264, 3625, 3264, 3596, 2445,  799, 1444,  860,
       1743, 2768,  364, 1308, 3855, 1996, 3296, 2438, 3842,  101,  993,
       3429,  719,  827, 2111, 1281, 1086, 1584,  691, 1045, 3695, 2007,
       3788, 1465, 2113,  917, 2854, 2041,  249, 2903, 2789,  580,  125,
       3352, 1536,  637, 3391, 2125,   13, 4062,  540, 1307, 2914, 2923,
        590,  423, 1251, 1861, 3677, 2618, 1080, 1021, 3662, 1541, 3771,
        202, 3842, 2744,  720, 1057, 3666, 3659, 3942,    2, 2527,  520,
       1057,  246, 3904, 3007, 2037,  793, 4040, 1421, 1052,  345, 1912,
       3983, 2290, 3457,  704,  930,  390, 3253,  453, 3937, 1160, 1087,
        824, 3692,   39, 3347,  427, 2071, 3828, 3738, 3036, 3833, 1741,
       3077, 1495, 1291, 3089, 1600,  138, 1034,  692, 1179,  899, 1261,
         95, 3778, 4026, 4083,  571,  752, 1110,  541, 1086, 2547, 3002,
        169, 3136, 1104,  605, 2021, 3007, 3056, 2495, 2188, 1180, 3777,
       1071, 2364,  177, 4051,  418, 2784, 1620, 1256,  539, 2228,  980,
        518, 2716, 2361,  276, 2279,  563, 4072,  923, 1725, 3211, 2150,
       1171, 3876, 1246, 1580, 2421,  423, 2877, 3368, 1442, 2722, 1488,
       1479,  612, 3404, 3126, 1872,  278, 3013, 3905, 1220, 2389,  766,
       3014, 2752, 2199,    1, 3269, 4056, 1443, 1615, 2150,  551, 3462,
       3486,  410,  787,  251, 4074, 3796,   51, 2972, 2222,   91, 3681,
       1205,  952,  848,  227, 2560, 1968, 1337,  683,  749, 3038, 3781,
       1233, 2895, 2610, 2662, 1739,  782,  929, 2112, 3821, 1319, 1611,
       3486, 1653, 3840,  196, 4056, 2338, 2619,  258, 3691,  443, 3591,
       3885,   63, 4063, 3008, 3161,  958, 3667, 4006,  329, 3669,  232,
       1549, 1277, 3865,  227,  556,  207, 1361, 2924, 2737, 3466, 3789,
         64, 2205, 2455, 3846,  661, 2181, 3827, 2159, 3028, 2851, 1754,
       3249,  678, 3716, 3742,  565, 1202, 2408,  445, 1681, 3550, 2148,
       3795, 3701, 3990,  953, 2202, 2799,  603, 2533, 2381, 3101,   18,
        703, 2687,  273, 3984,  590, 2857, 1914, 1561, 2665, 4045,  624,
        239, 3200, 3493, 2040,  119, 1763, 3553, 3707, 3494, 1660, 2169,
         74, 4057,   26, 1306,  374, 4055, 2484, 1453, 2224,   76,  835,
       2502, 1852, 4040, 1115, 2634, 2876, 3564, 1050, 1257,  985, 2041,
        934, 1262,  736,   63, 1024, 1564, 1664,  933, 2901,  860, 3968,
         34, 2070, 3918, 1520, 1324,  175, 3212,  722, 1662, 2213, 1860,
       3002, 2198, 2827, 2185, 3457, 3503, 1810, 2371, 1509, 3817,  627,
        553,  259, 2689, 2637, 3967, 3182, 1761, 2171,  917, 3035, 2429,
       3519, 1135, 1726, 3617, 2932,  579, 3922,  328, 3435, 1877, 1295,
        466, 1259, 1259, 3142, 1752, 1060, 1369, 3814, 3160, 3807, 3928,
       1298, 3325, 3005, 3066, 2550, 1878,  975, 3880,  860, 3202, 3263,
       1790, 3008, 3183, 2898, 3937, 2966,  919, 1132, 1725, 3476, 1723,
       1729, 2296,  277, 3008,  130,  703,  291, 3764, 1362, 2275,  210,
       1169, 1321,  923,  986, 2872, 1050,  404, 1563, 2945,  158,  382,
       2322, 4041, 2544,  610, 1562, 1903,  435,  795,  976, 1704, 1198,
       2305, 2083, 1360, 1267, 2059, 2438, 2398, 1257, 3259, 1437, 3657,
       2381, 3637, 1373, 1262, 1479,  637, 3227, 2008,  176, 3884, 3330,
       1621, 3586, 3096, 3582,  708, 1710, 2725,  407, 1940, 4068, 3429,
       2727, 2771,  244, 3742, 3912, 3161, 1827,  442, 3741,   40, 1405,
       3250, 2775,  620, 3566,  752, 1518, 1616, 3684,  236, 1068, 4095,
       2372, 3633, 3157, 1576,   56, 3560,  450, 1827, 1853, 2808, 1300,
       3357,  123, 2605, 1992, 3846,  812,  691, 1011, 1959, 2787, 2699,
       3651, 3526, 1374,   72, 2405, 3662, 3024,  920, 1592,  751,  826,
       1604, 2261, 2671, 2699, 1963, 2014, 1767,  881, 2038, 1520, 3000,
        932,   21, 3106, 2065, 2670, 2218, 3255, 2041, 2143, 3634,  689,
        468,  518, 3958, 2590, 2068,   10,   76,  375,  181, 1737, 3583,
       1251,  361, 3811, 1604,  705, 3112, 2496, 3636, 3120, 1356, 2152,
        399,  644, 2976, 2381, 1494,  491, 1588, 3704, 3344, 3282,   82,
       3394, 1556, 3050,  370, 2772,  842,  642, 1309, 1927, 3780,  779,
       1852,  676, 1913,  503,  280, 2382, 3126, 3374,  277, 2702, 2599,
       3752, 2103, 1308,  322,  882,  715,  947, 1367, 4027, 3086, 1476,
       2711,  721, 1587, 1653, 3906, 1112, 1478, 4054,  503, 3326, 2843,
       3210, 1801,  774,  931,  189,  282, 3803, 3595,  272, 4022,  826,
       1807, 2355,  901,  273, 2692, 3467, 3958, 2668, 2588, 1630, 3248,
       3873, 2921, 3899, 1897, 3709, 3992, 2665, 1655,  223,  233, 3376,
       3051, 1812,  427, 3462, 2994, 2195, 1991, 1623,  116, 2005,  498,
       2382,   76, 3538,  899,  146, 1783, 1085,  349, 2269, 2494, 3037,
         87,  254, 3466, 2287, 1395, 2420, 3657, 3381,   56, 3482,  896,
       2468,  296, 2305, 1073,  976, 3320, 3437,  696, 2500, 3369,  969,
       1827,  547, 3971, 3240, 3006,  780, 3333, 2227,  310, 3447, 3366,
       1199, 2170, 4093, 3987,  235,  389, 2975,  976, 4082, 3263,  825,
       2277, 3041, 2185, 2182, 1526, 1507, 1665, 3402, 1799, 1597, 1958,
        480, 2666, 2774, 1056, 1893, 3828, 1356, 1078, 3696, 3805, 1785,
       1266,   95, 4093, 2743, 2354, 3614, 2348, 1554, 3572, 3692,  744,
       3656, 1975,  421, 1287, 3461, 3172, 3730,  602,  773, 3562, 3065,
        218, 1286, 2921,  503, 2407, 1222, 3616, 2733,  641, 1090, 2996,
       2335, 1108, 3429, 2691, 3256, 3316, 2192, 3246, 1875, 3377, 3266,
         48, 1660, 2179, 3154, 1015,  457, 1706, 2828, 3701,  987, 1532,
       3147,  931, 3796, 3930, 1148, 1107, 2461,  533, 3173, 2723, 2313,
       3585, 2563,   52,  634, 2925,   73, 3382,  888, 1200, 3335, 3793,
       2123,  285,  502, 3616, 4014, 2408, 3098, 3809, 3622, 3108,  545,
       2521,  467, 2407, 2358, 1282, 2701, 1151,  912,  252, 2626, 1860,
       1821, 1387, 1733, 2787, 3044,  514, 2566, 2581, 3989,  851,    2,
        626, 1145,  555, 2338,  557, 1027, 1211, 1291, 2653, 2470, 2453,
       1185, 3665, 1837, 2986, 2837, 1820,  562, 1114, 1488, 3033, 3524,
       3225, 3709, 2710, 3160, 1617,  930,  888, 1407, 2004, 1618, 1747,
       1265, 2014,  426, 3393, 3787, 2938, 1123,  597, 1796, 1433, 1550,
       3071, 1265, 3829, 1339, 3103, 1601, 2724, 3833, 1083, 3343, 1926,
        900, 4090, 1789, 2811, 3656, 3298,  200, 3122, 2622, 1883, 2891,
       2461, 2382, 2793, 3362, 1236, 3045, 2985, 1180, 2734, 1993, 2015,
       3536,  275, 3631,  557, 3299, 3291, 3058, 1881,  855, 1436, 3844,
        140, 1054, 2545,  484, 3258, 3482,  175, 1064, 2990, 3871,  435,
       3659, 3240, 1798, 3513, 2548,  142,  268, 2554, 2495,  337, 2484,
       1153, 1544, 3079, 3313, 1131,  667, 3903, 2027,  626, 3779, 3448,
       2691, 2501, 1564,  171, 2985,  257,  199, 2445,  750, 2233, 1959,
        966, 3535, 3619,  699, 3036, 3967,  501, 4090, 1105, 1815, 1758,
        444, 2130, 3425, 3541, 3190, 3374, 2623, 3815,  282,  757, 2916,
        934, 2338, 1338, 2266, 1606, 2281,  427, 1086,  390, 3303, 2455,
       2550, 3988, 2687,  681, 3869, 2638, 1320, 2889,  795, 3497,  797,
       3028, 3679, 3157,  599, 3995, 2124, 2708, 2538,  850,  336, 1522,
        553, 1800, 3895, 4072, 3022,  720, 1213,  754, 3321, 3918, 1094,
       2840,  755, 1548, 2194, 2987, 3739,  914, 2474,  309, 2520, 3977,
       3180, 3314, 3790, 1106, 1898, 3873, 3967, 3056, 2737, 2176, 3247,
       1348, 2276, 2928, 3658, 3063,  570, 2693,  344, 1409,  351, 1707,
        905, 4068,  631, 2972, 3441, 2913, 1579,  293,  903, 1231, 3416,
        852,  384, 2539, 3481, 1008, 2945,  548, 2379, 1223,  766, 1646,
       1032, 3837, 3072,  271,  525, 1146, 2414, 2815, 1939,  544, 3625,
        470, 3591, 3654, 2568, 2779, 1647, 2384, 1893, 3464, 4017, 3431,
        537, 3403, 3520, 1771, 1557, 1015,  211,  902,  463, 2305,  654,
       3103, 4086, 2999, 3960,  365, 2094,  104,  917, 3168, 1566, 2211,
       1541, 3890, 1578, 1772,  599, 2618, 1471, 3771, 3612,  116, 1593,
        245,  496, 3476, 2717,   32, 2946, 1380, 2524,  655, 2254, 2747,
        335, 2163, 2575, 3348, 3621,  255, 2362, 3708, 1080, 3854,  828,
        522, 4014, 4005, 2522, 2989, 3567, 1754,  289,  332, 2540, 3803,
       1989, 2999, 2955, 2200, 1134,  594,  758, 1945,  382,  866, 3966,
       2003, 4017, 1251,  555, 1149, 4071,  138, 2273,  565, 1851, 1580,
        109, 2572, 1962,  772, 3792, 1234, 3544,  692, 2940,   97, 3835,
       2053, 2984, 4020, 3044,  307, 3752, 2702,  717,  479, 3102,  256,
       1236, 1761, 1180, 1209,  876, 1453, 2942, 3327, 2231, 2414, 3539,
       1991,  571, 3280, 2039, 3893, 1569,  450, 2030, 3931, 3861, 3436,
        877, 1698, 2062, 2341, 2705,  387, 2004, 1661, 3069, 1920,  302,
        853, 1832,  771, 3448,  397,  874, 3688, 4043, 2291, 3658,  737,
       2971, 3395, 1190, 3488,   40, 2251, 3635, 2597, 3261, 1410,  332,
       1352, 1130, 3010,  824,   62, 4067,  488,  616, 2011, 3620, 2881,
       1468, 1336, 1420,  512, 3214, 1081, 2579, 3108,   54, 2156, 2550,
       3433,  163,  301, 3495, 1579, 2837, 3524, 1635, 2423, 2821, 4041,
        708, 3039, 3799,   41, 1352, 2062,  281,  707, 3527, 3402,  761,
       3560, 3691, 2772,  850,  656,  469, 3170, 1620, 2673, 3393, 1833,
       2064, 3477, 3168, 2311,  109, 1637, 1873, 1576, 3779, 1035, 2188,
        771, 1102, 3815, 1472,  143, 2497,  355, 2913, 1827, 3674,  743,
       3690, 2524,  414, 3543,  529, 3646, 1851, 2598, 2800, 3844,  470,
       2832,  599, 2505, 3767, 2929,   78, 2091, 1002,  343, 1133, 1340,
       2886, 3740,  890, 3053, 3300, 1910, 3731, 4095, 1982,  520, 3696,
       2969, 3122, 3983, 2189, 3772, 1024, 3393,  709, 2368, 2250,  334,
       3287, 3257, 1131,  742, 2038, 3759,  131, 2233, 1872,   58, 1020,
        149,   76, 1329, 2446, 3540, 1794, 3464, 2496,  300, 1964,  434,
       1263, 2045, 2442, 2902, 1968, 1375, 3309, 2644, 3148, 1447, 2633,
       4028, 3692, 1882, 2886, 1052, 1471, 2079, 1796,   13, 3814,  967,
       1685, 3217,  647,   98, 3867, 3988, 2501, 4013,  796, 1213, 1048,
       1573, 1820, 2485, 2711, 2202, 1960, 2688, 1273, 3833, 1054, 2411,
        466,   99, 3753, 3895, 1114,  417,  964, 1388,  134, 1357, 2705,
       1820, 2771, 3574,   78, 1900, 3079, 1909, 3612, 3938, 1325, 2240,
       2427, 1347, 2596, 2197,   68, 2972, 2923, 1357, 1274, 3612,  936,
       3054, 3126, 1539, 3613, 1292, 1348,  629, 2700, 1810, 3088, 3715,
       4063, 1173, 1484,  104, 2992, 3159, 4038, 3528,   93,  141, 3811,
       2290,  147, 1711, 1601, 2428, 1747, 2386, 1709, 1717,  956,  941,
       3690,  612, 3321, 2766, 3587,  216, 3292, 3700, 2217, 2998, 1616,
       2038, 3280,   87, 1004, 2742, 1508,  641, 3686, 1632, 3967, 3431,
       2463, 2240, 2844, 2780, 1042, 2492,  533, 3727, 2131,   83,  861,
        628,  308, 1785, 3196,  515, 3982, 3288, 1762, 1183, 2530, 2482,
       3378, 3109, 2646,  712, 3650, 2354, 3496, 2151, 1476, 1330, 2613,
        641, 3312, 2997,  593,  964, 2938,  362, 1870, 1690,  604,    2,
        378, 3608, 3514, 2944, 2850, 1124, 3907, 3741,  928, 1324, 2411,
       2658, 3032, 1964,  305,  511, 2642,   48,  357, 2662,  409, 1505,
       2073, 3741,  267,  802, 1746, 3111, 4074, 1643, 1517, 2617, 1671,
         43, 3437,   64, 1862, 2144, 1164, 3897,  340,  384, 2694, 3481,
       2573, 3324, 3483,  495, 1087,  484, 1358, 3465,  860, 3739, 2604,
       1445, 3382, 1830, 1988, 1188, 1084,  823, 2841, 1210,  116,  699,
       1728, 2838, 3415, 3519, 2520, 2673, 2670, 2427, 1658, 3950, 3983,
        874, 3795, 3548, 1708, 3236, 2006, 1003, 1852,  503, 1215, 1843,
       1737, 1588, 1574, 1971,  454, 3854, 1121, 2464,  936, 3302, 1120,
       2537, 1729, 2152,  847, 2550, 1969, 1310, 3944, 3631, 2112, 1420,
       1134,  112, 2861,  640, 1101,   48,  203, 2496, 1856, 1020, 3178,
         94,  971, 1096, 2568, 2412, 2527, 3453,  508, 2062, 2136, 3214,
        878,  676, 3939, 3076, 1725, 2857, 2300, 2781, 3288, 4062, 2166,
        994, 2765, 2351, 1357,  127, 3858, 1901,  101, 4080, 1718, 2210,
       2384, 1416, 3616, 2378,  115, 2064,  613, 2247, 3699, 3649, 2793,
       1890, 1445, 3326, 2722,  767, 2867, 1635, 3015,  288, 3118, 1637,
       3196, 2548, 1217, 3022, 2827, 1904, 3334,  155, 2266,  244, 1311,
       2231,  979, 3668,  735, 2586, 3666, 1807, 3173,  849, 3193, 3233,
        911, 3963,  433, 1708, 2645, 4058, 1663, 1745, 3399, 1137, 3483,
        632, 3442, 2360, 4091,  177, 1124, 1746, 2567, 2139, 2174, 2390,
          0, 2165, 1964, 2536, 2143, 1868, 3123,  584, 2062, 3877, 3927,
       3116, 1030, 3517, 3149, 2245, 1764, 1201, 1823, 2885,  517,  600,
       3603, 1055,  376,  588, 1088,  355, 3362, 3021, 1241, 3711, 3969,
       3731, 4088, 1117, 1199,  567, 2657,  527,  859, 1648, 1933, 2225,
       2528, 4056,  549, 1931, 3994, 2223, 3139, 2236, 3053, 1915, 2817,
       1954, 2933, 3595, 2265, 2371, 4049, 3233, 3306, 3737, 2813, 1758,
       1486, 1090,  370, 1699, 2269,   16, 1895,  418,  420, 1355, 3947,
       1511,  845, 3068, 2809, 1159, 2800, 3963, 3796, 2779, 1084,  947,
       2889, 1490, 1968, 3078, 1222, 3331, 1664,  907, 4004,  211,  828,
       1037, 3066,  970,    4, 3584, 3909, 2152,   96,  124, 2742, 2879,
       4081, 1879, 1712, 1886, 1454,  333, 2531,  865, 3554,  168, 2385,
       1750, 2312,  206, 2883, 2267, 2529, 1368, 1738,  543, 1560,  223,
       1709,  213, 3473, 2608, 1170, 2482, 3675, 1115,  218,  851, 3005,
       1293, 1393,   10, 1331, 1617, 2063, 3816, 2146, 1488, 3645, 2355,
        148, 3440,  803, 4002,  278, 1458,  912, 1472,  653, 1187, 1648,
       2724, 2639, 2924, 3777, 1348, 3030, 1825, 1820,   33, 3632, 1608,
          8, 3691, 1932, 2100,  308, 2942, 1550, 4024, 2121,  899, 2208,
       1280, 1814, 1925, 1484, 1555, 3295, 2885, 3992, 2787, 1795, 2878,
       1142, 2146, 2757, 1307,  197,  754, 1868, 2278,  988, 1498, 2077,
       3035, 2210, 3268, 2713, 3195, 1001, 2324, 1753, 1675,  716, 1653,
        382, 1435,  773, 3946, 1773, 1645, 2964, 2605, 3145,  652, 2410,
       3297, 2483, 3577, 3878,  944, 3722, 1453, 2055, 2507, 4023, 3814,
         69, 2162, 2742, 2468,   70, 3892, 2570, 1768,  807, 4030, 1830,
         17, 3067, 2080, 4038,  769,  484, 2646, 1710, 1101, 1839, 2994,
       2769, 3871,  660, 1883, 2793, 2731, 2147, 2225, 1423, 3904, 3040,
       1974, 3248, 1476,  979, 1187, 1138, 2493,  105, 3716, 2681, 1177,
        319, 3122, 2460, 2602, 1255, 3331,  761, 2983,  760,  439, 2609,
        815, 1977, 1192, 2629,   43,  909, 1519, 1983, 2237, 1425, 3015,
       1015,  700, 1171, 2655, 1293, 3528,  189,  483, 1341, 3034,  513,
       2165, 3441, 1167, 3306, 1917,  897, 2358, 3870, 1181, 2854, 1443,
        263, 1852, 3376,  271, 2720, 2238, 3125, 2375, 2282, 3640,  613,
       2786, 3676, 3188, 3000, 1478, 1796, 2960, 3020, 2248, 2648, 1383,
       3643, 1050, 1075, 3073, 3833,   18, 3599, 1644,  202,  458, 1582,
       2014, 3108, 1831, 2976, 3948, 1448, 2086, 2884, 3917, 2313, 2214,
       1244, 2857,  421, 1344, 1291, 2270, 1168, 2361, 3408, 2587, 3502,
       2091,  115,  240, 2637, 1850, 2526,  672, 1624, 2504, 2642, 2795,
       3495, 3075,  942, 2495, 3758, 3024, 1022,  627,  942,  865,   11,
       3690,  913, 2333, 1740, 1688, 1811, 3787, 2071, 1833, 1190, 3359,
        418,  241, 1634, 1895, 2491,  287,  115,  349, 1387,  956, 2663,
       1568, 1315,  309, 1392, 2949, 2319, 4067,  320, 3803,  680, 3458,
       1171,  269,  415, 1452, 3430, 1016, 1015, 3365, 2410,  147, 4032,
       2873, 3657,  387,  586, 3737,   11,   82, 3716, 4064, 4085,  620,
       1528,   16, 1311, 2285, 3215, 2588, 3414, 2699, 3256, 4035, 2667,
