graph main_graph (
  %onnx::Sub_1[INT16, 1], exponents: [-13]
  %onnx::Sub_0[INT16, 8x2x5], exponents: [-13]
) {
  %2 = Sub[quant_type = 'S16'](%onnx::Sub_0, %onnx::Sub_1)
  return %2
}


initializers value:



values info:
%2[INT16, 8x2x5], exponents: [-13]
%onnx::Sub_1[INT16, 1], exponents: [-13]
%onnx::Sub_0[INT16, 8x2x5], exponents: [-13]


test inputs value:
%onnx::Sub_0, shape: [8, 2, 5], exponents: [-13], 
value: array([1241, 2313, 7310, 5611, 3442, 7019, 1441, 2596, 2953, 6281, 7300,
       2556, 2480, 3953, 6965,  886,  139, 5976, 3076, 3859, 2875, 5635,
       4253, 6389, 5613, 7498, 2061, 6110, 4498, 6636, 2366, 5147, 3648,
        882, 7798,  109, 3437, 6463, 1252,  986, 3016,  424,  931, 3944,
       5164, 5308, 4516,  466, 2418, 5056, 1510, 1900, 1430, 4460, 7689,
       2405, 6363, 2154, 5329, 6856,  577, 7387, 6808, 6136, 4594,  699,
       6368, 7611, 1512, 3840, 7844, 2453, 2641, 3828, 3121, 5254,  299,
       3776, 6552, 1522], dtype=int16)
%onnx::Sub_1, shape: [1], exponents: [-13], 
value: array([2385], dtype=int16)


test outputs value:
%2, shape: [8, 2, 5], exponents: [-13], 
value: array([-1144,   -72,  4925,  3226,  1057,  4634,  -944,   211,   568,
        3896,  4915,   171,    95,  1568,  4580, -1499, -2246,  3591,
         691,  1474,   490,  3250,  1868,  4004,  3228,  5113,  -324,
        3725,  2113,  4251,   -19,  2762,  1263, -1503,  5413, -2276,
        1052,  4078, -1133, -1399,   631, -1961, -1454,  1559,  2779,
        2923,  2131, -1919,    33,  2671,  -875,  -485,  -955,  2075,
        5304,    20,  3978,  -231,  2944,  4471, -1808,  5002,  4423,
        3751,  2209, -1686,  3983,  5226,  -873,  1455,  5459,    68,
         256,  1443,   736,  2869, -2086,  1391,  4167,  -863],
      dtype=int16)