graph main_graph (
  %onnx::Sub_1[INT8, 2x1x1x1], exponents: [-6]
  %onnx::Sub_0[INT8, 1x3x4x5], exponents: [-6]
) {
  %2 = Sub[quant_type = 'S8'](%onnx::Sub_0, %onnx::Sub_1)
  return %2
}


initializers value:



values info:
%onnx::Sub_1[INT8, 2x1x1x1], exponents: [-6]
%onnx::Sub_0[INT8, 1x3x4x5], exponents: [-6]
%2[INT8, 2x3x4x5], exponents: [-6]


test inputs value:
%onnx::Sub_0, shape: [1, 3, 4, 5], exponents: [-6], 
value: array([38, 20, 36, 52, 23, 24, 13, 59, 49, 35,  6, 60, 21, 43, 59, 25,  4,
       21,  7, 49, 23, 14, 53, 20,  4, 42, 62, 12, 19,  4, 14, 18, 22, 10,
       19, 34, 18, 40,  5, 60, 58, 29, 58, 59, 41, 19, 62, 55, 27, 30, 21,
       44, 17, 10, 57, 24, 30, 48, 18, 59], dtype=int8)
%onnx::Sub_1, shape: [2, 1, 1, 1], exponents: [-6], 
value: array([33, 43], dtype=int8)


test outputs value:
%2, shape: [2, 3, 4, 5], exponents: [-6], 
value: array([  5, -13,   3,  19, -10,  -9, -20,  26,  16,   2, -27,  27, -12,
        10,  26,  -8, -29, -12, -26,  16, -10, -19,  20, -13, -29,   9,
        29, -21, -14, -29, -19, -15, -11, -23, -14,   1, -15,   7, -28,
        27,  25,  -4,  25,  26,   8, -14,  29,  22,  -6,  -3, -12,  11,
       -16, -23,  24,  -9,  -3,  15, -15,  26,  -5, -23,  -7,   9, -20,
       -19, -30,  16,   6,  -8, -37,  17, -22,   0,  16, -18, -39, -22,
       -36,   6, -20, -29,  10, -23, -39,  -1,  19, -31, -24, -39, -29,
       -25, -21, -33, -24,  -9, -25,  -3, -38,  17,  15, -14,  15,  16,
        -2, -24,  19,  12, -16, -13, -22,   1, -26, -33,  14, -19, -13,
         5, -25,  16], dtype=int8)