graph main_graph (
  %onnx::Sub_1[INT8, 1], exponents: [-6]
  %onnx::Sub_0[INT8, 2x48], exponents: [-6]
) {
  %2 = Sub[quant_type = 'S8'](%onnx::Sub_0, %onnx::Sub_1)
  return %2
}


initializers value:



values info:
%onnx::Sub_1[INT8, 1], exponents: [-6]
%onnx::Sub_0[INT8, 2x48], exponents: [-6]
%2[INT8, 2x48], exponents: [-6]


test inputs value:
%onnx::Sub_0, shape: [2, 48], exponents: [-6], 
value: array([15, 28, 37, 40, 47, 58, 32, 51,  2, 11, 25, 14, 60, 20,  4, 54, 53,
        3,  6, 56,  2, 51, 42,  2,  5, 55, 46, 52, 25, 38, 37, 10, 50, 10,
       24, 26, 50, 51, 46, 20, 59, 15, 21, 56, 35, 45, 29, 14, 52, 31, 32,
       33, 58, 23,  7, 36, 33, 61, 53, 10,  5, 43, 25,  6,  7, 45, 10, 13,
       12, 54, 32, 39, 51, 59, 55, 33, 44,  8, 10,  8, 46, 23, 52, 26, 31,
       62, 31, 36, 15, 11, 55, 49, 28, 38, 43, 31], dtype=int8)
%onnx::Sub_1, shape: [1], exponents: [-6], 
value: array([15], dtype=int8)


test outputs value:
%2, shape: [2, 48], exponents: [-6], 
value: array([  0,  13,  22,  25,  32,  43,  17,  36, -13,  -4,  10,  -1,  45,
         5, -11,  39,  38, -12,  -9,  41, -13,  36,  27, -13, -10,  40,
        31,  37,  10,  23,  22,  -5,  35,  -5,   9,  11,  35,  36,  31,
         5,  44,   0,   6,  41,  20,  30,  14,  -1,  37,  16,  17,  18,
        43,   8,  -8,  21,  18,  46,  38,  -5, -10,  28,  10,  -9,  -8,
        30,  -5,  -2,  -3,  39,  17,  24,  36,  44,  40,  18,  29,  -7,
        -5,  -7,  31,   8,  37,  11,  16,  47,  16,  21,   0,  -4,  40,
        34,  13,  23,  28,  16], dtype=int8)