graph main_graph (
  %onnx::Sub_1[INT8, 1], exponents: [-6]
  %onnx::Sub_0[INT8, 2x5], exponents: [-6]
) {
  %2 = Sub[quant_type = 'S8'](%onnx::Sub_0, %onnx::Sub_1)
  return %2
}


initializers value:



values info:
%onnx::Sub_1[INT8, 1], exponents: [-6]
%onnx::Sub_0[INT8, 2x5], exponents: [-6]
%2[INT8, 2x5], exponents: [-6]


test inputs value:
%onnx::Sub_0, shape: [2, 5], exponents: [-6], 
value: array([10, 47, 47,  5, 30, 47, 14, 10, 16, 20], dtype=int8)
%onnx::Sub_1, shape: [1], exponents: [-6], 
value: array([49], dtype=int8)


test outputs value:
%2, shape: [2, 5], exponents: [-6], 
value: array([-39,  -2,  -2, -44, -19,  -2, -35, -39, -33, -29], dtype=int8)