graph main_graph (
  %onnx::Sub_1[INT16, 2x1], exponents: [-14]
  %onnx::Sub_0[INT16, 8x2x5], exponents: [-14]
) {
  %2 = Sub[quant_type = 'S16'](%onnx::Sub_0, %onnx::Sub_1)
  return %2
}


initializers value:



values info:
%2[INT16, 8x2x5], exponents: [-14]
%onnx::Sub_1[INT16, 2x1], exponents: [-14]
%onnx::Sub_0[INT16, 8x2x5], exponents: [-14]


test inputs value:
%onnx::Sub_0, shape: [8, 2, 5], exponents: [-14], 
value: array([14817, 13700, 14602, 13164, 11988,  8188,  9919,  8735,  8269,
         129,   345,  6911, 10767,  3821,  5320,  8823, 13676,  3016,
       16273,  2945,  1330,  7095, 12588,  5029,  9181,  3894, 10885,
        1492,  1874,  8877, 10602,  6068,  6250,   570,  4170, 16035,
        5649, 14575, 13500,  7894,  4858, 13724,  3076, 13879, 11241,
       15947,   964, 16043, 15561, 10695,  7006,  6384, 12840,   418,
       11929, 14040, 13967, 11800,  5693, 11717, 10888,  5585,  4037,
       13378, 15280,  4247,  3386,  7824,   441,  9588,  2092,  7927,
        5516,  9343,  6358,  1992, 11123, 16121,  6203,  4775],
      dtype=int16)
%onnx::Sub_1, shape: [2, 1], exponents: [-14], 
value: array([13940,  9552], dtype=int16)


test outputs value:
%2, shape: [8, 2, 5], exponents: [-14], 
value: array([   877,   -240,    662,   -776,  -1952,  -1364,    367,   -817,
        -1283,  -9423, -13595,  -7029,  -3173, -10119,  -8620,   -729,
         4124,  -6536,   6721,  -6607, -12610,  -6845,  -1352,  -8911,
        -4759,  -5658,   1333,  -8060,  -7678,   -675,  -3338,  -7872,
        -7690, -13370,  -9770,   6483,  -3903,   5023,   3948,  -1658,
        -9082,   -216, -10864,    -61,  -2699,   6395,  -8588,   6491,
         6009,   1143,  -6934,  -7556,  -1100, -13522,  -2011,   4488,
         4415,   2248,  -3859,   2165,  -3052,  -8355,  -9903,   -562,
         1340,  -5305,  -6166,  -1728,  -9111,     36, -11848,  -6013,
        -8424,  -4597,  -7582,  -7560,   1571,   6569,  -3349,  -4777],
      dtype=int16)