graph main_graph (
  %onnx::Sub_1[INT8, 1x1x1x31], exponents: [-5]
  %onnx::Sub_0[INT8, 1x5x5x31], exponents: [-5]
) {
  %2 = Sub[quant_type = 'S8'](%onnx::Sub_0, %onnx::Sub_1)
  return %2
}


initializers value:



values info:
%onnx::Sub_1[INT8, 1x1x1x31], exponents: [-5]
%onnx::Sub_0[INT8, 1x5x5x31], exponents: [-5]
%2[INT8, 1x5x5x31], exponents: [-5]


test inputs value:
%onnx::Sub_0, shape: [1, 5, 5, 31], exponents: [-5], 
value: array([ 2, 24, 15, 18,  4, 15,  5, 16, 21, 30, 17, 22, 20,  4,  6, 31, 29,
       21, 26, 18,  0,  3,  4, 14,  2, 17,  4,  5, 17, 16,  1,  9, 18, 17,
       14, 25, 26, 22, 17, 26, 19, 11, 10, 20, 10,  8, 30, 13,  9,  3,  9,
       14,  5,  3,  4, 31, 23, 15, 24,  6, 32, 16, 17,  1, 26, 25, 29, 10,
        8, 30, 32, 29, 25,  2,  9, 21, 18,  9,  0,  3, 16, 22, 29,  5, 31,
        6, 15,  1, 23, 10, 31,  3, 27, 19, 17, 21, 24, 16, 23, 10, 14, 16,
        1, 18, 20, 26, 27, 11, 27, 14, 26,  3, 31, 26, 17,  6,  7, 16, 15,
       31, 22, 32, 14, 30,  2,  1, 21, 31, 13, 24, 22,  3, 30, 12, 27, 11,
       18, 29, 26,  6, 29, 20, 13, 20, 15,  2, 24, 16, 23, 15, 18,  6,  6,
       32, 32, 11, 26,  6, 17,  7, 28, 11, 25, 29, 19, 13,  6,  1, 29, 14,
       20, 31, 11,  9,  4, 31,  2, 20, 27, 12, 22, 17, 10,  6, 24,  1, 28,
        0, 13, 18,  8,  3, 15, 26, 28,  2, 24, 20, 28, 14,  4, 17,  3, 21,
        0, 15, 31, 30, 17, 19, 23, 28, 30, 17, 19, 11,  9, 25, 29,  4, 25,
        9, 28, 31, 24, 12,  5, 12, 18,  3,  8,  5, 30, 20, 31,  6, 26, 32,
       23,  1, 16, 19,  1, 16, 22,  1,  0,  0, 30, 29, 31, 21, 15, 25, 27,
       14, 27,  8, 29,  7,  1,  8, 13, 14, 30, 15, 22, 19, 13, 11, 15, 27,
       17, 12, 15, 18,  9,  0, 16,  6, 24, 18, 10, 26, 13, 21, 28, 13, 28,
       20, 25, 18, 13,  1, 20, 17,  9, 31,  5, 31,  7, 20, 30,  5,  1, 14,
       32, 12, 18,  4, 14, 12,  8,  8, 13, 23, 10, 11,  1, 22,  2, 25, 30,
       30, 30,  4, 27,  8, 31, 32, 29,  0,  8, 26,  8, 12,  1, 23, 15, 24,
       24, 18, 23, 27, 21,  3, 19, 12, 25,  7, 10,  5, 24, 12, 13, 30, 24,
       18, 26,  2, 10,  7, 22,  3, 16,  8, 11, 27, 10, 30, 23, 15,  4, 12,
       18,  9, 22, 17, 12,  0, 22, 25, 15, 28, 15, 13, 32, 16,  9, 13, 31,
       16,  3, 27, 11, 22,  7, 30, 31, 20, 11, 30, 15, 20, 19, 17, 24, 12,
       31, 16, 14,  0, 11,  4, 22, 28,  1,  1, 10,  3,  2, 28, 28, 28, 24,
       30,  1, 16, 13, 25,  4, 15, 22, 27,  5,  3, 29, 16, 31,  5, 32,  7,
       23, 27, 28,  5, 14, 14, 15, 20, 28, 24, 30, 29, 26,  0,  2, 17, 30,
       13, 23, 20, 13, 17, 20, 13, 13,  2, 10, 12, 11,  3, 10,  9,  2,  6,
       23, 32, 13, 13, 10,  6, 31, 18, 24,  7,  8,  3, 12, 15, 12,  6, 21,
       16,  6, 31, 12, 29,  3,  3, 13,  4, 32, 17, 12, 28,  9, 27, 14, 21,
       25, 26, 12, 25, 28, 30, 12, 14, 17, 16, 12,  0, 22, 14, 21,  4, 14,
       16, 15, 18, 24, 22, 20, 21, 21,  5,  1,  9,  1, 13, 10, 15, 30, 10,
       28, 21, 31,  3,  2, 27, 19, 24,  7, 17, 17,  7, 19, 17, 22, 12, 11,
       25, 13, 15, 29,  4, 11, 21, 20,  3, 17, 19, 24, 28, 23, 28, 19, 28,
       19,  6,  4, 14, 10, 24, 22,  7, 15,  3, 29, 23,  6,  2, 20, 12, 19,
        6,  8, 28, 24, 12, 27, 20,  5, 17, 20, 22,  8,  0,  1,  7,  0, 31,
       32,  6, 17, 22, 28, 14, 16, 31, 23, 12, 19, 17, 14, 21,  8, 25,  5,
       15, 31, 13, 13, 14, 30, 23, 23,  1, 25, 27, 31, 15, 22, 27, 19,  7,
       16, 10, 15,  7, 30, 17, 27,  9, 16, 10, 32, 27, 25, 22, 23, 18,  3,
       26, 15,  5, 32, 26, 20, 10, 31, 25, 27,  8, 13, 21, 10, 14, 26, 16,
        4, 21, 16, 17, 25,  6, 28, 20,  7, 11, 19,  0,  8, 31, 32, 10, 20,
       25,  4, 15, 19,  7, 28,  4, 27, 10, 25, 12, 31, 13, 16, 12, 20,  9,
       23, 30, 30, 11, 23, 30,  0, 14, 30, 21, 15,  8, 22,  5,  2,  6,  1,
       17, 17, 17, 14,  9, 23, 29, 31,  3, 28, 30, 20, 23, 19,  4, 26, 25,
        2,  4,  9,  5,  6,  5,  5,  7, 19, 15, 28, 15, 25, 27, 22, 16, 20,
       27, 17, 21, 22, 18,  7, 23, 22, 24,  5], dtype=int8)
%onnx::Sub_1, shape: [1, 1, 1, 31], exponents: [-5], 
value: array([24, 26,  4, 29,  3, 28, 24,  2,  2,  3,  6, 23, 32,  2,  1, 11, 14,
        2, 15,  1, 18,  0, 19, 19, 20,  3, 11, 21, 16,  1, 32], dtype=int8)


test outputs value:
%2, shape: [1, 5, 5, 31], exponents: [-5], 
value: array([-22,  -2,  11, -11,   1, -13, -19,  14,  19,  27,  11,  -1, -12,
         2,   5,  20,  15,  19,  11,  17, -18,   3, -15,  -5, -18,  14,
        -7, -16,   1,  15, -31, -15,  -8,  13, -15,  22,  -2,  -2,  15,
        24,  16,   5, -13, -12,   8,   7,  19,  -1,   7, -12,   8,  -4,
         5, -16, -15,  11,  20,   4,   3, -10,  31, -16,  -7, -25,  22,
        -4,  26, -18, -16,  28,  30,  26,  19, -21, -23,  19,  17,  -2,
       -14,   1,   1,  21,  11,   5,  12, -13,  -5,  -2,  12, -11,  15,
         2,  -5,  -5,  -9,  17,  -5,  13,  -5, -14,  12,  14,  -2,  12,
        -3,  -6,  25,  10,  16,   0,  24, -12,  30,   8,  17, -13, -12,
        -4,  12,  20,   1,  16,  13,  -2, -22, -25,  17,   2,  10,  -4,
        -2,   1,  28,   9,  21, -12, -14,  27,  25,  -5,  15,  18,  -2,
        19,  -3,   2,   5,  -3,   3,  12,   7, -15, -10,  31,   0, -13,
         0,   2, -12,   4,   0, -13,  23,  27,  16,   7, -17, -31,  27,
        13,   9,  17,   9,  -6,   3,  13,   2,   1,   8,  -8,  19,   6,
       -11, -10,  23, -31,   4, -26,   9, -11,   5, -25,  -9,  24,  26,
        -1,  18,  -3,  -4,  12,   3,   6, -11,  19, -15,  14,  13,  30,
        -2,   0,   3,  25,  19,  -4,   3,  10, -23,   1,   3,   0,  -4,
         6,   0,   7,  22,  10,   2,   6,  -5, -29,   6,   4,  19,   6,
        29,  -9,  25,  14,  23, -18,  -3,  -1,  -2,   5,   1, -15,  -1,
       -32,   6,   3,  27,  -8,  12,  -3,   3,  12,  25,   5,  23, -16,
       -31,   6,  12,   3,  16,  13,   7,  18,  -5,  11,  -4,   8,  -3,
         9,   4,  -3,  -7,  -1, -16, -18,  -2,  14, -19,  23, -15,  -3,
        26,  11,  25,  14,   2, -14,  11,   0,   9,   3,   7,  16,   4,
        13,   7,   1,  11, -15,  -2,   3,  11,  -4,  17, -28, -10, -14,
         4, -21,  10,  -5, -14,   9,  -1,  19,  -4,   2,  -2,  28,  29,
        -7,  13,   6,  16,  31,  11,   0, -11,   7, -12,   9, -10,   2,
        -1,  23,  -8,  -6,  -3,  23,  -8,   0,  -9, -12,  23,   5,   7,
        -1,   1, -20,  11,  29,  13,   4,  24, -13,   9, -11,  22, -16,
        -3, -12,   8,  16, -11,  14,  22, -17, -20, -14,  14, -20,  19,
       -11, -12,  -2,  20,  22,   9,   5, -17,  11,  31,   5,  -5,  11,
        16,  15, -15,  27,  -8,   3, -13,  27,  20,  -1,  -5,  29, -17,
        -4,  -7,  13,  -5,   9,   3,  -8,  12,  -2,   8,  -2,  -1,  -4,
        -1,   0,  -1, -11,   0,  13,  27,  10,  24,  11, -18,  -4,  10,
        14, -17,  -1,  21,  -5, -19, -23,  25, -13,  28, -23,   8,   5,
        21,  24,  22, -18, -18,  12,  14,   9,  14,  22,  15,  28,   8,
         0, -17,  -2,  10,  10,  12,  -1,  -3,  16, -12, -11, -13,  -2,
       -19,   9, -17, -21,   8,   7,  -1,   0,   0,   0,  11,  12,  -1,
        -8,  29,   3,  23, -11,   8, -16,  -7,  -5,   9,  -5,   0,   0,
         5,  -1, -12,   3,  -1, -26,  10, -24,   8,  15,  10,  25,   3,
         4, -18,  19,  24,  15,  -2,  23,  13,  29,  -6,  14,  -2,  -3,
        -8,  -3,  11,  -7,   5,   3, -18,  -8, -11,  14,  -5,  19,  -8,
        -3,  19,   3,  -2,   3, -22, -19,   8,  14,  19,  -4,  26,   6,
        30, -15,   2,   8,   0,   4,   4,   6,  -4,  -9,  18, -15,  -2,
       -14,   7,  -4,  10, -13,   5,   2,   9,  18,  14, -20, -15,  17,
        23,  17,   9,  26,   4,  27,   1,   6, -15,  -5, -10,  21,  11,
       -14,  -1,   2,  -3,  -1, -20,  -2,  -9,   9,  -9, -18,   6,  26,
        21,   6,   4, -12,   3,  16,   9,   8,   6, -15,   0, -11,   0,
        12,  13, -14,  14,  11,   7,  -2,  15,  -1,  -1, -14,  15, -12,
        11,  -7, -16,  23,   3,  12,  25, -10, -19,  12,  29,  12,   9,
        -1,  10,  26,  13,  15,   3,   8,  -1,   4,   5, -11,  -1,   6,
        -2,  -7,   1,   5, -13,   7,   4,   3,  23,  20,  20,  12, -20,
        -6,  13,   4,  21,  12,  18,  -5,  30,   7,  27, -11,  -6,   1,
         7,   3,   5,   0,   3, -11,  -8,  -9,  21, -23,  25,  -8, -17,
         9,  17,  -3,   2,   8,   0,   8,  19,  14, -10,  13,   4,   6,
        10,   4,   8,  -9,   5,   9,  20,  -8,   0,  11, -12, -15,  -3,
        26,   1,   8,  -5,   6,  -2,  12,  27,  15,  -8, -24,  20,   4,
        -9,  -8,  -1,   2,  16,  -1,  14, -10,   4,   9,  28,  -8,   7,
        14,  19,  -9,  -5, -22,  22,  -4,  -1, -24, -15,   3,   4,   2,
        -1, -16, -13,  13,  27,   4,  11,  25,   7,  15,   2,  27,  -2,
         2,   2,  15,  -4,   2,   6,  23, -27], dtype=int8)