graph main_graph (
  %onnx::Sub_1[INT16, 1], exponents: [-14]
  %onnx::Sub_0[INT16, 2x48], exponents: [-14]
) {
  %2 = Sub[quant_type = 'S16'](%onnx::Sub_0, %onnx::Sub_1)
  return %2
}


initializers value:



values info:
%2[INT16, 2x48], exponents: [-14]
%onnx::Sub_1[INT16, 1], exponents: [-14]
%onnx::Sub_0[INT16, 2x48], exponents: [-14]


test inputs value:
%onnx::Sub_0, shape: [2, 48], exponents: [-14], 
value: array([10916,  1630,  6635,  2487, 15783, 10091, 15068, 12358,  8447,
        2890,  1478,  1904,  6315,  6494,  6803, 15765,  1324,  2447,
        8208, 12945, 12781,  7229,    74,  2356,  1614, 11651,   183,
       14354, 13210,  5577, 13311, 12787, 14216,   600, 14949,  3408,
       13794, 15306,  6406,   943, 15665,  8322,  5132, 13061,  6894,
       15178, 12640, 10812,  8624,  8745,  3025, 11327,  8291,   770,
        4807,  9288, 15339, 13401, 14571,  1937, 13627,  1424,  1264,
        6118,  4067,  4318,  3296, 13307,  3629, 12443,  9737,  6907,
        2813,  3198, 10260,  5569,  9853,  4315,  3374,  4533,  9830,
        9649,  9124,   876, 12497,  5654,  2653,  9019, 10491, 14576,
        3647, 12669,  1805,  7932,  6238,   802], dtype=int16)
%onnx::Sub_1, shape: [1], exponents: [-14], 
value: array([10631], dtype=int16)


test outputs value:
%2, shape: [2, 48], exponents: [-14], 
value: array([   285,  -9001,  -3996,  -8144,   5152,   -540,   4437,   1727,
        -2184,  -7741,  -9153,  -8727,  -4316,  -4137,  -3828,   5134,
        -9307,  -8184,  -2423,   2314,   2150,  -3402, -10557,  -8275,
        -9017,   1020, -10448,   3723,   2579,  -5054,   2680,   2156,
         3585, -10031,   4318,  -7223,   3163,   4675,  -4225,  -9688,
         5034,  -2309,  -5499,   2430,  -3737,   4547,   2009,    181,
        -2007,  -1886,  -7606,    696,  -2340,  -9861,  -5824,  -1343,
         4708,   2770,   3940,  -8694,   2996,  -9207,  -9367,  -4513,
        -6564,  -6313,  -7335,   2676,  -7002,   1812,   -894,  -3724,
        -7818,  -7433,   -371,  -5062,   -778,  -6316,  -7257,  -6098,
         -801,   -982,  -1507,  -9755,   1866,  -4977,  -7978,  -1612,
         -140,   3945,  -6984,   2038,  -8826,  -2699,  -4393,  -9829],
      dtype=int16)