graph main_graph (
  %onnx::Sub_1[INT16, 1], exponents: [-17]
  %onnx::Sub_0[INT16, 5], exponents: [-17]
) {
  %2 = Sub[quant_type = 'S16'](%onnx::Sub_0, %onnx::Sub_1)
  return %2
}


initializers value:



values info:
%2[INT16, 5], exponents: [-17]
%onnx::Sub_1[INT16, 1], exponents: [-17]
%onnx::Sub_0[INT16, 5], exponents: [-17]


test inputs value:
%onnx::Sub_0, shape: [5], exponents: [-17], 
value: array([32767, 32767, 32767, 32767, 32767], dtype=int16)
%onnx::Sub_1, shape: [1], exponents: [-17], 
value: array([32767], dtype=int16)


test outputs value:
%2, shape: [5], exponents: [-17], 
value: array([0, 0, 0, 0, 0], dtype=int16)