graph main_graph (
  %onnx::Sub_1[INT16, 1x96x5x49], exponents: [-12]
  %onnx::Sub_0[INT16, 1x96x5x1], exponents: [-12]
) {
  %2 = Sub[quant_type = 'S16'](%onnx::Sub_0, %onnx::Sub_1)
  return %2
}


initializers value:



values info:
%2[INT16, 1x96x5x49], exponents: [-12]
%onnx::Sub_1[INT16, 1x96x5x49], exponents: [-12]
%onnx::Sub_0[INT16, 1x96x5x1], exponents: [-12]


test inputs value:
%onnx::Sub_0, shape: [1, 96, 5, 1], exponents: [-12], 
value: array([2819, 3223, 3432, 2522, 1770, 2298,  742, 3539, 1321,  230,  338,
       1871, 2669, 3219, 2150,  172, 2904, 2830, 1526, 2285, 3179, 1936,
       1415, 2203, 1153,  898,  699, 2421, 3088, 2024, 3068, 2635, 1966,
       1869, 2218, 1041, 1741, 3919, 3272, 3211, 1843, 2293, 2346,  937,
       3075, 2776, 1966, 3917, 1054, 3474,   83, 2451,  444,  400, 3478,
       2438, 3974, 3659, 2947, 1395, 3685, 1337, 1967,  897,  896, 2231,
       1608, 2139, 1345, 1972,  764, 4066, 3112,  556,  768, 3161, 2823,
       3731, 1124, 1919, 2974,  741, 2153, 3923,   30, 1215, 3691,  672,
        415, 3564, 2078, 3466, 2848,  560, 3686, 3673, 2747, 2810,  755,
        981, 1605,  472,   20, 3052, 1663, 1251,  555, 1938, 2224, 3480,
       2375, 1718, 1767, 1920, 2390, 2586, 3805, 1090, 4068, 1214, 2408,
       2499, 3012,   71, 3140, 3575, 3708, 2737, 3377,  760, 3460, 2154,
       3565,  413, 2470, 1039, 3758, 1743, 1235, 2363, 2971, 2862,  580,
       3334, 1431, 1005, 2744, 3849, 2114, 3658, 2944,  543,  690, 1076,
       3769,  976, 1102, 3341, 1439, 1414,  254, 3453, 1611, 3593, 1225,
       1618,  105, 2949, 2389, 3778, 2477,  101, 3415, 3016,  163, 1467,
       2005,  380, 3467,  808, 3170,  907, 3234, 2499, 3625,   49, 2059,
        792, 3368, 2194, 1347, 2831, 2421, 3725, 1946, 3579, 3566, 3121,
       1223, 2570, 3791, 3338,  999, 1229, 1172, 2299, 2056, 2778, 2203,
       3985, 3675, 3833, 1293,  470, 2661, 3168, 2383, 2168, 1904,  979,
       2140, 3795,  195,  986, 3428, 2366, 2967, 2459, 3929,  566, 3333,
       3089, 1700, 1641, 3551,  302,  678, 3105, 3249, 2826, 3125, 1338,
       3215, 2890, 1805, 1484,  910, 2650, 2194, 1106, 1499,  937, 2263,
       2487, 2449, 1072, 3290, 1314, 2891, 2864, 1080, 2156, 1780, 3983,
        718, 3719,   47, 2722,  569, 1553, 2951, 1166, 1464, 2999, 3053,
       3627, 3653,  321, 2978,   35, 1007, 1691, 2133, 1514, 2448, 3438,
       2306, 2197,  914, 1000,  233, 1502, 2291,  425, 2078, 1905, 2156,
       2213,  478, 3650,  177, 1954, 3843,  856, 3693, 3949, 2767,  618,
        832, 1111, 2051, 2851,  205, 1358, 1315, 1856, 2390, 3908, 1351,
       1604,  871,  827, 1493,  606, 1437, 1081, 3464, 3002,  615, 1912,
       2632, 1404, 4078, 2137, 2551, 2568, 1899,  420, 1708,  898,  753,
       3287, 1831, 3821, 2889, 3652,  790, 1052, 2695, 3870, 3686, 3843,
        685, 1268, 2984,  110, 2534,   57, 3944, 1697, 2753, 3613, 3565,
       3122,  317, 2624,  587, 3797, 1558,  442, 1003, 2976,  955,  950,
       3736, 3800, 2735,   32, 1230, 3359, 2973,  870, 1012,  560, 1102,
       3199, 3477, 3532, 3893, 3021, 3910, 3260, 2307, 1061,  332, 3458,
       2138,  678,  828, 1915,  946, 1450, 1828, 3418, 3747,  838, 3107,
       1038,  321,  894,   49,  939, 3559, 2062, 3070, 2571,  134, 2473,
       2378, 1519, 2606,  795,  891, 1843,  167, 1339, 3900, 1196, 1730,
       3471, 3930, 1634, 2317, 2671,  115, 1464, 1063, 1982, 2087,  286,
       2901, 3368, 3845, 3442, 1373,  134, 3728, 2005, 3174, 2667, 1601,
        875, 1526,  284, 3976, 2604,  395, 2130, 1956,  539,  164, 2117,
       4066, 2152, 1987, 1137,  256, 3215, 2089,  456, 3900, 2865,  301,
       2482,  620, 2930, 2936, 1936, 1493, 3933], dtype=int16)
%onnx::Sub_1, shape: [1, 96, 5, 49], exponents: [-12], 
value: array([1829, 1427,  825,  329, 3053, 1929, 2430, 3639,  466, 1890, 2135,
       2563, 2563, 3401, 1226, 2507, 1684, 3066,  456, 1780, 2785, 1664,
       3121,  375, 3313, 2102, 1909, 3925, 1974, 2892, 3298, 3443, 3011,
       3435, 2088,  844, 2338, 3062, 2924, 2853, 1032, 3450, 2278, 2487,
       1770,  894, 1767,   18, 1174, 1369, 1673, 1022, 2417, 1735, 1143,
       2265, 2107, 1904, 1893, 2717, 2362, 3245,  910, 1278, 2124,  305,
       3329,  937, 1529, 3089,  257, 1461, 4073, 3623,   29, 1941, 2869,
       3294, 3223,  428, 3441, 2210, 3219, 2135, 3206, 3987,  841, 2106,
       3400,  775,  579, 2473, 3328, 3626,  431, 2550, 2417,  469, 2012,
       4015, 2957, 1869, 1645, 1662, 3620, 3878,  767,  775, 3014, 3087,
       3963, 2705, 1782,  547, 3045,  869, 4005, 2053, 3432, 2319,  104,
       3334, 2310,  967, 2937, 3823, 3390,  125, 2084, 3940, 3111, 3003,
       2889,  191, 2668, 1963, 3705, 2653, 2583, 1297, 1035, 3017, 3478,
       3857,  374, 1222, 3873, 1856,  627,  304, 2815, 2499, 3130,  351,
       3941,  553, 3022, 2613, 3535, 1253, 1925, 3039, 1477, 3495, 2647,
        377,  244, 3939, 3396, 3887, 1668,  838, 3100, 3223,  556, 1413,
       3806,  961, 2928,  667,  349,  212,  868,  821,  223,  180, 2982,
       3026, 3413,  746, 1128,  533, 3012, 3927, 2012, 2844, 1321, 1313,
        290, 3946,   81, 2626, 2559,   54,  182, 2996, 3695, 1999,    5,
       4037, 3523,  258, 3320, 2150, 1891, 3436,   14, 3384,  724, 1370,
       1419,  499,  859, 1926, 2335, 1262,  828, 1045,  791, 2717, 3854,
       3823, 1258,  573, 2909, 1497,  979, 2821, 1248, 3165, 2721,  553,
       1986, 1127, 2118, 2763, 2708, 3090, 2020, 2421, 3205,  651, 2100,
       2045, 3150, 1834, 2305, 3416, 1802, 2492, 2845, 3609, 2877, 2110,
       1440,  691, 1972, 3815, 4053, 1467, 2768, 2743, 3276, 2736, 3747,
       1565, 2518,  376, 1992,  646, 3864, 2533, 2059, 2873, 1391, 3878,
       1853, 1463, 1944, 3723, 2791, 2787, 2160, 2726, 1573, 3000, 2822,
        569, 1964, 2033, 3802, 2357, 3665, 2347, 1024, 3674, 2489,  293,
        749, 2139, 1957, 1874, 1124,  385, 3338,  390, 1165,   52, 1353,
        176, 2644, 3541, 3494, 1724,  325, 2001, 2831,  370, 2182, 3221,
       1601, 2516,  404, 2205,  438, 2431, 3211, 3235, 3725, 1175, 1501,
        193,  402,  162,   98, 2045,   82, 2155, 2698,  208,  893, 1351,
       1462, 4082, 1220, 2317, 1119, 2496,  579, 1358, 3201,  117, 1034,
       3803, 1505, 3606, 4028, 2592, 2884, 2623, 3742, 2934, 1118, 1037,
       1051,   36, 3402, 2762, 4021, 2070,  235, 2572, 3168, 1215, 2820,
        155, 2828, 3924, 1353, 1843, 3677, 2942, 1867, 2038,  376, 2088,
       3916, 3837, 3827, 1854, 3214, 1810, 2898, 3739,  802, 3439, 2099,
       3862, 2134, 2064, 2457, 2418, 1000, 3012, 3382, 1427, 1874, 2348,
       1931, 2496,  846, 1575,  173, 3805, 3004, 1541, 3574,  902, 2813,
        525, 1984, 1102,  808,  170, 1264, 1969, 3310, 3806,  230,   80,
       2293, 2559, 4001, 2686, 2447,  294, 1803, 3714, 1951, 2540, 3822,
       2560,  171, 3158,  194, 3718, 1681, 2265,  193, 3968, 3928, 1645,
        359, 1475, 3470, 3494, 2071,  153,  694,  386,  958,  396, 3146,
       3621,  695, 3366, 1586,  698, 1945, 4079, 1475, 2479, 3672,  482,
        951, 3986, 3218,  650, 1045, 3164, 2980, 1700, 2264,  150, 3608,
        578, 1805, 2083,  276, 3689, 1913, 2418, 2923, 3742, 2683, 1073,
       2777, 3364, 2241, 3058, 1397,  480,   75, 2699, 1850, 1773, 1847,
        312, 3976,  947,   63, 2880,  904, 2959,  362, 2152, 2450, 3078,
       3634, 3981, 1376, 3575, 1697, 2241, 1412,  915, 2586, 1874, 3078,
       1629, 3047, 2903, 1802, 3980, 3902, 2467, 3835, 2144,  296, 2140,
       3806, 3457, 1682, 1781, 3378, 3980, 1834, 2567, 3694, 1073, 3843,
       3954, 2804, 3592, 1538, 1186,  538, 3049,  813, 2170,  231, 1339,
       1976, 1739,  393, 2262, 1792, 1365, 1436, 3268, 2616,  935,  562,
       1135, 1122,  146, 2461, 3222, 2679, 3610, 3236,  784, 2109, 3067,
       2384, 3905, 1803,  177, 2386,  355, 1765, 1024, 3502, 1796, 2499,
       1178, 1334, 2060, 3920,  789,  720,  218, 1720, 2060,  812, 1804,
       2389, 1829,  922, 3385,   70, 2924, 2728, 3899, 3796, 3088, 2717,
       2303, 3868, 1593, 1304,  961, 3057, 1927, 3415, 3123,  938, 2034,
       3771,  815, 2932, 2231,  314, 2406,  301, 1704, 3908, 1271, 2997,
       3300, 2051,  684, 1646,   89, 1854,  766, 4019, 1632,  796, 1281,
       1618,  107,   55, 1671,  596, 2810,  125, 1247,  811,  649, 3809,
       3150, 2762,  880, 1223, 3669, 3168, 2885, 3836, 2327, 3902, 3892,
        583, 2564, 3065, 3965, 1784, 3163, 2318, 1910, 1006,  794,  796,
       1745, 2949, 3534, 3979, 1252,  269, 2258, 1321, 2666, 1238,  556,
       3033, 2702, 2073,  340, 1343, 2411, 1307, 1934, 2602, 2562, 2669,
       3079, 2890, 1609, 3299, 3130, 1982, 1547, 2818, 2521, 3995,  441,
         43, 3646, 1709,  250,  497, 3315, 2476, 3904,  237, 3336, 3862,
        558,  264, 3279,   63, 3428, 3272, 2932, 3874, 1741,  407,  430,
       3241,  663, 2710, 3774,  434, 1537, 2125, 1855, 4004, 3652,  131,
       3158,  133,  167,  273, 1553, 1467, 3432, 2788, 1545, 2552, 2295,
       1177,  510, 4039,  151, 3142, 2191, 3559, 3849, 1959, 1679, 3518,
        671, 3411,  255, 1886, 2868, 2171, 3256,  230, 2428,  767, 2857,
       3161, 1515, 3577,  840, 1175,  360, 1799,  692, 2070, 3243, 2355,
       2887, 1260, 2902, 3249, 2977, 2632, 1730, 2634, 2850, 2948, 3119,
       3998, 2627, 2472, 1744,   29,  868, 2975,  378, 2323, 1230, 2461,
         83, 1962, 2738, 3112, 1497, 1346, 2857, 3605, 2996,  580, 3696,
       1367, 2698, 3871, 2082, 2769, 1574, 1776,  722, 1037, 1507, 2880,
       2098, 1587, 3992, 3164, 3606,  269, 2278, 1580, 1001,   68, 2845,
       3322,  514, 1958, 2247,  298,  215, 1947,  804, 3982, 3955, 2118,
       2098, 2282,  745, 1010, 1168, 1012, 1190, 1456,  964, 3108,  892,
       3292, 3572, 2054, 2974, 2312, 2994,  920, 1139, 1356, 3892, 2295,
        376, 3473, 1516,  270, 1382, 2859, 1120, 3145, 3696, 2855, 4044,
       3359,  432, 2463, 1846,  119, 3062,  272, 1073, 2461, 3534,  974,
       3280,  715,  563,  679, 3827, 3960, 2520, 2508, 3438, 2330,  908,
        902, 3877, 1607, 2634, 3326,  973, 1003, 1088, 3781, 3268,  498,
       2721, 2452, 1334, 2533, 1064, 3633, 3874, 1916, 2615, 2179, 1164,
       2337,  512, 2374,  122, 2311, 3497, 4054, 1915,  100, 3584, 1800,
       3344, 2286, 1525,  780,   50, 3748, 2486, 1626,  897, 1968,  635,
       3084, 3750, 1470, 3297, 3730, 2181,  961,  994, 2817,   54,  870,
        380,  968,  428,  227, 3213, 3146,  407, 1409, 2375, 2452, 1446,
       2898, 2593, 1157, 3449, 1303, 1785, 2914,   84, 1899, 1824,  130,
       2776,  325, 2528, 1677,  110, 3248,  749,  820, 2802, 1975, 3008,
        255, 2679, 1649, 3162, 4089,  651, 3894, 2459,  839, 3777, 1904,
        690, 1742, 1253, 1588, 3654, 2605, 2298,   49, 3107, 3832,  138,
       2470, 2221, 1306, 2043, 3240, 1221, 2869,  964, 3496, 1582, 2504,
        451, 3916,  288, 3576, 2553, 3191,  298, 3584, 3252, 1838, 3683,
       2410, 1238,  228,  702,  186, 3076, 3930, 2303, 1999, 3066, 2044,
       3084, 1900, 2464, 2771, 3004,  539, 2447,  997, 1997, 2040,   59,
       3547, 1991, 2547, 3438,   84, 3000,  904, 2252, 1369, 2594,  153,
       2181,  802,   40,  178, 2433, 1208, 2232,  100, 4093, 1948, 2283,
       1231,  940,  878, 3680,  508, 2757, 3092, 1573, 2899, 2702,  778,
       2572, 2578, 3647, 1142, 3901, 3561, 1597, 4021, 2308,  803, 3410,
       3525,  831, 2017,  795, 1254, 2329, 2330, 3854, 3911, 3369,  706,
       1272, 3433, 2123, 3186,  863, 3084,  669, 2292, 3442,  207,  244,
       2351,  588, 2914,  368, 3330, 2225, 3046, 2259, 3359, 1853, 1132,
       1204, 1932, 2189, 2676, 3866,  490, 1654, 3914, 2456, 1160, 3310,
        317,  961, 1812, 3037, 2243, 3085,  811, 1690,  506,  518,  206,
       1322, 1382, 2947, 2258,   51, 1693, 2571, 1355, 2059, 3952, 3528,
       3254, 3327, 3878, 3378, 3435, 3712, 2852, 2015, 2662, 1318, 1708,
       2036,  520, 2076, 2870,   54, 2926,  715, 3646,  385,  351, 2915,
       2420,    9, 2879, 2290, 1153,  425, 3272,  461, 3579, 2953, 3338,
       3411,  841,  629,  108, 1601, 1330,  622, 3325, 3523, 2260, 1550,
       4047,  427, 4052, 3256,  449, 3700, 1841, 2652, 2261, 3661, 1172,
       4085,  884, 2820, 1452, 3491, 4096, 3599, 1443, 2797, 1859,  233,
       2671, 1213, 2908, 3207, 3830, 2975, 2476,  913, 2704, 3844,  443,
       2558,  898, 2732,  822,  979,  354,  118, 3225,  463, 3115, 1295,
       2570,  548,  424, 3240, 2302, 2443, 2758, 3741, 1683,  124, 2775,
       4093, 2323,  671, 1413, 3641, 2077, 1433, 2694, 3594,  642, 3406,
       3220,  558, 3012, 2860, 2740, 1618, 1569, 1402, 3575, 2039, 3408,
       1817, 2126, 1904, 3418, 2045, 2168, 1796, 1243, 2562, 3205,  495,
       1111, 1566,  839, 1793, 3074, 2060, 3902, 3274, 3301, 1442, 3648,
       2756, 2460, 3991, 3546,  309, 3269, 3315,  338, 3914, 3245, 2165,
        717, 1011,   38,  768, 2166, 1774, 1465,  248, 2520,  762, 1508,
       3213, 3433, 3679, 1616, 4007, 3466,  488, 2930, 3386, 2298, 3304,
        622, 2813, 2035, 1775, 1326, 3025, 3239, 1980,    3, 4055, 2212,
       3444, 3968, 1456, 3623, 1290, 1902,  940, 3986, 1979, 2919, 3660,
        352, 3904,  879,  481, 2329, 3263, 1209, 2001, 2372, 3151, 1748,
       1517, 2388, 2735, 2309, 1180, 2229, 3004, 2263, 1307, 2712,  778,
        874, 4017, 3516, 1003, 2305,   44, 2373, 3935, 3012, 3842,  203,
        722, 3625, 2042, 1410,  801, 2127, 1313, 1886, 4020, 1007, 1575,
       2323, 2353, 3789, 1643, 2334,  322,  546, 1850, 2380, 1580, 2104,
       3012, 3565,  255, 2950,  219,  219, 3416,  110, 3945, 3270, 2170,
       1310, 3076, 2016, 3274, 1093, 1054,  389, 3649, 2882, 3862, 1685,
       3684, 1927, 2159, 3548, 4034, 2935,  613, 2941,  124,  430, 3721,
       2276,  679,  363, 1907,  843, 2308,  865, 3946, 3546, 1895,  982,
       3763, 2902, 3118, 3768,  801, 3696, 2527,  714,  869,  827, 3630,
        137,  402, 2845, 3486, 3188,  151, 1443, 2807, 1035, 1014,  257,
       2975,  561, 3490, 3981, 2315,  305, 3546, 2222,  168, 2544,   40,
         48,  822,  427, 3635, 1731, 2678, 1123, 3887, 1501,  475, 1980,
       2567,  793, 3769, 2784,  788, 3046, 1459, 3231, 3546, 1420, 3250,
       2681, 2094, 4001, 1427, 2427, 2345, 3591, 2069, 1415, 3438, 1291,
        225, 3083,  134, 3870, 3812, 4076, 3519, 3542, 2968, 2510,  570,
       3760,   47, 4050, 3390,    5,  520, 2561, 3081, 2215, 3023, 3619,
       3465, 1060, 3284, 2130,   16, 4069, 2142, 3464,   87, 3335, 3854,
       1423, 3293, 1644, 2966, 1141,  242,  787, 1640, 3475, 2795, 2521,
       1772, 1003, 1373, 1059, 2559, 1127, 1601, 2601, 2219, 4032,  936,
       1129,  730, 3784,  192, 1303,  844, 1667, 1734,  901, 3458, 3441,
        141,  771,  695, 4048,  434,  986, 1802,  389,  685, 1147, 2289,
       1643, 2389,  438,  225, 1608, 1371, 1983, 3856, 2766, 2643, 4035,
         74, 2492, 1400, 2147, 3874, 3027, 3208, 2165, 1063, 1195, 2478,
       3584, 1307, 2629, 1605,  705, 3171, 3223, 1623, 3049,   63,  401,
        833, 1066, 1721, 3007,  866,  636, 3031, 1877, 2562, 3249, 2119,
       3693, 1024,  316, 1972, 1679, 2923, 3491, 1752,  286,  878, 1066,
       1873,  400, 2544, 3258, 2159, 3889, 1058, 2982, 1314, 1633, 2614,
       3766, 4012, 1490, 1413, 1540, 1219,  473, 2900, 2686, 1168,  486,
        530,  478, 1999, 3806,  663,  438, 1777, 2318, 1675,  549, 1989,
        960, 2741, 3474, 3286, 3138,  358, 3123,  644, 3413, 3788, 1048,
       2486, 1529, 2799, 2112, 4041,  152, 1306, 1102,  375, 1493, 2257,
       2341, 3872, 3014,  955, 3604, 2133,  839, 3173, 1425,  405, 1000,
       2199, 2258, 3231, 1957, 3697, 1391, 2383, 3249,  617, 2426, 3079,
       1505, 2094, 2295, 3172, 1621, 3670, 3767,  874,   67, 2983, 2218,
       2801,  266, 2154,    4, 3450, 1689, 1158, 1415,   58,  892, 1509,
       3996, 2895,  437, 2180, 3499, 3148, 2473, 1205, 2773, 1808, 2928,
       2353, 1964, 1663,  347, 3047, 2308,   74, 1286, 3976, 1796,  565,
        463, 1305, 3827, 1143,  614, 3564, 3148, 3482, 3376, 3200, 3137,
       1905, 2989,  177, 3570, 1540, 1956, 2763,  716, 3350, 3421,   44,
       1218, 2768,  225, 3099, 3879, 1172, 1462, 2307, 1502, 3495, 3064,
       3474, 3020, 2114, 1876, 2383, 3498,  573,  383, 2925,  819,  869,
        609, 2640, 3097, 2491, 1872, 3546,   47, 4086, 1365, 3645, 2584,
        834, 1366,  880, 1614, 3410, 3738, 1101,  163,  782, 2855, 1476,
       3965, 3191, 1752, 2028, 4032, 3917,  216,  138, 1162, 3958, 1227,
       2418, 2011, 2301, 3236, 1026, 1950,   89,  958,  813, 1319, 1393,
       3577, 2756, 3285, 3590, 3018, 2548, 1275, 3766, 2397, 3506,  440,
       2223, 2463, 1451, 2319, 3125, 1467,  618, 3013, 1502,  182, 1076,
       1345, 1742, 2264, 2032, 2829, 2945, 3129, 1261, 3326, 4044, 3485,
       1158, 2251,  655, 2664, 2674, 3848, 2145, 3686, 2392,  256, 1700,
       2763, 3775, 1261, 3755, 3090, 1453, 3395, 2897,  805,  514, 3685,
       2617, 1044, 1028, 3353,  477,  554, 1408, 1986, 3015, 1560, 3010,
       4080, 2726, 3322,    7,  920, 2820, 3812, 1505, 2441, 3636, 3119,
       2443,  918, 3876, 4041, 1357, 1280, 3337,  714, 3958, 1038, 2050,
       2262,   35, 1029, 1140, 3010, 1111, 1151, 1362, 3925, 3490, 1607,
       3266, 1770, 2093, 2236, 1684, 1475,  927, 2849, 2428,  254, 3608,
       2953, 3713, 2574, 3988,   53, 2283, 2212, 3908,   35, 1380, 2036,
       3942, 2468, 2019, 3847, 2102, 3970, 3956, 2334,  125, 1476, 1550,
       1971, 1939, 4054, 1602, 2282, 2862,  168, 2379, 4032, 2694, 1609,
       3252, 3623, 2973, 1138, 2492, 1018, 2086, 1864, 3551, 3581, 3001,
        745, 1380, 2048,  911, 3747,  268, 3236,  545, 3757, 1436, 2380,
        635, 3655, 2464,  470, 3257, 1893, 3246, 1790, 1325,  335, 3444,
        845, 3671, 4017, 4015, 2202, 2257, 2382, 2969, 1502, 3898, 1818,
       3424, 3665,  786,  314, 3161,  152, 3181, 1306, 3369,  410, 3304,
       1928, 2354,  650,  942, 2161,  419, 2798, 2640, 1941,  356, 1421,
       2515, 3751, 3689, 2475, 1062,  762,  194,  827, 3911,   72, 3108,
       2369, 1001, 1389, 4073, 1949, 2472, 2957, 1414, 3053,  569, 3368,
       3902, 2733, 1839,  237, 2592, 2257, 1232,  154, 2306, 2877, 2799,
       3980, 2066,  192, 2428, 2315,   97, 1261,  155, 4013,  676, 2963,
       2067, 3629, 2171, 2049, 2296,  648,  646, 3753,  716, 2605, 4043,
       3034, 2571, 3854, 1442, 3202, 1918, 2478, 1835,  888,  440, 1982,
       3535,  525, 3444, 3134,  115, 1111, 1717, 3931, 2080,  562, 1963,
       1253, 2013, 1048,  216,  247, 1651, 3528,  898,  948,  841,  670,
       2656, 2167, 1026, 2235, 1994, 3146, 3465,  202, 1277, 1569, 3694,
        647, 1957, 3433, 2602, 1047, 1884, 3772, 1231,  390, 3346,  418,
       1112, 1624, 3816, 1451,  861, 1357, 1659, 2389,  657, 3544, 1133,
       2639,  203, 2676, 3677, 3013, 3241, 3795, 1947, 1576, 3983,  378,
       1574, 3357,  980,    7,   24, 2435, 2321, 1763, 2388, 2436, 2393,
        196, 2730, 2692,   93,  343,  946, 1043, 2334, 2920, 3925, 2108,
       1328, 1896, 2887, 3386, 3847,  111, 2905, 1006,  455, 1271, 1875,
        372, 3306, 1490, 1481, 1450,  874, 2113, 1329, 3517, 1383,   53,
       1833, 2079,   61, 3179, 1360,    9, 2930, 1886, 1407, 3981, 1568,
       2128, 2199,  943,  535, 2915, 2938, 1615,  454,  418, 1805, 1325,
          0,  630, 4025,  640, 2537, 1548, 3517, 2698, 2343, 3346, 2954,
       3366, 1158, 2401, 2523, 3713, 3511, 2678, 2851, 2191, 1530, 2925,
       3124,  959, 2691, 3286, 1689,  908,  836, 3225,  135, 3618, 2339,
       3329,  440, 3425, 1250, 2177,  977,  494,  116, 1590, 2049,  843,
       1412, 1077, 3909, 3705, 2972, 3881,  568, 3215, 1346,   20, 1655,
       3646,  137, 1169, 2479, 3204, 1505, 1982, 2027, 1433, 3196, 2231,
       1784, 2175, 2131, 3444, 3429, 3964, 1364, 2859, 1974, 3519, 1660,
        812,  708,  334, 1631, 3501, 1188, 3433, 2941, 1364,  358,  485,
       2721, 1667, 3550, 2044,  397, 1429, 1281,  516, 2441, 3655,  375,
       2164, 2405, 2461, 3079, 3482, 1224,  341, 2323, 3076,  796, 4044,
        142, 3784, 2420, 3789, 2287,  878, 4096, 3430, 1812, 3943,  413,
       1084, 4072, 1655, 1301, 2660, 2641, 4016, 3913, 3973, 2721, 1356,
       1749, 1397,  275, 2536,   39, 3896, 2269, 2378, 1192, 1180,  291,
       3445,  112, 1020, 2706,  730, 3083,  531, 3942, 3005,  616,  875,
       3491, 2552, 1732, 1047, 3928, 3835, 3891, 1928, 3385, 3155, 2245,
       2577, 2078,  679,  353, 4041, 1536,  137, 3288,  394, 2756, 3144,
       1089, 3739,  546, 3025, 3519, 1587, 2778,  966, 3912, 3910, 1837,
       1576,  351,  865, 2017,  953, 4057, 2424, 3856, 2064, 3276,  949,
        475, 3235, 3631, 3496,  954, 1777,  376, 1600, 1027, 1122,   75,
       2802, 1736, 2444, 2456, 3350, 1978, 2121, 3246, 1033,  272, 2901,
       2691, 1826, 3871,  556, 3305,  124,  161, 4095, 2822,  120, 2967,
       3386, 3734,    8, 2424, 1678, 2810,  440, 3595,   59, 1184, 2259,
        439, 1167,  143, 1969, 3882, 3826, 1382, 3440, 2537, 3865, 3064,
       2522, 2310, 2365, 1266, 1022, 3661, 3894,  187, 2170, 2468,  578,
       3413, 3868,  843, 2818, 1830,  776, 1161, 3840, 1283,  968, 2531,
       1936,  228, 2829, 1982, 3987,  992, 2295, 3275, 3595, 3873, 3886,
       2995,  760, 3270, 2326, 2271, 2411, 1156, 3576, 1815,  113, 1695,
        629, 1145, 2389, 2336,  457, 2219, 3988, 2351, 4047, 3536, 3204,
       1689, 3933, 3008, 2319, 1245, 2537, 2265, 1440, 3830,  422, 4059,
       4059, 4057,  642,  220,  379, 2091, 1999,  127,   88, 2663, 1240,
       2357, 1090, 3056,  894, 2874, 2411, 3385, 3660,  585, 3849,  937,
       3497, 2773, 1298, 1370, 4005, 1333, 3062, 1760, 3406,  817, 2615,
         26,  689,  856, 1046,  889, 3500, 1676, 1106, 3397, 1351, 3959,
       2323, 3655,   63, 3186, 4091,  969, 2885, 1755, 3336, 2409, 1491,
       3740, 2107, 1410,  252,  908, 3438, 2474, 3349,  176, 1359, 2879,
        365, 1997, 3734, 2763, 3848, 2955,  371, 3456, 1645, 3397, 1357,
        865,  881,  982, 2712, 2580, 1906, 3045,  931,   34, 1106, 1259,
       3722,  708, 3499, 2049, 3479, 4027,  171, 1950, 2254,   29, 3578,
       3477,   15, 3885,   67,  401, 3663,  240, 3360, 2487, 2722, 1327,
       3518, 1532,  991, 3196, 2471, 2933, 3757, 4051, 3600, 2026, 3835,
       2756, 3573, 1110,  381, 3482, 3040, 1742, 3320,  373, 2457, 2966,
       3130,  296, 1264, 3045,  533,  487, 1933, 2221,   45,   32, 3094,
       3233,  799, 3882, 1994, 3980, 1285, 1686, 1764,  600,  189, 2329,
       3636, 3740,  368, 1885, 2975,  404, 1556, 2319, 2176,  883, 2716,
       3304, 3351, 1520, 2560, 1957, 2049,  691, 3211, 1256, 1880,  594,
        401, 2891,   57, 2151, 3440, 2419,  665, 1545, 3555, 1012, 1729,
       2914, 3933, 3875, 2567, 3764, 3653, 4054, 1091, 1309, 2454, 4009,
       4015,  952,  752, 3646, 2440,  240, 1226, 3259, 3782, 3371, 1387,
        380, 3537, 2385, 2011, 1007, 3479, 3038,  640, 1611,  911, 1820,
       3245, 1871,   84, 1706, 2431, 3625, 3474,  893, 2918, 3951, 3640,
       3878, 2500, 1585, 1260, 1198, 2592, 3643, 3967,  481, 2073, 3930,
       1694, 2682, 3826, 1213, 3199, 3711, 2692,  955, 1112, 1156, 3315,
        526, 2464, 3589,  515, 1053,  792, 1330,  913, 3767, 1464, 1859,
       1026, 3878, 2128, 1037, 2107,  911, 1424, 1718, 2643,  367,  225,
       2777, 3800,  877, 1176, 4073,  170, 2896,  991, 2735, 1475, 3104,
       2579, 1867,  474,  717,   74, 3028, 3433, 3325, 1592, 2894, 2658,
       1286,  785, 1250,  779, 1596, 3910,  173,  551, 3270, 3634, 3250,
        535, 1034,  331, 2979, 2992, 3912, 2622, 3898, 3035, 2007, 2659,
       3243, 2738, 2760, 3194, 2822, 1157, 2167, 2360, 1154,  281,  346,
        239, 1377, 3903, 2646, 1350, 2733, 3333, 1590,  959, 3818, 3078,
       1623, 2005, 2560,  804,  153, 3170, 3535, 4062, 3833, 1188, 2932,
        976,  294, 1917, 2632, 1801, 2469, 1129, 3427, 2877,  690,  846,
       1606, 3891,  225,   42, 3228, 1347, 3517,  411,  470, 3611,  380,
       1059, 1613, 2614,  734, 3008, 3285,  781, 3303, 2002, 1314,  193,
       3762, 3884,  402, 1621, 3255,  404, 3711, 2762,  132, 3640, 2009,
        821,  633,  329, 2269, 1116, 3179,  719, 1775, 3910, 1658, 3471,
       1871, 4052, 1017, 3536, 3708, 3364,  338, 1333,  792, 3275, 1282,
       1777, 1292, 1079, 2374, 1256, 3698, 2339, 2926, 3751, 2510, 1608,
       3163, 1384, 2550, 2458,  197, 1965, 1035, 3074, 3047, 3985, 3244,
       3284,  431, 1298,  364, 3523, 1445, 3317,  360, 2150, 1842, 3251,
        484, 1247, 1363,   13,  618, 1060, 2306, 1555, 1888, 3255, 3114,
        719, 2497,  797, 3169,  958, 3840, 3009, 2245,  273, 2068,  314,
       2954,  691,  246, 4082, 1053,   80,  656, 1633,  105, 3469, 1139,
       1092,  448,  161, 3062, 4010, 2281, 1000, 1057, 2292, 3465, 2843,
        950, 4016,  991,  125,  707, 3300, 3807, 3819, 2039, 3005, 3311,
       1426,  984, 2142, 3220, 1637,  760, 2363, 2794, 2602,  192, 2577,
         70, 3276, 3016, 3065, 1262, 3819,  434,  713, 2003, 1152,  381,
       3312, 1254,  342,  586, 3121, 3504, 2004, 1235, 2171, 3255, 1298,
       1971, 3446, 2326, 1130, 2595, 3387, 2960,  354, 3419, 3711, 4095,
       3271, 3979, 1305,  300,  549, 2284, 1282, 2610, 1777, 3601, 2454,
       1799,  602,  990, 3182, 2051, 1398, 1961,  478, 2392, 1395,  125,
       3009, 3747, 2716, 1208, 1354, 2708, 3430,  842, 2849, 2605, 2215,
       1065,  771, 2427,  411,  387, 2879,  632, 2098, 2543, 2277,  222,
       1939, 2439, 2277,  932,  940, 3406, 3858, 2088,  816, 2914, 1662,
        106, 2763, 2832, 1450, 3050, 1918,  589, 3945,  518, 1573, 3760,
       3951,   31, 1931, 2674, 2206, 2016, 1208, 3466, 1939,  436, 1721,
       1738, 3755, 3866, 1885, 3473, 1555,  536, 1148, 2157, 1476, 1481,
       2104, 3554, 3596, 1364, 2501,    5,  471, 1900, 1655, 3769, 3995,
       2445, 4038, 2965, 3066,  706, 2110, 2994,  293, 4080, 3842, 3658,
        452, 2991, 1560, 3435, 2270, 3451, 1204, 1338, 3921, 3485, 2991,
       2004, 3287, 1924, 3113, 3257,  548, 2184,  179, 2308, 2545, 3691,
       1877, 3402, 2646,  795, 1568, 3081,  631, 3412, 2618,  133, 1321,
       2072, 1963, 1286, 3702,  844,  593, 1202, 3932, 2476, 1871, 2523,
        694, 2655,  757, 3124, 3106, 3258, 1368, 2479, 1793, 1646,  930,
       3743, 4014, 1025, 3200, 2800, 1765, 1732,  470,  958,   37, 3851,
       2051,  197, 2458, 2218, 2290, 3210,  849, 1139, 1148,  448, 3108,
       1833, 2834,  507, 4082, 1466, 2775, 2367, 1187, 1191, 1831,  965,
        149, 3280, 1231, 2699, 1970,  743,  228, 3975, 2638, 3511, 3148,
       1229, 1518, 3840, 2602,  848, 1098, 4034, 3079,  664, 3950,  965,
       3915,  680, 2556, 1713, 2780, 2181,  688, 3480, 2326, 2274, 2095,
       1725,  223, 4026,   66, 2091, 4037,  643, 2997, 1750, 2614,  114,
       3613,  339,  556, 1085, 1965, 3057, 3127, 2826, 3449, 2267, 2952,
       1747, 2447, 2041,  929, 1415, 2114, 2763,  606,  162, 4053,  109,
       2016, 1865, 3943, 1112, 1319, 2798, 1674, 1703, 2191, 1308,   31,
       2264, 3425, 3273, 1470,  594, 1435, 3377, 2333,  293,   59, 2624,
        739, 3680, 2802, 1883, 3109,  528,  330, 3941, 3404, 1123,   93,
       1353, 2274,  451,  374, 3690, 1318,  424, 3398, 2320, 1767,   62,
       3537,   36, 2716,  836, 1274, 3588,  280,    8, 2832, 1143, 3239,
       3033, 1578,   70, 1176, 3704, 1538, 1505, 4023,  511, 3575, 1277,
       3252, 2808,  889, 2346, 1798, 3488, 2700, 1827,   83, 2717, 2460,
        607, 3827, 3981, 1394,  258, 3804, 3344, 3750, 2346, 1741, 2392,
       3646,  488, 2152, 1693, 1942,  678, 3196,  875, 3296, 2177, 2260,
        539,  815,  827, 2141, 3699, 2205, 1262, 2681, 2364,  569, 3296,
       2383, 2118, 1425, 1510, 3561, 2467, 1950, 3986, 1193, 1619,  359,
        779, 2599,  600, 3345, 3108,  660,  292,  811,  767, 2444,  543,
       3537, 2154,  769,  832,  402, 1261, 2845, 2495,  494,  500, 3416,
        433,  280, 2636,  891,   77, 2440, 4068, 3894, 3490, 3326, 3223,
       3991, 1420, 1849, 3282, 2147, 1527,   15, 3364, 2289, 1520, 2200,
       3167, 2844,  835, 1283, 1947,  726, 3555,  747, 2740, 3663,  769,
       1542, 4007,  816, 1250,  623, 3494, 2248, 3301,  277, 1583,  897,
        901, 2259, 1944, 2168, 3094, 3896, 1601, 1650, 3907, 2126,  730,
       3266, 2814, 1834, 2052, 2967, 3431, 3979, 1306, 2779,   65,  814,
        390, 1922, 4092, 4003,  130,  878,  539,  865,  156,  214, 2329,
       2101,  764, 2719, 1188,  883, 1598,  860, 1271, 1531, 3413, 2183,
       3692, 1675, 2015, 1846,  983, 2376, 3043, 1709, 2560,  959, 2762,
        792, 1528, 3266,  813, 3051, 3524,  495, 1940,  321, 1967,   67,
       3635, 1225, 1838, 3570, 3013,  540,  425, 2905, 1205, 2822,  357,
       2035,  462,  960, 2025, 1247,  654,  634, 2325, 1061, 2169, 2770,
        561, 3596,  948,  477, 1311, 1832,  901, 3541, 3124, 2599, 3783,
       1583, 1476, 1666, 2607, 1142,  975,  497, 1473, 1663,  295, 3674,
       1000, 1722, 2384, 2740, 1819, 2311, 1557,   55, 3526, 1368, 1888,
       2689,  116, 1834,   76, 1337, 2667, 3742, 2347, 3067, 2467, 2613,
        722, 3223, 3233, 2298, 2637, 3186, 3723,  817, 3859, 2732, 3612,
       3194,  174,   60, 1321, 2587, 3953, 1210, 1982, 2678, 3137, 3320,
       3761,  536,  484,   61,  567, 2320, 3782, 3455, 1182, 3728, 2380,
        823, 1488, 1050, 3591, 1347,  513, 1109,  311,   94,  342, 2741,
       1221, 1341, 2566, 1824,  331, 1877, 1401, 3352, 3746, 3053, 3756,
       3125,  529, 1111, 2077, 3326, 2744, 1538, 3877, 2922,  194,  326,
       1322, 2200, 4005, 2507,   24, 1243, 2223, 3353, 1603, 3701, 1858,
       2227,  473, 1253, 3228,  742, 2858, 2660, 3274, 2911,  898, 2794,
       1931, 3435, 2898, 2100, 2996, 3712, 2637, 2824, 2960, 3297,  763,
       3651, 3029,  398,  791,  604, 2361,  757, 2142, 1816,  589, 1729,
       1673, 3914, 1920, 3997, 3107, 2294,  337, 2785, 3133, 2181, 1958,
       2523, 2198,  583, 2855, 1724, 1563,  562, 3146,   59,  627, 1492,
       3773, 2797,  888, 3053, 3650,  349,  625, 3151, 2571, 2267, 1570,
       2905, 1433, 2296, 2451, 3201,  440,  960,  433, 3920, 2281, 3864,
       1357, 1249, 2193,  552, 3238, 2818, 3115, 3812, 1938, 1790, 1222,
       1103, 1257, 2295, 2856,  187, 3806, 2824, 1866, 2518, 2994, 3994,
       3294,  413, 1545,  784, 3194, 3215, 2549,  714, 1837, 2938, 3136,
       3132, 3403, 1645, 3411, 3691, 2209, 2609, 3682,  815, 2544, 1767,
        969, 3384, 2782, 1499, 3523,  974, 3443, 1914, 3491, 3511, 2805,
       3941, 2046,  793, 3033, 2603, 1349, 2938, 1025,  104, 1927, 2978,
       3628, 1277, 1549, 1606,  275, 1839,  136, 2345, 3620, 3519, 2940,
       2081, 3636, 3540, 2866, 1127, 2566, 1376, 3988, 2854, 2161,  206,
       3682, 3325, 2258, 3900,   63, 2057, 1045, 3231, 1155, 3377, 1608,
       2130,  202,  367, 1640, 4055, 1042, 1842, 1976, 3878, 2404, 1921,
        542, 1123, 2566, 2781, 3804, 2188,  868, 2250, 1479, 3267, 1280,
       2844, 3441, 2242,  526, 2604, 2534, 4034,  929, 4075,  467, 1297,
       3768,  572,  511, 2150, 1022, 2082, 2600,  752,  445,  749,  518,
       3101, 2209, 1951, 1341, 4000, 3797, 1638, 1559, 1439, 3651, 2428,
       1398, 2415, 3969, 2196, 2426,  437, 3311, 1777, 3198, 2372, 2156,
        892, 3351, 3900,  586, 1878, 3425,  635, 3855,  324, 3506, 3957,
       2344, 3108, 1035, 3796, 1835, 1388, 2927, 2783, 2387, 1917, 2570,
       3916, 3948, 2913,   66, 2633,  439, 3852,  329, 3472, 2919, 3736,
       2349, 3963, 2601, 1459,   14, 1529, 2491,  488, 2795,  106, 1532,
       2436, 3965, 2734, 1954, 2662, 2153, 3051, 2680, 4077,  353,  740,
       1925,  764, 2629, 2449, 1484, 2599, 1751, 2333, 3336, 2667,  574,
       2806, 1627, 3491,   77, 1185, 3758, 1088, 3001, 2043, 1556, 2103,
       1293,  495,  217,   70, 1307,  736, 2555, 2521, 2563,  974, 1776,
       1018, 2087, 2587, 3101, 1521, 1554, 3665, 1910,   90, 2335, 2587,
       2939, 3687, 2527, 4039, 3204, 2883,  241, 1032,  244, 1945,  391,
       1926, 1326, 1894, 3313, 1865, 1312, 1655, 2470,  828, 1437,  351,
       2397, 2779,  728, 2385, 3415, 3559, 2396,  925, 1385, 2597, 1951,
        688,  424, 3781, 3643,  423, 1428, 2479, 2466, 3398, 2022,  228,
        555, 2126, 1480,  466, 1761, 2747, 1845,  843,    8, 2432, 3416,
       1743, 2362, 1025,  848, 1127, 3017,  356, 2759,  632, 2822, 1267,
       4050,  820, 1963, 2789, 3236, 1444, 1481, 2772, 3785,  681, 3525,
       1525, 2927, 2028, 1390,  509, 2685, 2596, 3092, 1979, 1791, 3591,
       3077, 1232, 1827, 4044, 1148, 2551, 2884, 2462, 2579, 1358, 2044,
       2422, 1198, 2179, 3662,  760,  860, 2507, 2297, 2060, 2162, 1950,
        114, 1193,  378, 1626, 2527, 1361, 1086,  676, 1601,  960, 2338,
       3603, 2758, 1021, 3154, 1758, 3177, 3587, 2311, 3664, 2589, 1342,
       2715,  904, 2899, 3482, 1434, 3910,  138, 1199, 2826, 1336,  243,
       3078, 1494, 2776, 1572, 2352,  536,  327, 3899, 2180, 3772, 3114,
       2057, 1694, 1239, 1145, 1238, 1460, 3767,  863, 2941, 2321, 3381,
        166, 2875, 1816,  549, 1280, 1049, 2741, 1405, 3196, 3707, 3386,
        882,  569, 3801,  731, 1179, 3264,  255, 1959, 2629,  880, 2774,
        257, 3878,  190, 1777, 1860, 3360,  162, 1258, 3573, 2173,  465,
       2233, 1509, 2821, 2517, 3204, 2838, 3087, 3949, 4089, 3717, 1831,
        877, 1517,  511, 3788, 3767, 3170,  878, 1134, 3899, 3517, 2937,
       1893,  612,  827, 2976, 1581, 1937, 2042, 3894,  307, 2267, 2974,
       3598, 2282, 3749, 3259, 3487, 1734, 2347, 4026, 2576, 1897, 1510,
       3160, 2562, 3814, 1423, 3536, 3437,  933, 4015,   29, 3200,  868,
       1232,  770, 3531,  963,  388, 3968, 2201, 1376, 1679,  200,  619,
       1573,  591, 3910, 1306,  329,  627, 1696,  409,  390, 2152, 1200,
        611, 2347,  224, 3691, 2615, 1092, 4051,  613, 3249, 2634, 3956,
       2374,  893, 1200, 1144,  492,  585, 3095,  641, 2602,  294, 2450,
         36, 2247, 1683, 2640,  111,  798, 2054, 2125, 1255,  344,  608,
        711,  666,  595,   81, 3832, 3010,  298, 1174, 1482, 1786, 1661,
        937, 1309,  155, 2315,  348, 2692, 1616, 4030,  130, 3402, 2729,
       1666, 1113, 1659, 2830, 1415,  335, 2149, 1972, 1161, 2398, 2682,
       2727, 3839, 1368, 3290, 2674, 3000, 1573, 1379, 1737, 1621, 3543,
        590, 3663,  968, 3099, 2439, 3871,  840,  222,  249,  218, 3426,
       1619, 1571,  255,  897, 3956, 3214,  473, 1205, 2163, 1788,  798,
        527, 3304, 3287,  929, 4064, 2996,   23,  129, 1925, 3473, 1777,
       3033, 1793, 2302, 2794,  789, 2520, 1781,  919, 4080,  305, 3873,
       3342, 1542, 1589, 3360, 1381, 3306, 1157,  754, 1576,   10, 1268,
        753,  656, 3310, 1551, 2483, 2163, 2165,  310, 2825, 2202, 1225,
       1954, 2604, 1339, 1024, 2315,  776, 2189,  388, 1251,  262,  901,
        808, 2068, 3439, 3277, 3732, 1557, 2981, 2411, 1803, 2247, 1804,
         28,  132, 2232, 3920, 1790, 3258, 1165,  559, 1430, 3202, 3178,
       4095, 1145, 2843, 1778, 2866,  963, 2646, 1204,  798, 1869,   47,
       1457, 1143, 2268, 3267, 1951, 1279, 2021,   18, 3217,  627, 3549,
       4024, 3148,  447,   65, 2831, 3444, 3784, 2944,  419, 4001,  116,
        501, 1678, 3810, 3289,  293,  439, 3046, 3402, 1129, 2281, 1587,
       2777,  495, 2138, 2739,  708, 1025, 2404, 1993,  533,  785, 2244,
       1155, 2798,  592,   86,  696, 3238, 1094,  444, 2107, 3810, 1976,
        864,  855, 1531, 2877,  669, 3527, 1343, 2325, 1492, 3460, 3695,
       1917, 3176, 1494, 3554,  802, 2249,  437, 3488,  415, 2038, 3130,
       3366, 2113, 1426, 3397,  392, 3650, 2785, 3857, 1281,  527, 1190,
         25, 1660,  277, 2998, 3683, 2057, 1892, 3962, 2552,  421, 3120,
       1578, 2441,  692,  416,  704, 3472, 2607, 3842, 2421,  542, 2532,
       4034, 1124, 2019, 3269,  381, 1242, 1623,  928, 3521,  257,  256,
        218, 1288, 3220, 1871,  131, 1925,  222, 1677,  375, 1164,  346,
       3898,  274, 1625, 3013, 3210, 3458, 3144, 3683, 2453, 3515, 2808,
       2585, 3893, 1814, 1265,    9,  870, 2413, 1624, 3271, 1383, 2308,
        279, 1596,  998, 1221,  612, 2843, 3138, 3614,  954, 3918,  384,
        716, 2932,  455, 3368,  900, 1000, 2236,  367, 2357, 1912, 2351,
       1891, 2877,  254, 1242, 1372,  399, 3104,   26,  457, 1229, 3177,
       2632, 3014, 3720, 1525, 3442, 1643, 3233,  244, 3803, 3201, 3409,
         41, 2393, 2684,  974, 1715,  681,  109, 1661,  166, 2325, 3376,
       2202, 1344, 1440, 3316, 1306, 4061, 1949, 3607,  570, 1625,   30,
       2923,  318,   19, 1164, 3562, 3961, 1561, 2885,  178, 1257, 2495,
        282, 3254, 3735, 1800, 2724,  659, 2210, 2033, 2608,  953,  316,
       3998, 1132,  343,  446, 3349, 3059,  725, 4006, 2184, 3863,  196,
       2087,  267, 3542, 3194, 1984, 1340, 2477,  755, 3673, 3249, 1274,
       1302, 2517, 2410,  597, 1494, 3294,  504,  394, 2724, 3200,  397,
        613, 3673,  338, 1501,  353, 1342,  886, 3947, 2482, 3151, 1579,
       2339, 2253, 3277,  517, 1913, 1186,  804, 3573,  392, 3988, 3568,
       2022, 3897, 4064, 3069, 1498, 3117,  641,  839, 3412, 3647,  383,
       4011, 3731, 2054,  648,  318, 3970, 1206, 2570, 2015, 3241,   46,
       3511, 3909, 3566, 3733, 2457,  438, 1575, 1714, 2000, 1174, 3521,
       3880, 3054,  546, 2923, 1234, 1120, 1265, 2177, 1727, 3528,  746,
       3148,  473, 1365, 2195, 2181, 3502, 2027,  159, 1077,  232, 1863,
       2184, 4030, 1109, 1956, 1145,  954, 3613,  401, 4029,  849, 2096,
       1538, 2231,  951, 2310,  194, 4095, 2427,  463, 1516, 3350, 1447,
       2943, 2913, 2628,  806,  228, 3828,  718, 2302, 2282, 3163,  743,
       3471,  645, 1225, 1939, 1302, 4095, 2064,   95, 3870, 1071, 3641,
       2583, 3046, 3914,  984, 3903,  925, 1969, 1451, 2791, 3337, 2737,
        124, 3694, 3991, 3006, 3605,  363,  748, 1044, 2415,  775, 3349,
        654, 3849,  446, 3392, 3880, 2151, 1338, 2671, 3714, 2260,  666,
       2391, 3559, 2804, 2605, 2137, 1898, 2625,  335, 1418,  786, 3959,
         73, 1301, 1869, 3008, 3929, 2904,  481, 3591,   37, 3795,  226,
          8, 3311, 1713,  396,  670, 1328, 3376, 1779, 1016,  331, 3632,
       1570, 1043, 3202, 3287,  234, 2290, 1760, 1971, 1915,  922, 3865,
       3598, 2415, 1289,   21, 1905, 2502, 1528, 1493, 3598, 2068,  479,
       3558,  354, 2640, 2143, 3272, 1163, 3271, 2148, 3800, 1383, 4013,
        571, 1535, 3482,  334,  290,  379, 3173,  200,  666,  718,  974,
       2656, 2476, 3385, 2985, 2224, 2643, 3571, 2860, 3206, 3524,  324,
       3647, 2604,  681, 1170, 2830, 3474, 2927,  297, 2010, 1200, 2595,
        660, 2237, 1034, 3828,  369, 1204, 2981, 3534, 3016,  108,  579,
         52, 1599, 3325, 1705, 2984, 1176, 1158, 3093, 1979, 1142,  533,
       3972, 2889, 2190, 3090, 3282, 1286,  542, 1756, 1668, 2963, 4030,
       4069, 3983, 2794, 1869, 1418, 1788,  361,  191, 2825, 2036,  323,
       2234, 2159, 1569, 2318,  780, 1582, 2157, 2380, 3827,  564,  628,
        485, 2765, 3551, 2346, 1549, 3905,  387, 3371, 1615, 3610, 2354,
       3831, 3708, 1959, 3152, 1620,  305, 2299, 2167, 3168,  912, 1152,
       3259, 2172, 3541, 2180,  866, 1962,  537, 1336, 1145, 3375, 3633,
       3706, 3264, 1051, 2855, 1632, 2032, 2484,  717, 2893, 3982, 1483,
       1071, 1700, 3593, 3518,  967, 3031, 3359,   36, 1069, 3877,  757,
       3524, 4019, 3343, 2736, 1217,  559,   10,   61, 1471,  555, 3071,
       2502,  630, 3294,  705,  565, 3745, 3926, 1579, 1560, 1104, 2526,
       1547, 3719,  156,  565, 1745,   55, 1281, 1988, 3534, 1918, 3217,
       2127, 3293, 2737, 2789, 1800,  193, 4028,  379, 1495, 2775, 1146,
        779,  645, 2313, 1477, 3159, 1150, 3512, 2317, 2579, 2531, 3050,
       3282, 3955,  542, 2744, 1020, 3332,  913,   23, 1888, 1636, 3244,
       3549, 1476, 2212, 2796,  748, 1788, 2402, 2303,  582, 1814, 1555,
       3729, 3588,  125, 2300, 3216, 3395, 1854, 3909, 4041, 3481, 1170,
        125, 3891, 1629, 2006, 3221,  619,  803, 3235, 3521, 3850, 2360,
       2459, 1619, 3975,  607, 1605,  257, 1063, 2173, 1961, 3112,   30,
       1146, 1905, 3027,  675, 1144,  186,  881, 1580, 2786, 1516, 3264,
       1825, 1977, 3678, 3078, 2010, 3020, 1223,  943,  894, 3383,  254,
       2055, 2280,  781,  818, 2918,  905,  698, 3558, 1196, 3767,   27,
       3250, 2338, 1789, 1468, 2382, 3539, 1416,  531,   80,  470, 1773,
       1743,  950, 2474, 2527, 1072, 1071, 1190, 1637, 2697, 1567, 1706,
       3740, 3392, 2973, 2640, 2328,  610,  401, 2543, 2788, 1427, 1725,
       2329, 3341, 3477, 2784, 3175, 2665, 2097,  130, 3476,  101, 2572,
       2081, 3958, 2235,   31, 3746, 1585, 1357,  465, 2779, 2041, 3097,
       1462, 1057,  296, 3878, 2071, 3886, 1155, 1842,  465, 2099, 2795,
        715, 1099, 2630, 1577, 1171, 3001, 2186,   34,  764, 2468,  739,
       1801, 2973,  248, 1044, 3929, 3768, 3302, 3965, 1769, 1023, 2860,
       2816, 3806, 1604,  817, 1625, 3316, 2105,  257, 3138, 2099, 2162,
       3282, 3924, 3537, 1176,  321, 1241, 1362, 2613,  515, 1619, 3945,
       1235, 2746, 2641,  782, 1220, 1098,  581, 2288, 3741, 2455, 1203,
       1787, 1982, 2139, 3299, 3314, 2533,  788, 2857, 1762, 1555, 3295,
       2784, 1437,  314,   61,   17, 2396,  503, 3676, 1383, 2840, 1102,
       1543,   93,  577,   21, 2019, 3685,  492, 3174,  745, 1336, 2394,
       1815,  961, 3799, 3276, 4037, 2946, 3526,  518, 3905, 1394, 2069,
       1104, 3427, 1435, 1766, 1404, 3040,  787, 2915, 1942, 2976,  688,
       2876, 2861, 2325, 1566, 1692, 3979,  167, 1777,  406, 1442, 1877,
       1978, 3945, 2333, 2369, 3279, 3113, 3537, 3672, 3562, 2584, 3302,
        829, 3009,  216, 1473, 3107, 1562, 2358, 1027, 3044, 2814, 3029,
        294,  333, 1182, 3635, 3923, 2238,  781, 2284,   67,  302, 2393,
       3532, 1710, 2623,  874, 2261, 1871, 3816, 3551,  263, 2448,   78,
       2871, 3987, 1657, 3725, 3502, 2880,  186, 2728, 4086, 3080,  946,
       2820, 3270, 3826, 3858, 3626, 1871,  619, 1323, 2535, 2967, 2246,
       1864, 2746,  579,  536, 2209, 2047, 1254, 1538, 3682, 3059, 2401,
       3351,  183, 3077,  426, 3309,  826, 3998, 1892,  611, 2667,  626,
       1074, 2894, 2539,  245, 3438, 1304,  314, 3999, 3504,  603, 2871,
       1088,  236,  983, 1957, 2789, 2422, 2762, 1579, 2055, 3134, 2240,
       2013, 1293, 2191, 1081, 3593,  577, 2012,  851, 3946, 2819, 2789,
        481,  100, 3862,  887,  406,  931, 2291, 3701, 1789,  621, 1530,
        119, 2909,  685, 2235, 1074,  405,  499, 1433, 2138,  275,  235,
       3828,  629, 2601, 1953, 1715, 2743, 3449, 3596,  752,  739, 2074,
        895,   26,  151, 1890, 3648, 1116, 1166, 1033, 2404, 2469, 1971,
       2178, 3675,  782, 3225, 3042, 1305, 4038, 3739, 3257, 1476, 3336,
       2145,  460,  831, 3946, 1427, 3147, 1863, 1910,   93, 2085, 3140,
       2920, 3815, 2417, 1154,  465, 1344, 2860,  266, 3277,  638, 1094,
       2262, 1352,  204, 2725, 3901, 4046, 1571,  220, 1312, 1008, 2125,
       2266, 4089, 1394, 2374, 1827, 1853, 1950, 2992, 1245, 1748, 3920,
       2863, 2526, 1852, 3900,  226, 3444, 2551, 3553,  313, 2267,  587,
       1751, 3277,  233, 1001,  379,  717, 2987,  389, 2643, 3216,  278,
        261, 2936, 2365,  139, 3531, 1174, 4007, 1332, 3129, 2604, 3058,
       3764, 2287, 1879, 1517,  138,  554,  224, 3609,  512,  643, 3265,
       4085, 2100, 1019,  627, 2917, 2518, 3162,  123, 3957, 2637,  227,
       3905, 3287, 2653, 2097,  428, 2981, 3347, 2007, 1355, 3710, 2079,
        824,  392,  276, 2316, 1398, 1250, 2430, 1375, 1538, 1658, 3013,
        504, 1695, 2174,  854, 1351, 1286, 1087, 3729, 3368, 2239,  829,
        295,  960,  451,  910, 2011, 3644,  992, 2295, 1287, 3366,   99,
        855, 1399, 3205, 2398, 3252, 2146, 1712, 3014, 3940, 2629, 1543,
       2883, 2977, 3368,  978, 3661, 2449,  121, 2345,  618,  971, 3517,
        872, 2765, 2579, 2977, 2320, 3582, 1589, 3907, 1786, 3332, 3107,
       1562, 1798, 2292, 3898,  253, 1216, 2818,  578,  951, 2173,  974,
       2053,  922, 2029,   72, 3401, 2890,  717, 2537, 2721, 1781, 2693,
       2110, 2980, 1909, 2834, 3269, 2675, 1107, 3695, 1759, 3279, 1363,
       3582,  857, 4006,  964, 2059, 2052,  867, 3800, 2414, 3357, 4006,
        480, 2667, 1137, 4087,  194, 2513, 3874, 2536,  640, 2148, 2768,
        179, 2516, 3576, 3871,   85, 1633, 2642,  358, 3295, 1395,  850,
       3636, 3841, 3612, 3960, 1325, 1845,  316, 3664, 2256,  437, 1432,
        795,  494, 2901,  829, 1268, 2242,  610, 1436, 2367, 3564, 2836,
        349,  585,  558,  518, 1983, 2462, 2910, 2886,  971, 3605, 3173,
        886, 3485, 1207, 3238, 2258, 3101, 2934, 1423, 3120, 2052,  723,
        543, 3346, 2152,  357, 2157, 1921, 3548,  469, 3341,  407, 1076,
        369, 3018, 3724, 2589, 3940,  293, 4008, 1675, 2983, 3360, 1238,
       3590, 2712, 3630, 1558,  346, 3277,  322,  960, 1583, 3206, 2457,
       1541,  934, 1182, 3319, 3118, 2094, 3938, 3050, 2559,    3, 2371,
       3586, 2596,   63, 2774, 2356, 3815, 2727, 3459, 1671, 2575, 3279,
       1149, 2713, 3761,  376,  862,  673,  158, 2007,  818, 2777,  730,
       2456, 3554, 3946, 3493, 2320, 2461, 2036,   55, 3897, 1854, 2062,
       4023, 3164, 2396,  583,  819,  411, 1237, 1452, 1105,  343, 2121,
       1266, 1054, 3223, 1857,  664, 2087, 3029, 1624, 3807, 3783, 2000,
       3417, 2867, 3538,  867, 2269, 2036, 3556,  957, 2591, 3953, 2189,
         48, 2972, 1208, 1934,   56, 2754, 1660, 3511,  150, 3123, 1885,
       3508,  947, 2811, 2081, 1526, 1301, 3364, 2325,  225, 3472,  294,
         65, 1274,  267, 1035, 1174,  203,  264, 2400, 2412,  164, 1921,
        772, 3752, 1552,  810, 3701, 1678, 3753,  459,  395, 2170, 3741,
       2206, 2788, 2837, 1319, 2997, 3008,  512, 1351,  712, 1773, 2041,
       2503,  303, 3087, 2734, 1335, 1109, 2453, 2812, 3848, 1693, 1647,
       3922,  488, 3033, 2858, 1454, 3961,  685, 3022, 1339, 1498, 1094,
       2044,  109, 1303,  234, 2665, 3447, 3089, 3640, 2415,  765, 3866,
       1876, 2062,  247, 3453, 1405, 3082, 3146, 1324,  831, 3841, 1853,
        305, 3041, 2417, 1801, 3638, 3618, 2634, 4053, 1827, 3166, 3337,
       1519, 2228, 1917, 2176, 3610, 1256, 1462, 1248, 1028, 1157, 3097,
       1018,  524, 1141, 2956,  145, 2620, 2548,  329, 2633, 3785,  129,
        886, 3240, 4092, 3364,  509, 4067, 1236,  842, 2006, 3327,  255,
       2192, 2151,  595, 1485, 1918, 3610, 3061, 2823, 1930, 2513, 3518,
       1780,  879, 3577, 1786, 1421, 1278, 3574,  305, 3761,  755,   84,
       2180, 1515, 3657, 2756,  340, 2731, 2215, 3237, 1661,  758, 3603,
       2701, 4082, 2696, 2611, 1606, 3074,  945, 1632, 2310, 1495, 1781,
       2694, 1803, 3575, 2755, 4027, 3060, 1817, 1267,  412, 2209, 3506,
        408, 1764,  770,  177, 1883, 2316,   90,  763, 2746, 3377,  344,
        505, 1443,  106,  683, 2207, 2637, 1292, 3580,  950, 1251, 3133,
        985,  245, 3444, 1372, 1540, 3098, 1636, 2872,  594,    0, 1662,
       2617, 2927, 1862,   89,  557, 1690, 2010,  534, 2827,  982, 2260,
       1754,  567,  644, 1975, 2148, 1006,  330,  342,  495, 3906,  946,
       3605, 2027, 2290, 1926, 2545, 3467, 1372, 1487, 3245,  948,  530,
       2927,  990, 2350,  341, 2960, 2389, 3778, 2396, 2038, 2438,  785,
       3833, 1743, 1914, 3748, 3401, 3816, 3524, 3987, 2389, 1253,  120,
        398, 3705,  102,  710,  268, 1889,  599, 1362, 1286, 1120, 2305,
       3084, 3180,  157, 1602,  114, 1079, 3552, 3097, 2444,  407, 3403,
       3788, 1628, 3593, 2976, 3004,  957, 1162, 2033,  341,  194, 2041,
       1531,  302, 2725, 3809, 2264, 1448, 2438,  400, 3996, 3642, 1607,
       2817, 3669, 1721, 1406, 2464, 2389, 2058, 3693, 1719,  702, 2928,
       2984, 3321, 1969,  899, 2799, 3889,  786, 1171, 1018, 1315, 3566,
       2935, 1121, 1733,  384, 2310,  242,   14, 1043, 3683,  693, 1715,
       2401, 3618, 2073, 2981, 4032, 1316, 1014,  176, 1399,  674, 1080,
       1571,  274, 2550, 2145,  795, 1263,  793, 3809,  220,  177, 1810,
       2691,  987, 3259, 2280,  800,  341, 2904, 3167, 1706, 2571,  750,
        497, 1752, 1389, 3025,  352, 3481, 2458,  659, 2969, 2073,  963,
       2044, 2832, 1614, 3268, 1469, 2796, 3715, 2112, 2447, 3080, 2919,
       2411, 1497, 3726, 2968, 2863, 3007, 3628, 1575, 3283,  795, 1309,
        601, 3575, 2023,  691,  716, 3571,  264,  138, 3874, 1083, 2822,
        982, 3116, 1793,  978,  892, 3828, 1623, 3730, 4037, 2969, 3441,
       1144, 3233, 3812, 2317, 2363, 3883, 1091, 2584, 2828,  135, 2604,
       1676, 3158, 1563,  966,  763, 2018, 2194,  106, 1914, 3912, 2609,
        322, 2440, 2609, 3139, 2543, 1488, 3200, 3951, 3379, 3725, 2521,
       2421, 1558, 3804, 2824, 2287,  249,  596,   13,  442, 1596, 3997,
       3255, 2582, 1636, 2120, 2653,  819, 1929,  230,  986, 2634, 1113,
       2293, 2423,  131,  972, 1336, 1796, 1952, 2445,   45, 3721, 3010,
       1026,  586,  560, 1649, 1914, 2576, 3351, 3125,  830, 3533, 1067,
       2106, 2692, 1970,  971,  498, 2474,  601, 1220,  204,   77,  638,
        658, 2591, 3017, 1301, 3028,  950, 3374, 2645, 2808,  501, 3179,
       2597, 2382, 3279, 3363,  826, 3398, 3115, 2581,  629, 2126, 4074,
       2259, 2142, 1183,  724, 2695, 3161, 3834, 1638, 1984, 3631,   21,
       1194, 3875, 1472, 2199, 2866, 1932, 3552,  127,  696, 2964,  206,
       2634, 3198, 2782,  651, 1781, 3111, 1802, 3105, 1910, 2116, 2119,
       3965, 1608, 3355, 1690, 3863, 3038, 3217,  610,  144,  402,  607,
       2112, 1477, 1458, 1940,  758, 1986, 1730, 3179,  873, 4022,  958,
       2088, 2973, 2631, 1168, 2586, 2331, 2589, 2868, 2937, 2447, 2600,
       1715,  269, 3545,  888, 3978, 1688, 1456, 2382, 2124, 2903, 3364,
        520,  100, 3843,  720, 2162, 1121, 1656, 3404, 1653, 3951, 1268,
        361, 2154, 1833, 2949, 2362, 2924, 1120,  139, 1070,  826, 4090,
       2281, 2022, 1107,  579,  253,  130,   33, 2265,  253, 2169, 3307,
       1821, 1003, 2255, 2324, 3444, 1927, 1097, 2038, 3941, 1129, 1882,
       1607, 3098, 3116, 2343, 2431, 1819, 2735,  424, 4094, 3393,  349,
       3466, 4023,  522, 2874, 4044,    1, 1992, 2863, 3913, 1540, 1964,
       2751, 2818, 1015, 1942, 3547,   32,   88,  692, 3941,  338,  560,
       3875, 1436, 2574,  914, 2767, 2792, 3767, 1852,  115, 1561, 2322,
       3227, 2417, 3856,  755,  444,    4, 2872, 3565,  832, 1512, 2665,
       3399, 2543, 3701, 3523, 1474, 2339, 3221, 2934, 3689, 3237, 3294,
       2393, 2374,  567, 1468,  413, 3460,  448, 2219, 2778, 1295, 1374,
        383, 1337, 3558, 3878,  391, 1138, 2621, 3728, 1261, 3562, 3584,
       1249,  805, 2573,  771, 1457,   75, 2636,  507, 1355, 1380, 2944,
       2300,  241, 3543,  977,  540, 2170,  503, 3639, 3369, 2779, 3688,
