graph main_graph (
  %onnx::Sub_1[INT8, 1], exponents: [-6]
  %onnx::Sub_0[INT8, 5], exponents: [-6]
) {
  %2 = Sub[quant_type = 'S8'](%onnx::Sub_0, %onnx::Sub_1)
  return %2
}


initializers value:



values info:
%onnx::Sub_1[INT8, 1], exponents: [-6]
%onnx::Sub_0[INT8, 5], exponents: [-6]
%2[INT8, 5], exponents: [-6]


test inputs value:
%onnx::Sub_0, shape: [5], exponents: [-6], 
value: array([63, 50,  2, 47, 47], dtype=int8)
%onnx::Sub_1, shape: [1], exponents: [-6], 
value: array([35], dtype=int8)


test outputs value:
%2, shape: [5], exponents: [-6], 
value: array([ 28,  15, -33,  12,  12], dtype=int8)