graph main_graph (
  %onnx::Sub_1[INT8, 1], exponents: [-6]
  %onnx::Sub_0[INT8, 8x2x5], exponents: [-6]
) {
  %2 = Sub[quant_type = 'S8'](%onnx::Sub_0, %onnx::Sub_1)
  return %2
}


initializers value:



values info:
%onnx::Sub_1[INT8, 1], exponents: [-6]
%onnx::Sub_0[INT8, 8x2x5], exponents: [-6]
%2[INT8, 8x2x5], exponents: [-6]


test inputs value:
%onnx::Sub_0, shape: [8, 2, 5], exponents: [-6], 
value: array([55, 44,  9, 53, 54, 54,  6,  4, 20, 22, 23, 29, 18, 10, 27, 26, 24,
       20, 34, 63, 10, 15, 32, 59, 39, 43, 53, 16, 32, 12, 24, 21, 43, 46,
       17, 26, 33,  5, 52, 46, 38, 16,  3, 45, 18, 35, 20, 61, 18, 21, 18,
       16, 19,  4, 17,  9, 37, 51, 51, 48, 31, 63,  5, 34,  7, 55, 48,  9,
       10,  3, 12, 42, 38, 56,  4, 17, 21, 51, 18, 64], dtype=int8)
%onnx::Sub_1, shape: [1], exponents: [-6], 
value: array([56], dtype=int8)


test outputs value:
%2, shape: [8, 2, 5], exponents: [-6], 
value: array([ -1, -12, -47,  -3,  -2,  -2, -50, -52, -36, -34, -33, -27, -38,
       -46, -29, -30, -32, -36, -22,   7, -46, -41, -24,   3, -17, -13,
        -3, -40, -24, -44, -32, -35, -13, -10, -39, -30, -23, -51,  -4,
       -10, -18, -40, -53, -11, -38, -21, -36,   5, -38, -35, -38, -40,
       -37, -52, -39, -47, -19,  -5,  -5,  -8, -25,   7, -51, -22, -49,
        -1,  -8, -47, -46, -53, -44, -14, -18,   0, -52, -39, -35,  -5,
       -38,   8], dtype=int8)