graph main_graph (
  %onnx::Sub_1[INT16, 1x1x1x31], exponents: [-13]
  %onnx::Sub_0[INT16, 1x5x5x31], exponents: [-13]
) {
  %2 = Sub[quant_type = 'S16'](%onnx::Sub_0, %onnx::Sub_1)
  return %2
}


initializers value:



values info:
%2[INT16, 1x5x5x31], exponents: [-13]
%onnx::Sub_1[INT16, 1x1x1x31], exponents: [-13]
%onnx::Sub_0[INT16, 1x5x5x31], exponents: [-13]


test inputs value:
%onnx::Sub_0, shape: [1, 5, 5, 31], exponents: [-13], 
value: array([ 183, 2611, 5022, 3891,  762, 1398, 7590, 4419, 1744, 5080, 1843,
       7349, 3205, 4446, 4069, 5152, 5040, 3441, 4573, 6858, 3129, 7352,
       1937,  834, 6292, 2302, 3820,  911, 6540, 7661,  145, 2385, 7207,
       8019, 5072, 7545, 2782,  754, 2512, 6865,  575,  599, 7934, 3180,
       6229, 4111,  251, 6916, 1823, 5718, 4787, 2618, 1670, 7674, 6311,
       7667,  407, 8154, 6087, 6070, 2901, 1990, 1588, 6599, 5373, 3203,
       1663, 3998, 4272, 4695, 5730, 1478, 1015, 1684,  579, 1346, 4172,
       6613, 6287, 7348, 6229, 6887, 2518, 2316, 3486, 4015, 5423, 6013,
       7066, 4710, 6749, 3286, 1814, 6876, 5309, 6500, 7739, 3961, 6822,
         75, 3684, 7830,   26, 4857, 1461, 7225, 5973, 5286, 7367, 4214,
       5686, 2452,  518,   81, 1337,  390,  589, 3324, 1305, 6276, 7948,
       5059, 7752, 1183, 4468, 2381, 5100, 4791, 6707,  193, 6490, 4498,
       7529, 4272, 2946, 7342, 7994, 2342, 7203, 5057, 6925, 7132, 3201,
        461, 7781, 5095, 7216, 2997,  767, 3636, 3761,   70, 4281,    6,
        921, 2326, 6945,  499, 3996,  146, 2931, 4428, 3314, 3764, 3795,
       7347,  120, 3413, 4640, 5302,  997, 6987, 1333,   83, 5677,  292,
       1976, 3598, 7840, 3660, 6389, 2177, 3322, 5907, 1402, 2642, 1642,
       7468, 3363, 3132, 3611, 6338, 6269, 6701,  886, 5598, 5067, 4651,
       8100, 6682, 2256, 2723, 5869, 6115,  356, 1869,  962, 6153, 2024,
       1606, 5917, 3944, 1729, 5070, 6342, 4682,    0, 2495, 4707, 2806,
        425, 1785, 4152, 4604, 7043, 5970, 1431, 1073, 1059, 8091, 6996,
        402, 6048, 2848, 3985, 7639, 5433,  826, 5936, 4136, 6051, 1233,
         46, 2836, 4701, 5701, 6130,  742, 1324,  696, 6747, 6293, 3049,
       7980, 1474, 2125, 4712, 7744, 7556, 6886, 2689, 4025, 4123, 2223,
       1361, 5148, 5458, 4011, 7853, 2086,  318, 3026, 2520,  353, 1098,
        458, 3074, 6720, 2171, 3532, 7526, 7179, 3779, 5095, 7425, 6105,
       4910, 6144, 2079, 4674, 5891,  981, 6218, 4235, 7632,   33,   49,
       5544, 3019, 8177, 2082, 2500, 4657, 6630, 7290, 2053, 5887, 1045,
       1837, 4810, 6362,  247,  960, 2376, 4710, 3785, 5017, 6352, 5844,
       4625,   98,  376, 2162, 2402, 1897, 4080, 1359, 7148, 6694, 4115,
       1105, 7508, 3587,  688, 7268, 6471,  485, 4232, 6190, 1541, 6328,
       1794, 3713, 1524, 3993, 1524, 1267, 3184, 5614, 7769, 1951, 6940,
       1829, 3424, 4832, 7766, 4878, 2274, 6407,  374,  664,  385, 2054,
       3292, 2721, 1548, 2807, 5334, 5710, 3221, 3881, 3926, 6462, 6761,
        365, 6902,  128, 4432,  757, 3928,  363, 5571, 3256, 6828, 7183,
       5168,  111, 1253, 5697, 7333, 6612, 8129, 3388,   22, 2793,    8,
       2190, 3195, 4074, 4189, 7930, 3012, 2109, 5195, 7428, 3882, 4912,
       2557, 7987, 7880, 2899, 1535, 4428, 5673, 1178,  611, 7252, 7776,
       6104, 5131,  463, 2243, 7392, 3133, 4197, 4575, 2774, 4263, 3538,
         20, 6721, 1734, 7034, 4710, 1138, 2432, 7069, 1567, 1293, 7366,
       3119, 1653, 2984, 5811,  738, 5312, 2292, 7827, 1331, 7081, 5531,
       4353, 3189,  191, 5435, 5910, 7255, 1202, 7513, 2869, 2216, 2379,
       1995, 3311, 7035, 5177, 3460, 7540, 8005, 6987, 2342, 7242, 7356,
       6721, 3010, 6389, 7634, 5843,  367, 4095, 1121, 5641, 2040, 4437,
       7757, 7667, 6832, 3709, 4768, 8083, 6155, 3750,  399, 6606, 3170,
        723, 4527, 1855, 2572, 1573, 4082,  554, 5720, 3704, 7418, 6108,
       7105, 1173, 3898, 2869, 1800,  976,  311, 5680, 8143, 4068,  419,
       7306, 5838, 5189,  761, 2264,  600, 4693, 3624, 6829,  347, 1584,
       7694, 1143, 4146, 7318, 8098,  553, 1889, 2993,  659, 6814, 1728,
        715, 6436, 2398, 6763, 6764, 7153, 3212,  993, 3409, 6668, 2747,
       7971, 5336,  328, 5644, 2932, 4351, 7570, 6242, 6527, 4173, 6230,
       7155, 4620, 2227, 6038, 5837, 4178, 5923, 3623, 6302, 3811, 1730,
       1394, 5479, 7539, 2085,  876, 4385, 6917, 4150, 1481, 1761, 7542,
       7565, 6250, 5952, 6307, 1952, 4982, 7455, 5617, 6652, 1498, 6928,
       2227, 1054, 6945, 2270, 2306, 6756, 3327, 4543, 7900,  966, 7054,
       7004, 6113, 6728,  316, 4196, 1683, 4015, 8098, 7016, 4254, 5434,
        120, 5064, 3678, 6309, 2486, 4944, 1634, 7943, 3151,   72, 3678,
       3511, 1750, 7396, 5963, 7136, 8008, 7678, 6784, 3256, 3509, 7257,
       6493, 5899, 4240, 5052, 1448, 4805, 3957, 6981, 4603, 5628, 4213,
       7439, 4697,  736, 3972,  776, 7289, 4202, 7913, 5355, 5601, 7368,
        315, 1023, 1789, 4288, 2278, 4269, 7045, 5415, 1279, 7342, 1671,
       3181, 1624, 5703, 3563, 7279,  884,  481, 6008, 2702, 5628, 4474,
       6872, 7591, 2421, 3385, 1481, 6610, 8158, 2691, 4733, 7102,   82,
       3265, 5420, 2060,  680, 4181, 2625, 3175, 7968, 1130, 4355, 3994,
       5895, 5514, 3861,  157, 6583, 5530, 5001, 1907, 8012, 5383, 2365,
       5885, 6352, 4200, 5479,  223, 2188, 8098, 4303, 1481, 4393, 4433,
       1721, 1599, 7819, 7621, 5942, 2576, 4020, 4966, 2354, 2052, 6294,
        627, 5522, 6843, 7672, 2800, 1565,  432, 4878, 4383, 2429, 6269,
       6433, 4493, 4856,  763, 6946, 1441, 6344, 3878, 2251, 1682,  310,
       7362, 4831, 2670, 2589, 5694, 5530,  500, 5435,  732,  141, 6021,
       7403, 4515, 3666,  952, 1227], dtype=int16)
%onnx::Sub_1, shape: [1, 1, 1, 31], exponents: [-13], 
value: array([1484,  744, 7584, 2186, 7902, 2022, 3903, 7428, 2973,  372, 6346,
       1639, 5990, 4884, 5162, 5196, 1764, 5254,  551, 7358, 8179, 1057,
       1715, 2140, 3779, 5448, 7308, 7123, 7044, 3350, 5449], dtype=int16)


test outputs value:
%2, shape: [1, 5, 5, 31], exponents: [-13], 
value: array([-1301,  1867, -2562,  1705, -7140,  -624,  3687, -3009, -1229,
        4708, -4503,  5710, -2785,  -438, -1093,   -44,  3276, -1813,
        4022,  -500, -5050,  6295,   222, -1306,  2513, -3146, -3488,
       -6212,  -504,  4311, -5304,   901,  6463,   435,  2886,  -357,
         760, -3149, -4916,  3892,   203, -5747,  6295, -2810,  1345,
       -1051, -4945,  5152, -3431,  5167, -2571, -5561,   613,  5959,
        4171,  3888, -5041,   846, -1036,  -974,  -449, -3459,   104,
        5855, -2211,  1017, -6239,  1976,   369, -2733,  2757,  1106,
       -5331,    45, -5411, -3538,  -990,  1417,  4523,  2094,  5678,
        -471, -5661,  1259,  1771,  1875,  1644,   565,  -242, -2413,
        -295,   -64, -3635,  5392,  4565, -1084,  5553, -3941,  4800,
       -3828, -3744,  4857,  -346, -1489,  -178,  1235,  1089,   124,
        2171,  2450,   432,  1901, -6840, -8098,   280, -1325, -1551,
        -455, -4143, -1032,   825, -1985,  4402, -4266,  2984,  1637,
       -2484,  2605, -1195, -1829,  2587, -2930,  4556,  3900, -3400,
        5703,  2004, -2542,  2041,  -139,  5161,  1878,  2650, -6897,
        -398,  4038,  5501,   857, -3012, -1812, -3547, -7053, -2763,
       -3344, -4528,   842,  6201, -7085,  1810, -7756,   909,   525,
       -4114,   791,  3423,  1001, -1519, -2577,  -244,   140, -4199,
        5223, -3921,  -468, -1681, -7887,   919,  1883,  5700,  -119,
         941, -5131, -3801, -1137, -1948, -2807,   158,  6724, -4221,
         946, -4291,  4316,  2366,  -727, -2087,  5226, -1279,  3012,
        2110,  1798, -2906, -2473,  4105,   861,  -195, -5489, -7217,
        5096,   309,  -534,  2138, -1504, -5579, -2053,  -702,  1332,
       -5449,  1011,  3963, -4778, -1761, -6117,  2130,   701,  -385,
        2997,  1059, -5273,  -580,  2101,  2112, -4760,   852,  1084,
       -1269,  7088, -1925, -7353,  4879,  2421,  3911, -2546, -5402,
       -4472, -2422, -1343,  2780, -4707,  -160,   -48,  -837,  4107,
       -4853,  5958, -2429, -5303,  1739,  7372,  1210,  5247, -3301,
        -859, -1039, -2973,  -403,  -106,  4907, -3347,  -326,  1029,
       -1397,   886, -1259, -5095, -6210, -6665, -3970,  3370, -3278,
        2048,  6782,  -405,  1593, -2807,  5403,  2202, -2518,  3171,
        1707, -1672,  4252, -5009,  1334,  -927,  2436, -1731, -5205,
        4993, -4339,    -2,  1025,   785,  2517,  2851,  1842, -5255,
       -1236, -5999, -1513,  -639,  4878,  -497, -6624,   190, -3192,
        1763,  1114, -1076,  2871,  4253, -6248, -1263, -3828, -2482,
       -3265, -1116,  -405,  1894,  6143, -3243, -7074,  6451,  1872,
       -1452,  3489,  1023, -6823, -2891,  -854, -1809,   879,   310,
        2969, -6060,  1807, -6378,  -755,  -719, -1814,  4796,  1579,
         594,   190, -2566,   -52,  2604,  -318,   510,  1153,  -177,
       -6694, -7794,   997,  1577,   581, -2231, -2641, -1974, -1413,
       -3823,   531, -1523,  4978,  6017, -7219,  4716, -7774,  2410,
       -3146, -3500, -2610,  5199, -3090,  5189,  1193,   284, -5051,
       -3943,  3933,  2079,  6061,   771, -4791, -1035,  1078, -2132,
       -1589, -2253, -3234, -2934,   886,  -338, -3340,  3711,  6684,
       -3702,  2726, -5345,  5965,  3977, -4529, -1438,  4056,  -673,
        -461, -5379,  2368,  2614,   908,  3367, -4791,  1692,    34,
       -5046,  3140,  2860,   634,   484, -1910, -7288,  -402, -5310,
        3684,  -739,  -346,  1688,  -515,  -619, -6609,  5344,  -784,
       -5775,    11,  5439, -5608,  3673, -3698,  2943, -3831,  1885,
        3767,  -901,  2638, -7167, -2744,  4853,  5540,  -938,  3734,
       -2579, -5092, -4744, -5049,   -39,  1586,  3693,  2716,   -44,
        5819,  -915,   320,  3339,   -72,  3748,  2638,    43,  5995,
        -147, -4517, -1067, -4075,  3877, -3214,  3886,   399,  -512,
        5775,  1994,  2628,  4304,   707, -3558, -6724,  -438,  -180,
       -4726,  3043,  1111, -5012,  -613, -3820, -1468,  1817, -3724,
        4445,  5736,   759,  -466, -2092, -2015, -3362, -4220, -1453,
         426,  7592, -3290, -7760,  6249,  4123,  3049, -3018, -3184,
       -6708, -2430, -3420,  3479, -5102,   100,  6950, -6441,  1960,
        -584,  6076, -3350, -5539,    20,   287,   468,    89, -5275,
        1552, -2764,  1567,  5000,  1899,  2661, -6365, -4770,  5611,
        1032,  5831,  1557, -5120, -1664, -4191, -2693,  4220,   793,
        5043,  3429, -1354,  4969, -3282,   205,  2135, -1591,  1205,
        5551, -2723,  4663, -2179, -3154, -3768,   283,  5775, -3169,
         325, -2973, -1262,  3093,  -234,  -379,  3763,  2117, -1058,
       -1171,  -737, -1398,  -467,  5971,  4873,  -932,  -688,  -974,
         205, -2849,  -483,  -703,  1934,   410,  1688, -1447,  3016,
       -4196,  1858,  5240,   859,  6177, -7042, -3983,   626,  2300,
        5958,  3237, -1194, -1874, -7003, -1980,   328,   860,  1002,
        4200, -5950,  5757, -4751, -1950,  -225, -3917, -1223,  7024,
        -383,  5497,  2018,  2794,  1622, -1940,  1745,  2003,  5942,
       -1459, -3939,  3995,  -267,  2665,   178,  1533, -2705, -1495,
       -2831,  4089,  -752,  -748,  3228, -6808,  5103, -3700,  5891,
        1452, -1827,  4395,   -57, -5323,   150, -1702, -2606,  -893,
        1849,  3651, -3975,  6791, -5687, -4998,   567,  3988,  1423,
        3500, -4564, -6827, -1115, -4342,  2278,  -975,  5388,  6847,
       -5163,  1199, -6421,  4588,  4255, -4737,  1760,  6730, -6264,
        1626,  -570, -2824, -4482, -1015,   861, -2079,  7417, -6228,
       -3824,  2937,  4180,  3374,    82, -5291,  -725, -1593, -2043,
       -1443,  2563,  3899,  1621, -1699,  4166, -3702,  3457, -3680,
       -5240,  5125,  3931, -4865,  2754, -1557, -3163, -3563,  2623,
        5857,   688,  2025, -3338, -3213,  1297,   337,  4154, -3152,
          74,  -465,   549, -4244, -1785, -5017,  3394,  3639, -5155,
        4083, -1469,  2471,   953, -6665,  3973,  1069,    -2,  2239,
       -3739, -3202, -4852,  2166,  3067, -2584,  2038, -1664, -2649,
        -557,  3720, -1408, -3638,   573,    95, -2608, -3378, -2398,
       -4222], dtype=int16)