graph main_graph (
  %onnx::Sub_1[INT16, 2x3x1x1], exponents: [-13]
  %onnx::Sub_0[INT16, 1x1x4x5], exponents: [-13]
) {
  %2 = Sub[quant_type = 'S16'](%onnx::Sub_0, %onnx::Sub_1)
  return %2
}


initializers value:



values info:
%2[INT16, 2x3x4x5], exponents: [-13]
%onnx::Sub_1[INT16, 2x3x1x1], exponents: [-13]
%onnx::Sub_0[INT16, 1x1x4x5], exponents: [-13]


test inputs value:
%onnx::Sub_0, shape: [1, 1, 4, 5], exponents: [-13], 
value: array([ 436,  161, 5144,  935, 5494, 5569,  987, 1119, 2537, 7392, 2882,
       3305, 4620, 7314, 2228, 5616,  840, 3450, 2808, 3208], dtype=int16)
%onnx::Sub_1, shape: [2, 3, 1, 1], exponents: [-13], 
value: array([5051, 5192, 3668, 2246, 1613, 6517], dtype=int16)


test outputs value:
%2, shape: [2, 3, 4, 5], exponents: [-13], 
value: array([-4615, -4890,    93, -4116,   443,   518, -4064, -3932, -2514,
        2341, -2169, -1746,  -431,  2263, -2823,   565, -4211, -1601,
       -2243, -1843, -4756, -5031,   -48, -4257,   302,   377, -4205,
       -4073, -2655,  2200, -2310, -1887,  -572,  2122, -2964,   424,
       -4352, -1742, -2384, -1984, -3232, -3507,  1476, -2733,  1826,
        1901, -2681, -2549, -1131,  3724,  -786,  -363,   952,  3646,
       -1440,  1948, -2828,  -218,  -860,  -460, -1810, -2085,  2898,
       -1311,  3248,  3323, -1259, -1127,   291,  5146,   636,  1059,
        2374,  5068,   -18,  3370, -1406,  1204,   562,   962, -1177,
       -1452,  3531,  -678,  3881,  3956,  -626,  -494,   924,  5779,
        1269,  1692,  3007,  5701,   615,  4003,  -773,  1837,  1195,
        1595, -6081, -6356, -1373, -5582, -1023,  -948, -5530, -5398,
       -3980,   875, -3635, -3212, -1897,   797, -4289,  -901, -5677,
       -3067, -3709, -3309], dtype=int16)