graph main_graph (
  %onnx::Sub_1[INT8, 1x1x1x1], exponents: [-5]
  %onnx::Sub_0[INT8, 2x3x4x5], exponents: [-5]
) {
  %2 = Sub[quant_type = 'S8'](%onnx::Sub_0, %onnx::Sub_1)
  return %2
}


initializers value:



values info:
%onnx::Sub_1[INT8, 1x1x1x1], exponents: [-5]
%onnx::Sub_0[INT8, 2x3x4x5], exponents: [-5]
%2[INT8, 2x3x4x5], exponents: [-5]


test inputs value:
%onnx::Sub_0, shape: [2, 3, 4, 5], exponents: [-5], 
value: array([25,  2, 18, 28, 12, 12, 11, 25, 32,  1, 13, 14, 26, 30,  8,  4, 30,
        5, 22,  0, 14, 16, 28, 14, 14,  9,  5, 12,  7, 22,  5, 12,  3, 28,
       26, 24, 22, 31, 11,  2, 11, 14,  3,  9, 30, 20, 19, 31,  6,  8, 14,
       30, 16, 29, 18, 29,  4, 31,  8,  2, 31,  6, 16, 23,  2, 30, 18, 23,
       14,  8, 27, 30, 17, 28,  5, 28,  7,  6, 18, 20,  2, 28, 10, 15,  7,
       17,  3,  0, 19, 19, 29, 24,  4, 12,  3,  5,  1, 30, 10, 11, 21,  6,
       21, 29,  2, 30, 18, 30, 28,  4, 12, 10, 24,  1, 28, 31, 17, 16,  7,
        5], dtype=int8)
%onnx::Sub_1, shape: [1, 1, 1, 1], exponents: [-5], 
value: array([14], dtype=int8)


test outputs value:
%2, shape: [2, 3, 4, 5], exponents: [-5], 
value: array([ 11, -12,   4,  14,  -2,  -2,  -3,  11,  18, -13,  -1,   0,  12,
        16,  -6, -10,  16,  -9,   8, -14,   0,   2,  14,   0,   0,  -5,
        -9,  -2,  -7,   8,  -9,  -2, -11,  14,  12,  10,   8,  17,  -3,
       -12,  -3,   0, -11,  -5,  16,   6,   5,  17,  -8,  -6,   0,  16,
         2,  15,   4,  15, -10,  17,  -6, -12,  17,  -8,   2,   9, -12,
        16,   4,   9,   0,  -6,  13,  16,   3,  14,  -9,  14,  -7,  -8,
         4,   6, -12,  14,  -4,   1,  -7,   3, -11, -14,   5,   5,  15,
        10, -10,  -2, -11,  -9, -13,  16,  -4,  -3,   7,  -8,   7,  15,
       -12,  16,   4,  16,  14, -10,  -2,  -4,  10, -13,  14,  17,   3,
         2,  -7,  -9], dtype=int8)