graph main_graph (
  %onnx::Mul_1[INT16, 1x1x1x1], exponents: [-14]
  %onnx::Mul_0[INT16, 2x3x4x5], exponents: [-14]
) {
  %2 = Mul[quant_type = 'S16'](%onnx::Mul_0, %onnx::Mul_1)
  return %2
}


initializers value:



values info:
%onnx::Mul_1[INT16, 1x1x1x1], exponents: [-14]
%onnx::Mul_0[INT16, 2x3x4x5], exponents: [-14]
%2[INT16, 2x3x4x5], exponents: [-13]


test inputs value:
%onnx::Mul_0, shape: [2, 3, 4, 5], exponents: [-14], 
value: array([ 9564, 10694,  5309,  1498,  3383,   575, 12213, 12924,  6986,
       10705, 15952,  2614, 15555, 14254,  4626, 12377,  7361, 13872,
        1616,  2584,  9326,  2192,  5055,  9876, 10049, 15380,  6527,
        7967, 13046,  4244,  5246,  5427,  7741, 15889,   197,  2510,
        8671, 12144,  2118,  7965, 12506, 14243,  9509, 12808, 15911,
       11089,  6515, 12171, 15293, 14207,  5977, 13311,  6754, 14819,
       13838,  8897,  1539,  7265, 14138, 15153, 14141,  6637, 11645,
        1757,  1289, 15389,  6505,  9304,  4098, 11513,  2872,  3862,
       12256,  1599,   589,  5624,  3105,  3373,  8423,  8496,  9899,
       13305,  3160,  1021,  6540,  9415,  7394, 10722, 13407,  1656,
        1536, 12182,   459, 13358, 14686,  6434,  1422,  8926, 14088,
       15398,  1372,  3092, 13639, 11484, 16199,  6477,  9300, 13463,
        8352,  7227,  3951, 13099, 14858,  8439, 11230, 14986,   876,
       10977,  4526,  1284], dtype=int16)
%onnx::Mul_1, shape: [1, 1, 1, 1], exponents: [-14], 
value: array([13033], dtype=int16)


test outputs value:
%2, shape: [2, 3, 4, 5], exponents: [-13], 
value: array([3804, 4253, 2112,  596, 1346,  229, 4858, 5140, 2779, 4258, 6345,
       1040, 6187, 5669, 1840, 4923, 2928, 5517,  643, 1028, 3709,  872,
       2011, 3928, 3997, 6117, 2596, 3169, 5189, 1688, 2087, 2159, 3079,
       6320,   78,  998, 3449, 4830,  842, 3168, 4974, 5665, 3782, 5094,
       6328, 4410, 2591, 4841, 6083, 5651, 2377, 5294, 2686, 5894, 5504,
       3539,  612, 2890, 5623, 6027, 5624, 2640, 4632,  699,  513, 6121,
       2587, 3701, 1630, 4579, 1142, 1536, 4875,  636,  234, 2237, 1235,
       1342, 3350, 3379, 3937, 5292, 1257,  406, 2601, 3745, 2941, 4265,
       5332,  659,  611, 4845,  183, 5313, 5841, 2559,  566, 3550, 5603,
       6124,  546, 1230, 5425, 4568, 6443, 2576, 3699, 5355, 3322, 2874,
       1571, 5210, 5910, 3356, 4467, 5960,  348, 4366, 1800,  511],
      dtype=int16)