graph main_graph (
  %onnx::Mul_1[INT16, 2x3x1x1], exponents: [-16]
  %onnx::Mul_0[INT16, 1x1x4x5], exponents: [-14]
) {
  %2 = Mul[quant_type = 'S16'](%onnx::Mul_0, %onnx::Mul_1)
  return %2
}


initializers value:



values info:
%onnx::Mul_1[INT16, 2x3x1x1], exponents: [-16]
%onnx::Mul_0[INT16, 1x1x4x5], exponents: [-14]
%2[INT16, 2x3x4x5], exponents: [-14]


test inputs value:
%onnx::Mul_0, shape: [1, 1, 4, 5], exponents: [-14], 
value: array([12760,  7010, 13176,   246,   475, 13051,  6266, 10347, 14903,
        7096,   250,  9680,  6271, 13477, 14824,  1198,  5291,  6360,
       13729,  8771], dtype=int16)
%onnx::Mul_1, shape: [2, 3, 1, 1], exponents: [-16], 
value: array([ 3816, 15027, 32767, 21905, 32767, 32767], dtype=int16)


test outputs value:
%2, shape: [2, 3, 4, 5], exponents: [-14], 
value: array([ 743,  408,  767,   14,   28,  760,  365,  602,  868,  413,   15,
        564,  365,  785,  863,   70,  308,  370,  799,  511, 2926, 1607,
       3021,   56,  109, 2993, 1437, 2373, 3417, 1627,   57, 2220, 1438,
       3090, 3399,  275, 1213, 1458, 3148, 2011, 6380, 3505, 6588,  123,
        237, 6525, 3133, 5173, 7451, 3548,  125, 4840, 3135, 6738, 7412,
        599, 2645, 3180, 6864, 4385, 4265, 2343, 4404,   82,  159, 4362,
       2094, 3458, 4981, 2372,   84, 3235, 2096, 4505, 4955,  400, 1768,
       2126, 4589, 2932, 6380, 3505, 6588,  123,  237, 6525, 3133, 5173,
       7451, 3548,  125, 4840, 3135, 6738, 7412,  599, 2645, 3180, 6864,
       4385, 6380, 3505, 6588,  123,  237, 6525, 3133, 5173, 7451, 3548,
        125, 4840, 3135, 6738, 7412,  599, 2645, 3180, 6864, 4385],
      dtype=int16)