graph main_graph (
  %onnx::Mul_1[INT16, 1], exponents: [-14]
  %onnx::Mul_0[INT16, 48], exponents: [-20]
) {
  %2 = Mul[quant_type = 'S16'](%onnx::Mul_0, %onnx::Mul_1)
  return %2
}


initializers value:



values info:
%onnx::Mul_1[INT16, 1], exponents: [-14]
%onnx::Mul_0[INT16, 48], exponents: [-20]
%2[INT16, 48], exponents: [-19]


test inputs value:
%onnx::Mul_0, shape: [48], exponents: [-20], 
value: array([32767, 32767, 32767,  4629, 32767, 32767, 32767, 32767, 32767,
       17602, 32767, 32767, 32767, 32767, 32767, 32767, 32767, 32767,
       32767, 32767, 32767, 32767, 30188, 32767, 32767, 32767, 32767,
       32767, 32767, 32767, 32767, 32767, 32767, 32767, 32767, 32767,
       32767, 32767, 32767, 32767, 32767, 32767, 32767, 32767, 32767,
       32767, 32767, 32767], dtype=int16)
%onnx::Mul_1, shape: [1], exponents: [-14], 
value: array([9907], dtype=int16)


test outputs value:
%2, shape: [48], exponents: [-19], 
value: array([9907, 9907, 9907, 1400, 9907, 9907, 9907, 9907, 9907, 5322, 9907,
       9907, 9907, 9907, 9907, 9907, 9907, 9907, 9907, 9907, 9907, 9907,
       9127, 9907, 9907, 9907, 9907, 9907, 9907, 9907, 9907, 9907, 9907,
       9907, 9907, 9907, 9907, 9907, 9907, 9907, 9907, 9907, 9907, 9907,
       9907, 9907, 9907, 9907], dtype=int16)