graph main_graph (
  %onnx::Mul_1[INT16, 1x1x1x1], exponents: [-14]
  %onnx::Mul_0[INT16, 1x1x1x1], exponents: [-18]
) {
  %2 = Mul[quant_type = 'S16'](%onnx::Mul_0, %onnx::Mul_1)
  return %2
}


initializers value:



values info:
%onnx::Mul_1[INT16, 1x1x1x1], exponents: [-14]
%onnx::Mul_0[INT16, 1x1x1x1], exponents: [-18]
%2[INT16, 1x1x1x1], exponents: [-17]


test inputs value:
%onnx::Mul_0, shape: [1, 1, 1, 1], exponents: [-18], 
value: array([32767], dtype=int16)
%onnx::Mul_1, shape: [1, 1, 1, 1], exponents: [-14], 
value: array([9993], dtype=int16)


test outputs value:
%2, shape: [1, 1, 1, 1], exponents: [-17], 
value: array([9993], dtype=int16)