graph main_graph (
  %onnx::Mul_1[INT16, 1], exponents: [-16]
  %onnx::Mul_0[INT16, 8x2x5], exponents: [-15]
) {
  %2 = Mul[quant_type = 'S16'](%onnx::Mul_0, %onnx::Mul_1)
  return %2
}


initializers value:



values info:
%onnx::Mul_1[INT16, 1], exponents: [-16]
%onnx::Mul_0[INT16, 8x2x5], exponents: [-15]
%2[INT16, 8x2x5], exponents: [-16]


test inputs value:
%onnx::Mul_0, shape: [8, 2, 5], exponents: [-15], 
value: array([28506, 28393,  6758,  3702, 14390, 22994, 24110, 24656, 27172,
        2790, 27166, 25529, 13953,  7839,  3771,   892, 30902, 17588,
        7267,  6868,   441, 13029, 28846, 16692,  2489, 16988,  5424,
       22091, 31065,  2873,  5426,  8343,  4800, 20531,  7281, 12757,
       28843, 17314,  2630,  5796, 20938, 11491,  3422, 27296, 14206,
       29499,  2487, 21624,  9072,  1413, 29823,  8447, 20174,  7086,
        3287,  7310, 31053, 32106, 14627,  9057, 18543,  3927, 22309,
       24932, 14893, 27286, 19008, 27980, 31207, 26768, 23792, 19153,
       19077,  5718,  5417, 17341, 16433, 17530, 23801, 12391],
      dtype=int16)
%onnx::Mul_1, shape: [1], exponents: [-16], 
value: array([26654], dtype=int16)


test outputs value:
%2, shape: [8, 2, 5], exponents: [-16], 
value: array([23187, 23095,  5497,  3011, 11705, 18704, 19611, 20056, 22102,
        2269, 22097, 20766, 11350,  6376,  3067,   726, 25136, 14306,
        5911,  5587,   359, 10598, 23464, 13578,  2025, 13818,  4412,
       17969, 25269,  2337,  4414,  6786,  3904, 16700,  5922, 10377,
       23461, 14083,  2139,  4715, 17031,  9347,  2784, 22203, 11555,
       23995,  2023, 17589,  7379,  1149, 24258,  6871, 16410,  5764,
        2674,  5946, 25259, 26116, 11898,  7367, 15083,  3194, 18146,
       20280, 12114, 22195, 15461, 22759, 25384, 21774, 19353, 15579,
       15518,  4651,  4406, 14105, 13367, 14259, 19360, 10079],
      dtype=int16)