graph main_graph (
  %onnx::Mul_0[INT16, 1x5x5x31], exponents: [-13]
  %onnx::Mul_1[INT16, 1x1x1x31], exponents: [-13]
) {
  %2 = Mul[quant_type = 'S16'](%onnx::Mul_0, %onnx::Mul_1)
  return %2
}


initializers value:



values info:
%onnx::Mul_0[INT16, 1x5x5x31], exponents: [-13]
%2[INT16, 1x5x5x31], exponents: [-13]
%onnx::Mul_1[INT16, 1x1x1x31], exponents: [-13]


test inputs value:
%onnx::Mul_0, shape: [1, 5, 5, 31], exponents: [-13], 
value: array([2645, 7191, 8136, 8008,  264, 5467,  805, 7244, 7798, 2338, 6868,
       2796, 4943, 2043,  865, 8144, 7454, 4484, 5522, 1323, 7596, 2992,
       1975, 6937, 4959, 4607, 3358, 1349, 3004, 6750, 1106, 6019, 6431,
       4486,  293, 5081, 7404, 1047, 3458, 5797, 4903,  648, 5163, 6430,
       4411, 4200, 2878,  200, 4530, 1102, 7399, 6103, 7487, 6877,  837,
       7941, 2592, 5776, 1843, 5848,  758, 5752, 5544, 2464, 7302, 6319,
       3589, 3316, 6796, 7815, 1055, 6206, 2625, 3986, 2762, 2578, 1390,
       7488, 3976, 4866, 8113, 2574, 6092, 6667, 2682, 5665, 1982, 4978,
       6577,  251, 3435, 1360, 4708, 7939, 4464, 5905, 5196, 7120, 3573,
       6234, 7469, 7722, 6702, 7106, 3838,  431, 5071, 2349, 4133, 1319,
       7265, 1914, 7427, 1714, 7616, 3402, 4801, 5624, 1854, 2163,  905,
       7975, 2660,  832, 6469, 3486, 3879, 1295, 3797, 8006, 8079, 5446,
        212, 1658, 6870, 3352, 7472, 5253, 1142, 5994, 4818, 2592, 3262,
       1882, 5445, 2413, 1163, 2491, 2527, 2091, 7654, 7203, 1069,  108,
       6487, 3795,  442,  825, 2068, 2065, 2542, 3877, 7715, 3595, 7029,
       6666, 6952, 5443, 5376, 4761, 2656, 4292, 2187, 4762, 1573, 4446,
        845, 7612, 7786, 5465, 6212, 1093, 5514, 2472, 2346, 6556, 2773,
       1890, 6369, 2200, 6036, 7563, 5297, 2263, 5987, 5732, 1649, 2689,
       2321,   85, 3854, 2181, 6082, 1228, 7113, 1402, 2933, 5605, 1316,
       4033, 6080, 2541, 2954, 2499, 6207, 2556,  371, 3505, 4480, 3975,
       2591, 6124, 5170, 6667, 4509, 2185, 2209, 3762, 6905, 3155, 2081,
       4805, 1704, 5680, 1104, 3831, 5160, 7139, 3996, 2373, 5929, 6221,
       2952, 7008, 1085, 1830, 2730, 7793,  772, 4666, 7551, 3204,  781,
       5576, 5091, 8129, 2310, 2234, 3204, 3767,  970, 7037, 2618, 5259,
       1313, 3818,    0, 6070, 6298,  469, 5165, 3106, 5058, 4353, 4397,
       3943, 4615, 7539, 3323, 1410, 5954, 2059, 5326, 2534, 3474, 5738,
       8147, 5061, 7475, 5184, 6852, 4121, 4848, 7615, 7168, 2487, 1133,
       5097, 6406, 7913, 4768, 5749,   23, 5681,  700, 8061, 6649,  138,
       7993, 1572, 4284, 2738, 8069, 7984, 7858, 1295, 4301, 1662, 7507,
       7129, 2998, 3833, 5190, 1621, 4160, 7982, 3396, 3155, 4119, 5491,
       6366, 6760, 2358, 5536, 2796, 2804, 2140, 1500, 4416, 4407, 7703,
       3296, 2648, 3962, 6270,  774, 6783, 3323, 7789, 7465,  923, 8125,
       4655, 2502, 7909, 2837, 2100, 3679, 2874, 4937, 7721, 2579, 7600,
        421, 2517,   85, 5635, 1322, 4404, 1640, 6742, 3854, 2687,  188,
       3329, 7005, 5613, 2839, 1974, 1054, 7902, 1014, 3054, 4321, 1796,
       3487, 5330, 6634, 6172,  744, 7339, 7804, 5476, 2901, 1697, 6401,
       3497,  376, 1327, 7716, 3110, 3642, 7751, 7236, 4159, 6366, 2795,
       8171, 7857, 2317, 4068, 3859,  114, 1609, 6508, 5380, 5997, 1162,
       6226, 1042, 8077, 4689, 7434, 3896, 5251, 7610, 3197, 1475, 3140,
       1549, 4000, 5638, 1678, 7427,  257, 3981, 1508, 2232, 7639, 7601,
       4575,  880, 3310, 5606, 5999, 7404, 4288, 5039, 1635, 1313, 6583,
       3270, 7812,   69, 5476, 7931, 5028, 4090, 6068, 6454, 6567, 6996,
        310, 3168, 5532, 7430, 3237,  560, 3496, 3670, 4608, 4505, 3656,
       2026, 1188, 5594,  847, 1041, 6561, 2395, 7414, 5938,  547, 2877,
        657, 7022, 6890, 5585, 6022, 3569, 6198, 2852, 3485, 4219, 7085,
       3854, 3119, 5147,  248, 6148, 3062, 4016, 4786, 5596, 3492, 7656,
       1942, 8126, 2523, 3055, 7583, 8149, 2974, 5663, 4071, 2268, 2346,
       2191, 7514, 7934, 6548, 4149, 4053, 7147, 6438, 3126, 1476,  832,
       7975, 1543, 1738, 1333, 7320, 7381,  574, 6564, 5006, 3292,  652,
       4332, 1489, 5574, 1833, 7875, 1511, 6199,  997, 6355, 6692, 8126,
       4638, 4806, 6873, 4932, 2915, 2570, 1365, 4635,  778, 2162, 2109,
       3260, 2700, 7933, 3807, 8178,  220, 7406, 4779, 3482, 2761, 8074,
       1085,  184, 3009, 1732, 5875, 4690,  467, 2216, 6994, 3426, 7967,
       7908, 3135, 6833, 6090, 7409,  521, 1087, 6961, 6044, 6973, 6848,
       7018, 4156, 5636, 1309, 4752, 3836, 5422, 5979, 2252, 3147,  849,
       1253, 2120, 3531,  500, 3467, 2083, 5592, 4962, 3014,  829, 5771,
        563, 1319, 6954, 4181, 1924, 4880, 2174, 1767, 2383, 6670, 6926,
       6722, 4019, 1354, 4934,  841, 5292, 2283,  278, 5508, 3704, 7706,
       3364, 7980, 6200, 2464, 7082, 1678, 3172,  791, 4816, 3722, 4004,
       7155,  567,  512, 7068, 1322, 2613, 7806,  878, 1468, 4235,  484,
       1707,   58, 4825, 6478, 4179, 3247, 1707, 5067, 7057, 4144, 4689,
       3407, 7557, 2381, 5867, 5898, 2413, 7609,  275, 4736, 4474, 1390,
       1669, 4841, 7057, 4765, 6619, 6409, 7768, 4705, 1347, 4799, 2694,
       5529, 5658, 7897, 3704, 2728, 6239, 3756, 1390,  999, 2081, 7498,
       2276, 3939, 4486, 4010, 3643, 6725, 1811, 3127, 4506, 3283, 5933,
         29, 3557, 8153, 4245, 7716, 3252, 4202, 7080, 1944, 7449, 6223,
       3708, 1954,  525, 1637, 4952, 2165, 6841, 1796, 2187, 5481, 5967,
       1956, 7222, 6202, 5530, 1354,  493, 8028, 7023, 2095, 6930, 4706,
        550, 1734, 3346, 7080, 5637, 1633, 5555, 1088, 5173, 7470, 3699,
       3281, 7220, 3829, 4554, 6512, 7920, 4111, 7355, 5380, 7429, 6388,
       2215, 2418, 1544, 3979, 4635], dtype=int16)
%onnx::Mul_1, shape: [1, 1, 1, 31], exponents: [-13], 
value: array([ 965, 4894, 4120,   49, 7453, 7594,  545, 2952, 1414, 8160, 5949,
       3071, 3349, 3895, 6972, 1902,  366, 6598, 5642, 3157, 1415, 3137,
       1687,  358, 3463, 8186, 4986, 1961, 6672, 1498, 4525], dtype=int16)


test outputs value:
%2, shape: [1, 5, 5, 31], exponents: [-13], 
value: array([ 312, 4296, 4092,   48,  240, 5068,   54, 2610, 1346, 2329, 4988,
       1048, 2021,  971,  736, 1891,  333, 3612, 3803,  510, 1312, 1146,
        407,  303, 2096, 4604, 2044,  323, 2447, 1234,  611,  709, 3842,
       2256,    2, 4623, 6864,   70, 1246, 1001, 4884,  471, 1935, 2629,
       2097, 3575,  668,    9, 3649,  759, 2851, 1054, 2867, 1416,   37,
       3357, 2590, 3516,  441, 4763,  139, 3177,  653, 1472, 3672,   38,
       3265, 3074,  452, 2816,  182, 6182, 1906, 1494, 1129, 1226, 1183,
       1739,  178, 3919, 5588,  992, 1052, 2553,  552,  248,  838, 4974,
       4003,   60, 2798,  249, 2601,  935, 2667, 2970,   31, 6478, 3312,
        415, 2691, 1333, 6676, 5160, 1439,  176, 2411, 1999,  960,   59,
       5851, 1318, 2862,  296, 2916,  701,  210, 2377, 1853, 1316,  217,
       6495,  486,  460,  762, 2083, 1951,    8, 3454, 7422,  537, 1962,
         37, 1652, 4989, 1257, 3055, 2498,  972, 1392,  215, 2088, 2247,
        725,  941,  924,  239,  109, 1068, 2089, 4659, 1724,  871,   20,
       3583,  447,  264,  415,   12, 1879, 2356,  258, 2780,  621, 7002,
       4841, 2606, 2225, 2556, 4052,  617,  192, 1761, 3280,  606,  768,
        324, 1568,  340, 2310, 6207,  665, 1320, 2013,  429, 3621,  327,
       1129, 3203,   13, 5491, 7011,  352,  815, 1033, 5710, 1197, 1008,
        949,   40, 3280,  506,  272,  989, 4899,  540,  507, 2146,  271,
        176, 2570, 2539, 1798,  598, 5055,  467,  205,  413, 2676, 1999,
         15, 5572, 4793,  444, 1625,  377, 2200, 2732, 2589, 1290,  989,
       4089,  396,  254,  889, 2638, 1989, 1233, 1530,  489,  259, 2630,
       2950, 4265,  260, 1490,  499, 4305,   91, 2788, 3798,   19,  711,
       5169,  339, 2929,  399, 2225, 2327, 1412,  397, 3346, 2228, 1221,
         59, 3075,    0, 2339, 1088,  180, 1064,  136, 2138, 4350, 2676,
        944, 3759, 1379, 1836,  166, 3557, 1036,   32, 2305, 3220,  382,
       2936,  874, 7446, 3765, 2569, 1685, 2305, 6481, 1664,  111,  913,
       3510, 2469, 1367, 1826, 1184,    1, 2402,  699, 4906, 1592,  112,
       1462,  868,  505, 1636, 4058,   48, 7149, 1200,  286,  599, 1296,
       7101, 2177, 1437, 2122,  771, 3540, 1853,  152, 2541, 2837, 2116,
       1100, 2589,  486,  242, 1182, 2802, 1302,  359, 3597,  806, 4255,
        388, 1582, 1993,   38,  704, 6288,  221, 2807, 1289,  919, 5900,
       1745, 1023, 3760, 2414,  488,  164, 2315, 3400, 2975,  445, 2910,
         87,  110,   36, 5631,  805, 1054, 1336, 1233, 2129,  317,  112,
       1674,   42, 5107, 2632,  131,  380, 1364, 1010, 2218, 1620,  734,
       1658, 4536, 1540,  276,  599, 5055, 3007,  946, 1111,  349,  280,
       1478,  376,  808, 1847, 2533,  666, 4281,  852, 2485, 3202,   17,
       7434, 7283,  154, 1466,  666,  114, 1168, 2440, 2199, 2851,  989,
       1446,   47, 6505, 3229, 2865,  673, 2011, 1567,  140,  624, 3138,
        943,  958, 4592,  307, 4102,   30, 2378,  758,   13, 6950, 7046,
        304,  317,  571, 5584, 4356, 2776, 1753, 2396, 1392,  305,  294,
       2634, 5380,   27,  946, 3037, 1035,  179, 2565, 6449, 3997, 1675,
        252,  579, 3056,  875, 1934,  282,   21, 3339, 4272,  300, 1317,
        350, 1183, 4062,  318,  426, 3120, 2038, 1721,  265,  441, 1981,
        253, 1213, 2638, 1150,  263, 1509, 6193, 1736,  834, 3436, 1296,
       2129,  367, 3075,  125,   37, 2786, 3723,  318, 2017,  603, 7626,
       1410, 3046, 1031, 1453, 6454, 1892,  133, 4561, 2804,  874,  405,
        839, 1547,  347, 2768, 4146, 2467, 1711, 5243,  572,  815,   98,
       4764,  776,   10, 1213, 6786,  491,  207, 1133, 4986, 2391,  244,
       1771,  708, 4744,  426,  352, 1217, 4269,  384, 1098, 2563, 1673,
        203, 2032, 6868, 3002,  698, 2093,  250, 2560,   92, 1292, 1061,
         19, 2456, 7354,  253, 2947,   38, 7377, 3470, 1305, 1129, 3839,
        923,   43,  134, 1395, 4046, 1807,   81,  849, 1440,  150, 3368,
       7902, 1908, 1636, 4960, 1355,  288,  128, 4159, 3040,   42, 6230,
       6506,  276, 2031,  226, 4733, 2786, 2033, 2444, 1071, 2678,  197,
         56, 1707, 2432,  193,  599,  798, 1152,  217, 1274,  828, 3512,
        135, 1074, 1272, 2309,  227, 2915, 1093,   11, 2168, 6183,  461,
       2422,  694, 1349, 3583,  315, 2163, 1085,  237, 1279,  165, 6207,
       2317, 3075, 1071,  944, 1458,   73, 1341,  790, 2931,  891, 3261,
       1308,  313,   60, 4223,  665,   16, 7102,  814,   98, 1526,   84,
       1700,   42, 1809, 2648, 1987, 2763,  396,  226, 5684, 2854, 1807,
        588, 2894,  490,  256, 2493, 2411, 4631,   66, 3857,  818,  768,
        197, 2892, 3549,   29, 6022, 5941,  517, 1695,  233, 4780, 1956,
       2073, 2313, 3755, 3152,  633,  279, 3025,  957,  385,  359, 2871,
        469,  172, 1896, 4007, 2217, 1610, 1475,  572, 2489,  387, 3544,
         15,   21, 7418, 3935,  513, 1172,  725, 7052, 1412, 2792, 2544,
       1763, 1663,  122,   73, 3988, 1491, 2636,  310,  837, 1129,  261,
        827, 7217, 3775, 1324, 1103,   90, 4434,  827, 1252, 3485,   28,
        500, 1607,  223, 2551,  973, 1627, 4034,  408, 2115, 3552, 3148,
        762,  323, 3084, 3136, 2510, 1368, 1574, 1515,  235, 3140, 6383,
       1348,  579, 1258,  728, 2560], dtype=int16)