graph main_graph (
  %onnx::Mul_1[INT16, 1], exponents: [-15]
  %onnx::Mul_0[INT16, 2x48], exponents: [-14]
) {
  %2 = Mul[quant_type = 'S16'](%onnx::Mul_0, %onnx::Mul_1)
  return %2
}


initializers value:



values info:
%onnx::Mul_1[INT16, 1], exponents: [-15]
%onnx::Mul_0[INT16, 2x48], exponents: [-14]
%2[INT16, 2x48], exponents: [-14]


test inputs value:
%onnx::Mul_0, shape: [2, 48], exponents: [-14], 
value: array([10356,  4382,    55,  7644,  2240,  2647, 13903, 15859,  4691,
        4800, 12497, 12653,  6111,   497,  6676,  8525,  9228, 14093,
          62, 11689,  2821, 15409,  2016,  6381, 13459,  7789, 15909,
       10462, 11471, 13097,  1136,  9175,  2062,  4151,  8010, 12404,
        4117, 13677,  1491,  4735,  5494,  5021,  2588, 11190,  9454,
       14389,  7300,   888,  4735, 11169,  8991, 15865,  8837,  8944,
        3487,  5710, 11548, 14636, 13021, 12332, 11347, 12562,  7375,
        3369,  1983,  9407, 15901, 15698, 12705, 12505, 11208,  3446,
         357,  6537, 12508, 15495,  4631,  8657,  2100,   702,  4421,
        2226,   399, 14006,  8752,   945, 14095,  5611, 10281,  2809,
        3809, 14043, 13775, 13123,  4170,  7300], dtype=int16)
%onnx::Mul_1, shape: [1], exponents: [-15], 
value: array([6382], dtype=int16)


test outputs value:
%2, shape: [2, 48], exponents: [-14], 
value: array([2017,  853,   11, 1489,  436,  516, 2708, 3089,  914,  935, 2434,
       2464, 1190,   97, 1300, 1660, 1797, 2745,   12, 2277,  549, 3001,
        393, 1243, 2621, 1517, 3098, 2038, 2234, 2551,  221, 1787,  402,
        808, 1560, 2416,  802, 2664,  290,  922, 1070,  978,  504, 2179,
       1841, 2802, 1422,  173,  922, 2175, 1751, 3090, 1721, 1742,  679,
       1112, 2249, 2851, 2536, 2402, 2210, 2447, 1436,  656,  386, 1832,
       3097, 3057, 2474, 2436, 2183,  671,   70, 1273, 2436, 3018,  902,
       1686,  409,  137,  861,  434,   78, 2728, 1705,  184, 2745, 1093,
       2002,  547,  742, 2735, 2683, 2556,  812, 1422], dtype=int16)