graph main_graph (
  %onnx::Mul_0[INT16, 1x96x5x5], exponents: [-13]
  %onnx::Mul_1[INT16, 1x96x5x5], exponents: [-13]
) {
  %2 = Mul[quant_type = 'S16'](%onnx::Mul_0, %onnx::Mul_1)
  return %2
}


initializers value:



values info:
%onnx::Mul_0[INT16, 1x96x5x5], exponents: [-13]
%2[INT16, 1x96x5x5], exponents: [-12]
%onnx::Mul_1[INT16, 1x96x5x5], exponents: [-13]


test inputs value:
%onnx::Mul_0, shape: [1, 96, 5, 5], exponents: [-13], 
value: array([3281, 2711, 1440,  735, 1979, 2949, 1443, 1643,  408, 6196, 1943,
       6914, 7734, 5184, 1602, 7648, 5944, 4699, 3459, 5872, 4385,  990,
       5977, 6098, 5441, 8181, 1795, 4665, 2341, 4444, 1711, 8105, 3309,
       6923, 6196, 7172, 2152, 7984, 7678,  686, 2243,  396, 4928, 1907,
       6320, 1863, 2193, 3129, 7611, 8062, 6593, 2287, 3748, 7561, 7072,
       1830, 4412, 7295, 5907,  992, 4880, 1670, 4130, 4023,  343, 1326,
       4101, 6527, 7343, 4761, 2856, 7042, 1942, 6892, 7205, 5134, 5524,
       6286, 4034, 2084, 5699, 6040, 4932, 6076, 6302, 4064, 2828, 7232,
       3247, 7217, 7461, 3518,  688, 3010, 4398, 5542,  379,  842, 4300,
       4390, 3788,  559,  425, 1019, 4615, 5447,  661, 6478, 8061, 7437,
       6886, 8128, 3047, 5725, 4866, 7234, 7540, 1685, 1073, 6493, 3702,
       7357, 6851, 3627, 4419, 4299, 6410,  647, 2844, 3847, 6510, 3672,
       5295, 7698, 2272, 3426, 2085, 6914, 5462,  986, 4823, 2962, 5299,
       7428, 8150, 3029, 7820,  324, 7287, 8077,  985,  308, 3493, 6974,
         97, 1092, 3032, 2654, 1615, 2072, 6982, 6056, 3465,  177, 7153,
       1743,  805, 1522, 6820, 4066, 7191, 5602, 1830, 3017, 6288, 6042,
       3956, 6979,  211, 1245, 2109,  114,  700,   82, 6981, 2133, 5236,
       6387, 5882, 5530, 1751, 6325, 7839, 1260, 4105, 7067, 4252, 8140,
       2220, 6065, 6842,  739, 5340, 7275, 2397, 4904, 3950, 6667, 7959,
       7482, 8035, 2047, 5015, 2324, 5196, 5542, 7208, 1160, 2502, 1341,
       3440, 8107, 5247, 4355, 2081, 7945, 1339, 7578, 6879, 1695, 7264,
       5017, 4146, 1486,  949, 4284, 2613, 6739, 2031, 7683, 6055, 4320,
       7017, 4909, 4170,  504, 3974, 8054, 5403, 5828,  283, 6251, 1187,
       5493, 4854, 6427, 2594, 8102, 7885, 5101, 6399, 4669, 5934, 4708,
       2446, 5506, 6646,   30, 2705, 2972, 3922, 7295,  531, 4158, 2764,
       1636, 5201, 5866, 7235, 6274,  769, 5762, 1631, 2907, 3920, 1279,
       5799, 7622, 5169, 2137, 4169, 3332, 3075, 2109,  894,   88,   34,
       6121, 3678, 7662, 6155, 4078, 3343, 3591, 5226, 2286, 1688, 1699,
       5429, 7511, 7910, 3685, 2951, 5535, 2459, 7735, 5622, 6962, 1478,
       7870,  141, 1829, 7673, 1417, 2938,  580, 5372, 3198, 3737, 6656,
       4333, 3309, 3571, 7716,  586, 1746, 3208, 1228, 2484, 4850, 1697,
       7183, 5348, 5705,  963, 6253,  263, 6852, 5644, 1092, 1502, 8017,
       8129, 3934, 8104, 7526, 1237, 5540, 5326, 7684, 1978,   71, 4000,
       5908, 3910, 4933, 7787, 6656, 2618, 7112, 5673, 1538, 2923, 5656,
       6598, 5462, 7880, 1330, 1875, 3524,  851,  708, 1901, 6877,  337,
       5624, 4335, 1167, 1996, 6057, 5919, 5559, 2070, 1866,  914, 6909,
       5854, 7866, 3068, 2989, 5113, 1981, 3776, 7446, 7183, 2515, 6025,
       2108, 5819, 5079, 6827, 1216, 5929, 1379, 5188, 6037, 6614,  482,
       3497, 3159,  197, 2334, 3582, 8046, 8174, 3299, 3120, 1877, 6908,
       1867, 1094, 5946, 4279, 2449, 2700, 4217, 2331, 5941, 1761, 7270,
        823, 1501, 5814,  617, 3759, 6586, 7817, 5385, 6674, 7766,  618,
       5190, 3937, 7489, 3360, 5300, 4855, 6702, 2429, 6015,  770, 2966,
        101, 7114, 6777, 7998,  850,  738, 6710, 4249, 1595, 7627, 2000,
       6815,  636, 1005, 4756, 3042, 5987,  785, 2940, 7313, 4064, 7381,
       2224, 3561, 1756, 6776, 2305,  171, 3820, 3075, 8150,  827, 8143,
       6148, 7515, 2277, 1405, 5128, 7522,   72, 3609,  860, 6408, 7629,
       2669, 5270, 4728, 2021, 7165,  869, 2152, 7990, 2690, 2720,   43,
       3782, 1998, 2741, 2794, 6904, 8025,  272, 6545, 2158, 5100, 4859,
       4266, 7509, 2493, 6798, 3166, 1845, 1255, 2647, 2165, 6656, 1778,
         22, 3822, 1426,  835, 3223, 1404, 1899, 1944, 6854, 7699, 1952,
       5278, 2672, 5963, 6731, 6282, 2473, 6595, 4037, 4015, 6406, 5855,
       1174, 4291, 8042, 1467, 5916, 5048, 5939, 1206,  894,  746, 5254,
       7553, 4479, 7548, 2695, 7974, 5844, 3465, 1108,  674, 2398, 5598,
       5141, 4593, 5107, 1674, 3646, 2626, 3878, 6889, 3947, 2137, 8190,
       6089, 4335, 5123,  569, 3277, 5454, 1475, 5531, 3447, 1301, 2972,
       3333,  840, 7018, 5063,  846, 3187, 5258, 1416, 1112,  131, 8095,
       1137, 3873, 5698, 4310, 5418,   86, 2097,  116, 5917,  123, 6154,
        737, 1551, 6458,  614, 4846, 7836,  756,  822, 2250, 3654,  410,
       2591, 6382, 6178, 3948, 3270,  651, 2955, 4161,  874, 7016, 8046,
       5330, 5927, 1792, 5850, 3468, 1200, 6017, 5777, 1559, 5962, 1315,
       7325, 3316,  405, 1129, 4866,  468, 5289, 7045, 2815, 3065, 2045,
        424, 8031, 5880, 1087, 1202, 1273, 7912, 1782, 4813, 1424, 1110,
       7493, 5680, 1145, 3361, 7468, 4944, 7099, 4078, 3194, 7079, 6594,
       6408, 3024,  304, 4682, 2481, 6392, 7134, 2195,  477, 5746, 4978,
       8090, 3142,  510, 2669, 6987,  592, 2887,  915, 4314, 5953, 3385,
       4463, 4583, 3199,   42,  170, 1816, 6844, 7644, 8098, 4851, 2479,
       2539, 7060, 1415, 3687,  929, 1441, 3224, 3993,  181, 7593, 3095,
        429,  102, 6400, 7464, 6676, 1337, 3618, 1271, 1531, 3897, 5049,
        816, 4462, 6043, 7816, 4212, 4465, 1076, 5982, 6477, 6516, 1423,
       7132, 2950, 6333, 6589, 2621, 2453, 5492, 3262, 5688,  237, 7882,
        532, 6550, 3317, 5903, 3285, 5856,  511, 1165, 1763, 2277,  792,
       7568, 1794,    2, 4256, 4149, 5231,  965, 1173, 4798, 1396, 2972,
       5782, 2081,  861, 7124, 5139, 4131, 7549, 1969, 3318, 4176,   49,
       3751, 7316, 1802, 7983, 3333, 5543, 5022, 3152, 3388, 1735, 1056,
       6865, 5403, 3177, 5366, 8030, 2181, 6139,  973, 4373, 5401, 6662,
       1835, 7454, 5463,  961, 7671, 4702, 6560, 8155, 7017, 5797, 4311,
       7909, 2407, 1679, 7218, 4364, 5903, 6226,  385, 5064, 6188, 3250,
       5703, 1570, 6387, 3330, 5799, 2513, 1285,  872, 1531, 3904,  297,
       2895, 7633, 5902, 1898, 3272, 1718, 3595, 2495,  895, 1143,  196,
       7624, 4824, 3595, 7163, 2663, 5905, 3573, 2753, 5880, 4432, 7031,
       5486, 2827, 4348, 1265, 5125,  256, 3756, 3896,  627, 3384, 3194,
       1979, 3943, 1020,  686, 6124, 6712, 5711, 1306, 7889, 1603, 1317,
       6294, 6180, 1278, 1158, 8129, 3689, 1642, 6598, 4243, 7898, 3488,
       4118, 8177, 3617, 6507, 4262,  220, 2020, 2458, 7761, 6279, 4839,
       4180, 8167, 4561, 7272, 7602, 1144,  289, 2749, 7196, 7021, 3238,
       3813, 1400, 2801, 4989, 5527, 3831, 1985, 6184, 4895, 5010, 3878,
       4297,  542, 6945, 2638, 4535, 1532, 2367,  621, 8168, 6981, 1145,
       3239,  258, 6720, 3098, 2244, 5125, 5884, 7148, 5259, 3655, 1218,
       4192, 4232, 4698, 7031,  384, 2433, 2178, 3559, 5104, 2965, 3134,
       3536, 6329, 5414,  535, 1893, 5659, 1110, 3723, 3027, 6632, 1303,
       6055, 2411, 3058, 1390, 2479, 2427, 4939, 3635, 3464, 5805, 4621,
       4698, 2379, 3286,  461, 3330, 3881, 4871, 5678, 3398, 3175, 8003,
       5993, 6246, 3708, 6444, 6488, 5007, 4821, 4768, 1298,  315, 7403,
       5467, 5046, 3771, 7816,  920, 4467, 3871, 2893, 5089, 2336, 7884,
       3736, 1470, 4109, 2229, 3801, 2360, 3220, 6323, 3189, 4879, 5828,
       6639, 7970, 2959, 5243, 6302, 5279,  723, 6601, 3806, 4593,  356,
       7451,  735, 6462, 4227, 1472, 8011, 5674, 5751, 3156, 1115, 2354,
       6991, 2929, 6440, 6828, 3113, 3661, 3053, 4488, 4979, 4904, 1633,
       5821, 6775, 4941,  860,  780,  424, 2394, 4994, 4700, 7427, 8159,
       4302, 4774, 2797, 5652, 3098, 6300, 6399, 2386, 3260, 5469, 7031,
       3942, 7462, 5716, 1501, 2250, 7429, 3956, 3926,  589, 6679, 7367,
       3039, 4825, 5978, 7605, 7076, 8008, 7589, 5636, 7579, 5014, 1101,
       2472, 2617, 4083,  398, 4724, 5661, 6216, 6235, 2888,  477,  180,
       1743, 5683, 6230, 1368, 6523, 5189, 3330, 7865,  979, 4063, 2870,
        292, 3641,  564, 3420, 5909, 3424, 4973, 2777,   21, 1423, 4046,
       5191, 4509, 4855, 2150,  867, 3470, 7012, 1021, 6176, 3508, 7098,
       7338, 5411, 7889, 4445, 6921, 2944, 6492, 5492, 3860, 3856, 3939,
       7675, 6517, 6598, 5913,  301, 5833, 3447, 2951, 2960,  623, 1570,
        613, 4901, 5229, 5970, 2801, 4146, 2953, 1344, 1676, 5797, 2913,
       6829, 7649, 1191, 7167,  276, 7314, 3634, 6066,  280,  545, 3492,
       3383, 2573, 3381, 2149, 1708, 1371, 2710,  201, 5625, 1170, 7662,
       4783,  215, 3879, 1859, 7966, 3645, 6179, 5793, 7545, 1692, 3479,
       7889,  594, 4217, 2060, 2576, 3676, 7825, 1487, 4074, 6996, 4106,
       3923, 4525, 3032, 5860, 5485, 1794, 5457,  743, 5690, 1785, 5835,
       6526, 7208, 7970, 6570, 7374,  204, 7160, 5429, 2966,  364, 2610,
       4004, 5075, 4526, 2657,  628, 3486, 3628, 4730,  177, 4017, 5614,
       2198, 4934, 6951, 6622,  497, 7454, 7494, 1904, 1669, 2078, 3653,
       6844, 2045, 5453, 1735, 4477, 8078, 4689, 5020, 2447, 2745, 6021,
       1786, 5374,  297, 2613, 7322, 8069, 2168, 1452,  668, 1081, 2324,
       5975, 7415, 1126, 6423, 4387,  580, 1404,  178, 2048, 1399, 7290,
       6798,  726, 5753, 6588, 6367,  751, 1099, 2596, 7568, 4848, 1577,
        999, 5582, 7910, 4081, 1688,   58, 7968, 7794,  903, 7835,  297,
       3095, 3404, 1808, 3448, 2355, 7414, 8095, 4560, 3936,  985, 5700,
       2648, 1280, 3788, 5601, 3325, 5007, 7447, 2627, 6462, 6713, 6804,
       7729, 6689, 5612, 7435, 3552, 3422, 4494, 5786, 4385, 7447, 1776,
       4887, 7339, 6135, 4323, 7825, 2037, 6159, 6553, 3276, 3901, 3911,
        949, 7898,  459, 7614, 7976, 1780, 4524, 6841, 3732, 6935, 5710,
       2462, 6605, 2180, 2823, 2352, 3756, 3651, 4919, 2316, 7208, 4877,
       4104, 7371, 5178, 2060, 5145, 4736, 1227, 8171, 4184, 4499, 4778,
       1351, 7832, 4181, 4612, 2710, 3259, 6845,  913, 8090, 2056, 8110,
       3942, 1256, 1540, 1524, 8022,   38, 1832,  676, 4096, 6598, 3513,
       4446, 2484, 5122, 1267, 2027, 6355, 7288,  398, 5209, 2897, 4535,
       4363, 5455, 1403, 6519, 4437, 3499, 4423, 1658,  892, 2813,  332,
       7788,  116, 8011, 4660, 6116, 7838, 6749, 1877,  997, 5078,  970,
       6685, 4561, 1479,  277, 4123, 3030, 3612, 6145, 7861, 6591, 4815,
       5866,  210, 4699, 4722, 5391,  580,  492, 6308, 7892, 3060, 7113,
       1400, 3488, 3348, 5026, 2860, 5246, 5889, 7439,  695,  892, 6035,
       7574, 6331, 5374,  486, 7562, 1402, 7318, 2471, 7131, 5464, 4043,
       4111, 4256, 2779, 6414, 7147, 3085, 3233, 7247,  785, 7650, 4925,
       2800, 2411, 7381, 3414, 1348, 6162, 1958, 1702, 4809, 1474, 2681,
       2915, 7706, 1260, 6158, 4636, 3858, 6806, 5106, 5809, 3350, 2666,
       5974, 2450, 4312,  457, 6942, 2246, 5128, 6459, 7466, 5950, 6414,
       2477, 4070, 7201, 7723, 2340,  431, 6254, 6578, 1881, 2446, 5458,
       8095, 5583,  911, 2447,  962, 5122, 4701, 3654, 2356, 5263, 8009,
       3475, 2872, 2149, 5342, 1010, 3628, 4041, 2738, 3036, 3687, 7480,
       6224, 8132, 2541, 3049, 5695,  627, 7613, 4238, 4707, 7369, 2688,
       3686, 7289, 6750, 7788, 3681, 1750, 3729, 6386, 5614,  176, 6975,
       6839,  172,  281, 5839, 3593, 3293, 3400, 6063, 6901, 7828, 7427,
       1117, 7031, 7733, 3549,  632, 1905, 6318, 2801, 5804, 2199, 6952,
       7359, 7442, 6400, 1101, 4066, 1178, 5355, 1073, 3974, 5626, 7579,
       4011, 1089, 3394, 6787, 4617, 1627, 3063, 7910, 1488, 2961, 3799,
       4372, 4999, 4827, 6264, 7093, 7615, 6528, 7904, 1321, 3378, 1710,
        375, 6163, 2338, 5471, 3041, 5911, 5178, 3475, 2705, 5398, 5928,
       2467, 7127,  621,  771, 1317, 6797, 3599, 6650, 1380, 7122, 5788,
       2151, 1788, 1226, 1201, 7828, 5992, 1797,  307, 1409, 6251, 1973,
       5685, 4307, 2559, 7278, 1934, 5564, 7970,  571, 7902, 1279, 2342,
       7566, 2713,  319, 3075, 4271, 7388, 3903, 4604, 7967, 6453,  308,
       5849,  872, 6826, 2617,  211, 7145, 5460, 5082, 2731, 7268, 4415,
       3015, 6240, 4999, 3525, 6813,  625, 5215, 4693, 5493, 1481, 5458,
       2623,  857, 6018, 4521, 7580, 6698,  923, 7878, 5050, 1994, 1965,
        768, 6530, 6125, 2897, 3597, 7910, 1497, 1017,  969,  216, 7709,
       2334, 2861, 5659, 2190, 2563, 3655, 6686, 4747, 7789, 1111, 6418,
       4604,  361, 4199, 6783, 4878, 1766, 5678, 1648, 4477, 6528,  705,
       7774, 4739, 1452, 6917, 4909,  527, 3486,  487,  957, 3883, 7541,
       2055, 3940, 2704, 4001, 5046, 5552, 4448, 1413, 3758, 4737, 2399,
       5451,  485, 5481, 4777, 6277, 3597, 6737, 4304, 7683, 4318, 7575,
       6449, 1840, 4522, 4447, 3851, 1079, 1506, 6748, 5512, 5704, 7662,
       6057,   93, 6238, 5245, 1741, 5232, 7895, 7773, 1588, 3574, 4178,
       3159, 1250, 2119, 6313, 1632, 8136, 3503, 4522, 7788, 2553, 7992,
       6320, 3184, 3862,  369, 4937, 7316,  203, 7558, 2548, 1645, 4455,
       6223, 1165,  885, 5545, 3594, 3474, 3585, 8001, 4277, 8186, 5071,
       4789,  971, 2898, 1272, 1711,  247, 6322, 2488, 1486, 5249, 6474,
       5135, 5161, 5217, 4026, 6572, 4027,   12, 5212, 4709, 4227, 1295,
        120, 1958, 6548, 2034, 1649, 2000, 8180, 5881, 5843, 4873, 1162,
       4726, 5102, 1705, 6549, 5792, 7953, 6919,  279, 5074,  937, 5571,
       4450, 7589, 6448, 7243, 4490, 3988, 2862, 4853, 8028, 3914, 3240,
       7466, 8107, 8094, 6422,  924, 8062, 2382, 2784, 6656,  465,  880,
       5951, 3577, 1741, 5502, 7790, 6535, 4144, 6331, 7541, 6065, 8043,
       7519, 6813, 4010, 6107, 7968,  366, 5783, 4019, 2470,  295,  683,
       7458, 6911, 2639, 2852, 7082, 5530, 3560, 2759, 3294, 5301, 1951,
       6123, 7436, 4031, 3308, 4078, 7063, 5887, 5030, 1949, 2947, 7435,
       2942, 5446,  655, 3847, 4087, 7191, 6788, 3731, 6900, 4330,  918,
        191, 2811, 2752,  803, 3774, 1540, 3224, 7223, 3532, 5194, 1215,
       1569, 1279, 6427, 3774, 3919, 7301, 6503, 7954, 3997, 6634, 2719,
       7793, 2091,   11, 8170, 1821, 1139,  676, 3315, 4479,  209, 7887,
       3141, 6480,  743, 1416,  828, 6493, 4692, 4818,  377, 3674, 7253,
       5841, 6951, 3506,  216, 4358, 6601, 8041, 1184,  570, 3476, 4081,
       2923, 3278, 2875, 6821, 4934, 5646, 5658, 2070, 6173, 6776, 5439,
       7194, 2715, 3772,  337, 3386, 7273, 1887,  697, 7151, 1070, 5174,
       3497, 8067, 1158, 1878, 5662, 5234, 7886, 5568, 2809, 5668, 4584,
       3875, 2334, 1991, 1055, 7906,  588, 3580,  606, 6780, 1033, 5005,
       5272, 4485, 2908, 2492, 6886, 2083, 2079, 7255,  174, 6330, 3165,
       2347, 7696, 5849, 4866, 1045, 5065, 5108, 4968, 6847, 3343,  800,
       5718,  379, 3218, 6664, 8191, 6620, 8104, 3022, 5574, 1889, 5402,
       8182, 2302, 3605, 3947, 2157, 1882, 7377, 6024, 4614,  382, 5797,
       7831, 7112, 2527, 4365, 5557,  605, 6961, 7167, 6581, 1630, 6210,
       8087, 2415, 1061, 1251, 4617, 4754, 5265, 2001,  353, 6917, 2666,
       1544,  366, 8160, 3112,  837, 4076, 5899,  193, 3715,   80, 4990,
       1744, 2014, 7369, 4310,  398, 8011, 3570, 4679, 1385, 1712, 2503,
        415,   41,   13, 7400, 5476, 2572, 2748, 1525, 1606, 7537, 2872,
       3450, 4902,  529, 1593, 6210, 1834, 3398,   40, 4132, 3229, 2005,
       5864, 1803, 1544, 6886, 3025, 6820, 7802, 2233, 7429,   81, 8161,
       8088, 1142, 1448, 4585, 7164, 2368,  392, 7414, 6096, 3545, 1771,
       1857, 3146, 3898, 5737, 3570, 6731, 2346, 7305, 8182, 7107, 1983,
       3791, 4482, 6587, 3684,  938, 2058, 1542,  439, 7853, 4279,  604,
        710, 6397,  315, 7020, 5584, 5616,  808, 1805, 5237, 4728, 8005,
       5538, 2267, 3922, 1915, 2758,  785,  580, 7510,  822,  789, 7392,
       6364, 6545, 7885, 1890, 3145, 5788, 7685, 6417, 3200,  852, 1527,
       1495,  531, 7252, 2986, 2887, 1603, 1029, 1051, 5908, 7428, 8097,
        265, 5709, 5300, 1728, 7330, 3140, 5087,  717, 6112, 2881, 3790,
       1471, 4667, 7247,  975, 4933, 4808, 5507, 5857, 2150,  632, 3122,
       6388,   78, 6135, 5554, 6340, 4395, 6187, 7694, 7826, 5466, 5249,
       5334, 5828,  851, 4820, 4754, 6020, 5141, 3829, 5532, 3300,  521,
       2091, 6995,  225, 1755, 5315, 8067,  588, 1704,  975, 6342, 7182,
       1083, 5988, 3896,  231, 4725, 1904, 5305, 2460, 5967, 6593, 6992,
       2002, 2557, 2272, 7651, 1988, 1431, 2433, 2857, 7207, 4036, 5039,
       3154,  158, 2280, 4674, 5000, 6484, 3913, 3977, 5091,  955, 7242,
       6409, 1778, 1048, 3590, 3571, 5042, 2858, 4968, 2863,  234, 1317,
        395, 4256], dtype=int16)
%onnx::Mul_1, shape: [1, 96, 5, 5], exponents: [-13], 
value: array([5197, 7472, 1658, 6463, 6631, 6556, 3398, 5001, 1467, 6887, 7532,
       7879, 4107, 6756, 4216, 6635, 6799, 5870,  855,  181, 1443,  415,
       2375, 4462, 3336, 3891, 6041, 5312, 4396, 6285, 2010, 2986,  611,
        181, 7944, 5638, 5164, 5917, 2053, 1912, 4091, 6471, 2694,  953,
       1735, 2974, 4571, 2167,  429, 4705,  850, 1887, 3682, 6931, 7875,
       5147, 6336, 8154, 7878, 3523, 6237, 1887, 8133, 2872, 3502, 4163,
       7981, 7298, 1060, 2625, 1587, 4685, 3466, 7573, 8170, 4245, 1989,
       1610,   15, 2056, 6776, 5594, 7023, 1447,  418, 7472, 3856, 2575,
       1657, 6235, 4522, 6713, 4954, 2591, 1052, 2836, 4009, 6377, 1253,
       1880, 7358, 7791, 7213, 1563, 5878, 7690, 3405,  476, 5302, 7479,
       2161, 6131, 1529,  995,  186, 2684, 4763, 1692, 4738, 2579, 4154,
       1403, 2936, 6706, 4309, 4720, 4677, 5718, 7902, 4621, 5854, 5131,
        941, 1927, 4727, 3959, 2466, 3866, 1556, 4993, 7516, 3867,  283,
       7557, 2290, 1330, 8149, 1886, 1779, 2113, 7607, 6832, 6744, 4364,
       1446, 7992, 7696, 3799,  952, 2951, 4972, 7726, 4624, 3969, 2927,
       3585, 1955, 2982, 2622, 2839,  560,   60, 6657, 6432, 1243, 6654,
       8167, 7364,  116, 7596, 5442, 5667, 2202, 7437, 7092, 2554, 5254,
       2078, 1966, 2670, 2869, 3355, 4638, 5752, 4368, 6615, 2194,   65,
        621, 1804, 4569, 1003,  875, 8016, 4133, 7960, 6308, 1565, 2252,
       4860, 3577, 7899, 2274, 2539,  283, 7964, 1561, 3414, 3665, 1140,
       3789, 7873, 1674, 4729, 3934, 6107, 1522, 4907, 4675, 1591, 2193,
       5041,  383, 5493, 3215, 6260, 2305,  768, 7085, 5661,  875, 7233,
       3822,  801, 5842, 4687, 3330, 6078, 4729, 3211, 3350, 2278, 4130,
       7379, 6162, 2231, 3962, 8094, 6886, 6127, 1565, 5210,  747,  706,
        498, 4836, 5902, 1632, 8163, 6879, 3750, 1126, 2044, 5515,  587,
       4035, 7443, 7858, 1781,  266, 4199,    7, 4341, 2680, 3392, 1262,
       4941, 7513, 2638, 7777,  302, 3475, 4204, 4371, 5129,  832, 5795,
       5821, 3262, 5975, 4500, 1143, 2768, 4534, 6153,  672, 7037, 5599,
       4650, 8184, 7614, 6677, 3288, 4408, 7491, 5569,  934,  582, 3568,
        467, 7251, 3607, 1378, 5195, 2663, 8192, 4838, 5258, 4966, 1124,
        148, 6662, 5467, 2648, 5382, 6880,  839,  148, 1673, 4005, 7303,
       8144, 4800,  979, 7479, 1298,  621, 3834, 2711, 4140, 7264, 1736,
       6272, 6297, 1160, 4247, 3840, 3730, 4444,  580, 2414, 1410, 4443,
        854, 7098, 3476, 6800, 1085, 4232, 3632, 2583, 1723,  367, 7039,
       1436, 2909, 7617, 1085, 3392, 7564, 1726, 5008,   61, 3533, 3377,
       2127, 6776, 2696,  772, 4495, 6922, 1771, 1621, 3835, 3650, 7056,
       1548, 7495, 6510, 8008, 1562, 3262, 3239,  526, 1233, 4146, 5013,
       1032, 2883, 6904, 8148,  213, 7554,  471,  162, 3432, 2261,  552,
       7059, 1768,  962, 3321, 5576,  617, 2412, 4332,  787, 3156, 4252,
       3050, 3366, 7038, 2652, 5318,  783,  896, 3098, 3979, 1535, 2888,
       5882, 1674, 2606, 7074, 3496, 5156, 6745, 3650, 5050, 1512, 2299,
        118, 3841,  722,  391, 4285, 3525, 4652,  244, 5902, 1592, 5297,
       3528, 7168, 2037, 2514, 8120, 7211, 3515, 3392, 1073, 7418, 3510,
       5367, 3774, 5604,   46, 1892,  105, 1683, 1262, 7107, 4950, 7662,
        847, 2754, 5215, 4475, 5486, 6230, 1986, 7358, 6278, 5969, 6226,
       5399, 6165, 5783, 6419, 1127, 4867, 8123, 6635,  882, 6529, 1988,
       1403,  252, 6731, 1872, 6892, 3667, 5875, 5334, 2675, 7691, 1297,
       7403, 5953, 1061, 3614, 2233, 4893, 7937, 3223, 7540, 3363, 5863,
       3266, 8009, 7955, 2417, 2740, 3133, 7794, 2664, 1878, 1790, 3961,
       7647, 5162, 7079, 2760, 7560, 2333, 7147, 5530, 3080, 5323, 7323,
       4142, 5372, 1145, 5370, 6675, 1554, 3182,  703, 3238, 5685, 2048,
       5724, 8062, 5578, 7118, 6726, 7791, 7845, 7493,  548, 6496, 1545,
       2647, 4549, 1171, 7340, 6892, 1411, 5068,   28, 2391, 2012, 6140,
       2647, 5711,  654, 6654, 7026, 6459, 5703, 1542, 3492, 7072,  153,
       7777, 5816, 7721,  511, 1255, 1820, 3327, 2939,  315, 5236, 2758,
       1773, 2848, 2624, 3199, 3849, 4381, 3907, 5221, 1714, 3670, 2444,
        522, 7511, 4684, 2789, 5151, 4029, 4972, 5351, 7333, 6968, 4912,
       2733,   73, 6797,  507, 7687, 4290, 3001, 8004, 7733,  969, 6160,
       1605, 7643, 8017, 3547, 6524, 4797, 7896, 6837, 7333, 5013, 1130,
       5712, 8010, 5372, 5048, 2894, 3957, 6127, 7727, 1817, 8100, 5415,
       4194, 1327, 8030,  453, 2728, 5077,  689, 3817,  506, 1729, 7729,
       4729, 3555, 2237, 4257, 6109,   65, 3473, 6318, 6295, 4815, 7814,
        232,  456, 6530, 3913, 1190, 2847,   43, 1783, 3523, 5961, 5390,
       6335, 4580, 3224,  294, 7732,  659, 2486, 6427, 7058, 5817, 1293,
       3779, 6427, 7659, 2786, 6560,  783, 5936, 2663, 1229, 2167, 2793,
       6090, 6893, 5988, 4254, 3648, 2540, 1591, 4289, 4562, 7927,  791,
        884,  155, 6880, 2747, 1774, 3185, 7332, 1189, 1858, 1930,  139,
        651, 3493, 6448, 3510, 4800, 7546, 4672, 1524, 7387, 6788, 5503,
       5621, 2292, 1545,  345,  326, 4677, 3820, 6196, 6449, 3148, 4347,
       7276,  950, 3326, 5252, 7384, 6014, 2959, 3017, 7871, 2099, 7300,
       6780, 6292, 5804,  329, 3412, 3772, 2004, 2670, 7429, 6362,   21,
       2718,  552, 2911,  197, 4190, 4950, 5240, 2743, 6008, 7024, 6333,
       7410, 6597, 5774, 6999, 2014, 7293, 4275,  926, 2204, 4193, 7703,
       2163, 5852, 2604,  277, 4192, 7633, 3108, 4970, 7257, 3007,  370,
       5970, 2574,  581, 1847, 6084, 6712, 6578, 1507, 7798, 6581, 7680,
       7912, 2641, 4761, 5674, 3189, 7582, 6402, 7099, 2574, 4442,  177,
       2273, 4645, 6440,  451,  284, 1147,  597, 5132, 4407, 8078, 5733,
       6528, 2092, 4639, 3741,  757, 2398, 7677, 5985, 2553, 2580, 5891,
       7792, 1695,  869, 7993,  576, 6785, 5074, 6798, 6133, 7689, 1059,
       4638, 7815, 5777, 2354, 2261, 1076, 2537,  182, 5936, 1948, 3318,
       3952, 4574, 4984, 6693, 4071, 1139, 1362, 6064, 6686, 1373, 7494,
       7505, 2472, 5144, 2101, 1866, 5797,  196, 8009,  389, 6319, 6702,
       4334, 6654,  726, 2258, 2796, 2431, 1807, 7699, 5059, 5360, 4104,
       1337, 5553, 2868, 6959, 3367, 8190, 4625, 5879, 7000,  214,  191,
       6365, 1839, 7374, 3170, 4070, 5765, 2778, 1851, 1006, 1234, 6758,
       3803, 4266, 3496, 6981, 7182, 7295, 4223,  571,  284, 2774, 1863,
       4637, 4010, 7790, 2956, 2432, 2739,   94, 7373, 5786, 5785, 7137,
       7565, 3156, 2762, 1175, 1202, 5190, 4240, 7124, 1935, 1928, 7264,
       5214, 4419, 4549, 3007, 4651,   85, 1337, 1533, 7861, 3437, 5184,
       4810, 6365, 2949, 4624, 2010, 6423, 1806, 2668, 7028, 7440, 8074,
        887, 6885, 1625, 1129, 2209, 6971, 2064, 6396, 1529, 3863,  706,
       6851, 5347, 6050, 6697,   18,  336, 2342,  215, 6891, 2031, 3763,
       5055, 4525, 7442, 6747, 3156, 3022, 3129, 4872, 6707,  511, 6419,
       5868, 2136, 7839, 1087, 4708, 4236, 1727, 7454, 4805,  793, 6067,
       6090, 8063, 5098, 7815, 4028, 1207, 1795, 3106, 2501, 2843, 2543,
       4684, 4620,  430, 1445, 5434, 5238, 3200, 6507, 2832, 6463, 7234,
        787, 4190,  577, 3074, 4571, 4584, 1212, 4033, 8023, 3164,  282,
       1604, 2316, 8186, 1284, 7428, 5007, 4344, 3601, 1733, 7034, 7604,
       7134, 3498,  109, 3577, 5044, 1830, 6486, 7372, 6632, 8127, 6401,
       5003, 5182, 7282, 3535,  153, 1502, 1654, 3739, 5636, 2210, 3582,
       2002, 1331,   59, 1891, 6592, 3577, 6221, 1555, 5657, 7691, 7652,
       4330, 5841, 6025, 2438,  882, 5707, 1624, 3829, 6463, 5632, 4965,
       6228, 5285, 5558, 7327, 2627, 5446, 2008, 6475,  153, 5983, 2996,
       5654, 4189, 8061, 5172, 6142, 4785,   69,  385,  220, 4887, 1077,
       1279, 6261,  503, 6399, 4929, 5863, 1141, 7275, 3465, 6993, 2292,
       2912, 5225, 2003, 5123, 4705,  193, 2628, 2128, 1375, 7310, 4855,
        971, 2280, 6109, 1451, 2067,  257, 7320,  987, 7124, 1483, 2180,
       5888, 7307, 3196, 3729, 1700, 4300, 4294, 7557, 3854, 2102, 2739,
       3249, 5894, 4083, 3756, 3031, 2162,  701, 2192, 1200, 5487, 5733,
       1597, 2079, 5342,  821, 7137, 6732, 5903, 7984, 2479, 8103, 6414,
        542, 1084, 1891, 5558, 5162, 5342, 7842, 4494, 3072,  181, 6847,
       1715, 5899, 3720, 4762, 7990, 3666, 2841, 1981, 7441, 2006, 7497,
       4530, 3425, 5103, 5717, 6430, 7484, 2835,  942, 8165, 1110, 1163,
       3425, 3693, 4233, 3591, 4792, 7250, 7471, 5134, 1920,  677, 1603,
       6440, 5764, 1945, 6095,  624, 6055, 4353, 2519, 6693, 6682, 2989,
       2741,  956, 6471, 5969, 3284, 6954, 4336, 5628, 5008, 7580, 4142,
       2583,  360, 6573, 4175,  469,   66, 3754,  157, 1245, 7046, 1736,
       1862,  164, 3757, 3971, 4577, 6658, 5103,  464,  770, 6646, 6917,
       6685, 1023, 5834,  994, 2178, 2665, 2521, 7930, 5208, 6569,  588,
       5554,  974, 1543, 7288, 4281,  168, 7117, 6441, 4709, 7797, 5934,
        843, 4201,  466,  505,  522, 3572,  821, 3666, 4271, 1767, 4709,
       7334, 1005, 5525, 6942, 2482, 1740, 5402, 4115, 7560, 4948,  449,
       7323, 1753,  266, 7538, 6017, 4291, 4912, 4025, 3052, 7319,  465,
       5808, 8012,   19,  410, 4312, 7166, 2795, 2649, 1496, 1948, 1769,
       4533,  577, 7559, 2496, 2210, 4261, 1960, 7572, 7755, 2173, 2143,
       3424,  966, 1661, 1417, 3503, 5870, 8191, 6316, 4850, 6656, 1238,
       4361, 2310, 7882, 7861, 5367, 4285, 5443, 2496, 6192, 6300, 1575,
       4206, 5557,  451, 7471, 1475,  681, 4660, 3054, 4802,  716,  937,
       7700, 6710, 3747, 5896, 7105, 4865, 3021,  585, 2963, 8090, 2496,
       1636,  941, 7260, 7214, 3630, 6551, 5165, 6064, 4128, 5293, 7171,
       1918,  573,  302, 4764, 6483, 2046, 4140, 3836,  207, 3271, 7842,
         90, 2096, 1355, 4713,  608, 3028, 8093, 3494, 7417, 5028,  379,
        225, 2570,  849, 2139, 4535, 5427, 3586, 2114, 3241, 2402, 4423,
       6926, 6923,  610,  448, 2282, 3331, 1032, 2262, 7873, 5966, 6700,
       7634, 7574, 5055, 3963, 1137, 7689, 5192, 3286, 6535, 6537,  974,
       1738,   91, 6067,   93, 2795, 5216, 7683, 2385,  874, 2136, 5189,
       1748,  685, 6087, 3233, 5456, 6622, 4845, 4072, 3941, 5081, 2615,
       2074, 4262, 6203, 2349, 7632, 6932, 1785, 7781, 2978, 3369,  788,
       4056, 6866, 4884, 7322, 5754, 1014, 4100,  862, 7663, 6995,  382,
       1716, 6188, 4585, 6121, 4903, 1335, 6300, 5418, 5414, 2600,  485,
       7925, 1022, 4475, 8175,  963, 5703, 7812,  153, 1450, 6478, 2921,
       6058,   56, 7418, 2863, 1287, 5890,  820, 3117,   77, 1355,  315,
       2909, 5078, 4370, 3609, 4790, 4109, 7812, 2789, 5251, 2412, 4054,
       1777,  612, 5334, 4400, 7427, 1119, 2674, 2708, 4447,  406, 5831,
       1962, 3797, 8024,  695, 2292, 4744,  120, 5045, 5533, 2850, 5481,
       3190, 7424, 3154,  920,  810, 1190, 7790,  964,  724, 6090, 2094,
       3757, 5384, 2306, 5026, 4859, 1863, 5377, 3269, 6769,   25, 3946,
       7392, 4505, 6657, 4179, 1326, 4762,  724, 2878, 6918, 7013, 5402,
       1637,  570, 2483, 3493, 2252, 2156, 3757, 8135, 8087, 3426, 5735,
        299,  127, 6690, 5739, 6984, 7192, 8170,   29, 4995,  769, 4532,
        755, 5483, 4159, 2932, 7609,  446, 6069, 5771, 1087, 4310, 1918,
       4050,  470, 2819, 8005, 2629, 7465, 3372, 7179, 1420, 2741, 4396,
       2345,  507, 7575,  950, 3450, 2288, 6133, 1222,  823, 2595, 7965,
       1475,  506, 1936, 6355, 3463, 4494, 5586, 7434, 2242,  932, 6253,
       8031, 1388,  358,  205, 5935, 1007,  988, 4605, 2480, 1060, 2292,
       3336, 1257, 5027, 5817, 3575, 3750, 4856, 4169, 6176,  352, 5439,
       4268, 3637, 2106, 4824, 3882, 4698, 2635, 2645,  562, 5130, 5214,
       4029,   20,  443, 2251, 3349, 7869, 1014, 4963, 6641, 4418, 3316,
        705, 6959,  642, 7436, 3295,  476,  541, 7871, 7057, 4682,  388,
       8136, 1923, 1498,  644, 6189, 4374, 4671, 7527, 1662, 4278, 3859,
       1717, 7370, 7507, 7264, 6830, 6862, 4471, 3523, 6509, 1925, 5853,
       3412, 7216, 5610, 6750,  507, 6299, 5676, 5183, 2608, 3076,  463,
       5877, 4635, 7035, 8101, 7423, 1448, 7232, 3392,  759, 5884, 5093,
       3324, 7316, 5431, 4434, 1822, 5534, 2505, 3173, 3702, 1157, 6029,
       1758, 4731, 6837, 3092, 4812, 6956, 2037, 2472,  423,  173,   34,
       6730, 8184, 6470, 1669,  392, 1986,  430, 5724, 3284, 7754, 2177,
       1293,  964, 7368, 2322, 1303, 4533,  973, 3749, 1104, 3812, 6316,
       2753, 1147, 6767, 2322, 2149, 2798, 1681, 2062, 2694, 2420, 1572,
       1374, 2519, 7446, 6133, 6601, 5862, 2663, 5526, 3577, 3492, 1450,
       6921, 7111, 4389,  217, 5017, 6038,    8, 1437, 7862, 3648, 5386,
        284, 7624, 6026, 5828, 7789, 8046,  386, 4156,  553, 1755, 3478,
       5484, 6548, 3602, 2268, 4939, 7370, 5442, 3420, 8097,   92, 5758,
       2508, 6039, 3292, 7412,  399, 4018, 1571, 6072,  531, 6299, 7962,
       5386, 6336, 7940, 2942, 2576, 6806, 4931, 5448, 7728, 4400, 5427,
         57, 7273, 3100, 6460,  353, 3872, 2782, 7311, 4283, 3308, 1158,
       4899, 5348, 5137, 8122, 3543,  440, 7181, 5381, 6603, 5247,  487,
       2016, 2908, 4057, 2901, 2497, 3639, 4374, 3277, 1896, 6678, 2055,
       7759, 6005, 6755, 3213,  503, 6134, 6535, 2734, 2956, 1401, 7846,
        172, 3370, 2299, 2395, 5152, 1951, 1844, 7246, 2284, 5898,  818,
       5587, 6029, 6672, 4333, 6358, 1437,  551, 6185,  956, 5484, 2824,
        931, 4088, 5926,  683, 2516, 5170, 4848, 2246, 5757, 7736, 3836,
       2332, 3561, 4055, 4039, 1828, 3465, 2837, 4631, 4284, 4982, 6375,
       3109, 6628, 7548, 4338, 4764, 1059, 3161, 3718, 1882, 5386, 2603,
       5393, 4360,  509, 6320, 5483, 4221, 1130,  508, 2578, 5861, 4589,
       4663, 5181, 6646, 3590, 6265, 1007, 2656, 6705,  396, 5476, 8140,
       2148,  526, 4909,  261, 1235,  168, 1242, 3021,   26, 2553, 4113,
       1430, 6081, 7379, 7418, 7427, 4054, 7371, 7946, 6601, 2718, 2612,
       7636, 3809, 4845, 1683, 1556, 6555,  559, 2762, 2584, 3708, 3716,
       5608, 6057,  452, 5478,  219, 8065, 4320,  750, 6014, 5689, 1459,
       4991, 6108, 4940, 5330, 1383, 6184, 1712, 1309, 3578, 5449, 1772,
       3331,   23, 5998, 4632,  730, 6664, 7076, 1194, 5780, 5252, 1996,
        748, 3318,  653, 6568, 6949, 5153, 3156, 2171, 4312, 4629, 2384,
       4419, 3388, 6942, 2175, 2302, 1884, 7125, 3246, 5521,  245, 6744,
       5832, 5332, 4190,  251, 2842, 3778, 3127, 1973, 3119, 5748, 5536,
        288,  948, 4967, 2229, 6460, 3081, 7864, 4247, 1798, 7431, 4947,
       5135,  934, 5358, 1914, 2926, 7611, 7470, 1784, 3502, 2359, 2706,
       1390, 1236,  496, 7979, 7615, 8059, 4713, 3201,  138, 2340, 3552,
       7068, 6391, 5922, 5876, 5431, 7555, 1173, 2276, 4468, 2200, 6406,
       5106, 4512,  616, 4740, 3237,  556, 5549, 7734, 6203, 6964, 5344,
       8009, 4012, 6726, 6284, 6393, 6406, 6680,  598, 1434, 2426, 4617,
       5676, 4805, 2971, 6386, 1319,   11, 5282, 4876, 3833, 4064, 6670,
        133, 3786, 7210, 7356, 4170, 6582, 1875, 4094, 6058, 2698, 1595,
        754, 1553, 5287, 6282, 2675, 6666, 5394, 7204, 6268, 6272, 5403,
       2826, 1855, 5937, 7021, 4155, 4037,  894, 1962, 6889, 3441, 6512,
       6734, 6560, 4393,  143, 1169, 6412, 4764, 4031, 4523, 1067, 3098,
       2350, 7880,  288, 3424, 5687,  305, 3212, 8097, 7689, 1104, 8155,
        321, 4395, 4924, 4491, 1208, 5013,  580, 8185,  772, 1291,  377,
       5315, 1820,  289, 3250, 6210, 5170,  686, 1077, 5337, 3782, 4555,
       3279, 4785, 6781, 2523, 7737, 4129, 5633, 1438, 6077, 2598, 3799,
       2380, 4065, 1007, 1593, 1566, 2236, 6658, 1250,  415, 1557, 1104,
       4343, 2469, 5321, 8014, 2707, 2716, 7790, 7497, 2240, 4830,  670,
       3576,  314, 2425, 5904, 4580, 7408, 5671, 3274, 3207, 7087, 2432,
        669, 1269, 5695, 7013, 7796, 6725,  533, 3822, 1890,  518,  409,
       1254, 5483,  723, 6817, 5461, 4300,  701, 3197, 1975, 7976,  322,
       3078, 6106, 3363, 7582, 1105, 8090, 2375, 2814, 2341, 2091, 7679,
       6888, 5895, 2570, 5177, 3576, 1816, 1494, 5356, 7664, 4752, 3638,
       6446, 2072, 5999, 1937, 2997,  940, 4308, 4896, 2381, 1210, 4850,
       5938, 4195, 6332, 1682, 2779, 7263, 6721, 1049, 2414, 7098,   88,
       2224,  926], dtype=int16)


test outputs value:
%2, shape: [1, 96, 5, 5], exponents: [-12], 
value: array([1041, 1236,  146,  290,  801, 1180,  299,  502,   37, 2604,  893,
       3325, 1939, 2138,  412, 3097, 2467, 1684,  181,   65,  386,   25,
        866, 1661, 1108, 1943,  662, 1512,  628, 1705,  210, 1477,  123,
         76, 3004, 2468,  678, 2883,  962,   80,  560,  156,  810,  111,
        669,  338,  612,  414,  199, 2315,  342,  263,  842, 3199, 3399,
        575, 1706, 3631, 2840,  213, 1858,  192, 2050,  705,   73,  337,
       1998, 2907,  475,  763,  277, 2014,  411, 3186, 3593, 1330,  671,
        618,    4,  262, 2357, 2062, 2114,  537,  161, 1853,  666, 1137,
        328, 2746, 2059, 1441,  208,  476,  282,  959,   93,  328,  329,
        504, 1701,  266,  187,   97, 1656, 2557,  137,  188, 2609, 3395,
        908, 3042,  284,  348,   55, 1185, 2192,  174,  310, 1022,  939,
        630, 1228, 1485, 1162, 1238, 1830,  226, 1372, 1085, 2326, 1150,
        304,  905,  656,  828,  314, 1631,  519,  300, 2213,  699,   92,
       3426, 1139,  246, 3889,   37,  791, 1042,  457,  128, 1438, 1858,
          9,  533, 1424,  615,   94,  373, 2119, 2856,  978,   43, 1278,
        381,   96,  277, 1091,  705,  246,   21,  744, 1184,  477, 2454,
       1972, 3137,    1,  577,  701,   39,   94,   37, 3022,  333, 1679,
        810,  706,  901,  307, 1295, 2219,  442, 1094, 2853,  569,   32,
         84,  668, 1908,   45,  285, 3559,  605, 2383, 1521,  637, 1094,
       2219, 1754,  987,  696,  360,   90, 2694,  687,  242,  560,   93,
        796, 3896,  536, 1257,  500, 2961,  124, 2270, 1963,  165,  972,
       1544,   97,  498,  186, 1637,  368,  316,  878, 2655,  323, 1907,
       1637,  240, 1487,  144,  808, 2988, 1559, 1142,   58,  869,  299,
       2474, 1826,  875,  627, 4003, 3314, 1908,  611, 1485,  271,  203,
         74, 1625, 2394,    3, 1348, 1248,  898,  501,   66, 1400,   99,
        403, 2363, 2813,  786,  102,  197,    2,  432,  476,  812,   99,
       1749, 3495,  832, 1014,   77,  707,  789,  563,  280,    4,   12,
       2175,  732, 2794, 1691,  284,  565,  994, 1963,   94,  725,  581,
       1541, 3752, 3676, 1502,  592, 1489, 1124, 2629,  320,  247,  322,
        224,   62,  403,  645,  449,  478,  290, 1586, 1026, 1133,  457,
         39, 1345, 1192, 1247,  192,  733,  164,   11,  254, 1186,  756,
       3570, 1567,  341,  440,  495,   10, 1603,  934,  276,  666,  849,
       3112, 1512,  574, 1951,  290, 1261, 1445,  272,  291,    6, 1085,
        308, 1694, 1047, 3232,  441,  676, 1577,  894,  162,   65, 2430,
        578,  970, 3663,   88,  388, 1627,   90,  216,    7, 1483,   69,
        730, 1793,  192,   94, 1662, 2501,  601,  205,  437,  204, 2975,
        553, 3598, 1219, 1461,  487,  394,  746,  239,  541,  636, 1843,
        133, 1024, 2140, 3395,   16, 2734,   40,   51, 1265,  913,   16,
       1507,  341,   12,  473, 1219,  303, 1203,  872,  150,  362, 1793,
        348,  225, 2554,  693,  795,  129,  231,  441, 1443,  165, 1281,
        295,  153,  925,  266,  802, 2073, 3218, 1200, 2057,  717,   87,
         37,  923,  330,   80, 1386, 1045, 1903,   36, 2167,   75,  959,
         22, 3112,  843, 1227,  421,  325, 1440,  880,  104, 3453,  428,
       2232,  147,  344,   13,  351,   38,   81,  226, 3172, 1228, 3452,
        115,  599,  559, 1851,  772,   65,  463, 1381, 3123,  301, 3094,
       2026, 2828,  804,  550,  353, 2234,   36, 1462,   46, 2554,  926,
        229,   81, 1942,  231, 3014,  194,  772, 2601,  439, 1277,    3,
       1709,  726,  178,  616,  941, 2397,  132, 1288,  993, 1047, 1739,
        850, 3671, 1210, 1003,  529,  353,  597,  430,  248,  727,  430,
         10, 1204,  616,  141, 1487,  200,  828,  656, 1288, 2501,  872,
       1334,  876,  417, 2206, 2559,  235, 1281,  173,  793, 2223,  732,
        410, 2111, 2738,  637, 2429, 2400, 2844,  552,   30,  296,  495,
       1220, 1244,  539, 1207, 3354,  503, 1072,    2,   98,  294, 2098,
        831, 1601,  204,  680, 1564, 1035, 1350,  648,  841,  922,   76,
       2890, 1539, 2414,   18,  251,  606,  300,  992,   66,  416,  500,
        361,  146, 1124,  989,  199,  852, 1254,  451,  116,   29, 1208,
         36, 1776, 1629,  734, 1703,   21,  636,   38, 2648,   52, 1845,
        123,    7, 2679,   19, 2274, 2052,  138,  402, 1062,  216,  154,
        254, 2977, 3023,  855, 1302,  191, 1424, 1736,  391, 2147,  555,
       1858, 2898,  588, 1802,  613,  290, 2250, 2725,  173, 2948,  435,
       1875,  269,  198,   31,  810,  145,  222, 1641,   87,  323,  965,
        122, 1743,  803,  282,  448,    5, 1677,  687, 1849,  418,  529,
        106,  158,  456,  803,  542,  859,   19,  444,  687, 2576, 2169,
       2478,  845,   60,   84, 1171,  257, 1082,  861,  205, 2040,  393,
       1866, 1233,  238,  454, 2798,   28, 1046,  149,  324,  787,  577,
       1659, 1928, 1169,   11,   38,  282,  665, 2001, 2255, 2347,  120,
        137,   67,  594,  618,  101,  280, 1443,  290,   21,  894,   26,
         17,   22, 2519, 1599, 1956,  616, 1032,  118,  690, 1615, 1696,
        280,  624,  570,  165,   84, 1275,  251, 2262, 2549, 1252,  378,
       3167,  171, 1286, 2112, 1181,  900,  992,  601, 2733,   30, 3512,
        220, 2515, 1175,  119,  684, 1348,   63,  190,  799,  884,    1,
       1255,   60,    0,   51, 1061, 1580,  309,  196, 1759,  598, 1149,
       2615,  838,  303, 3043,  632, 1839, 1970,  111,  446, 1069,   23,
        495, 2613,  286,  135,  853, 2582,  953,  956, 1501,  318,   24,
       2501,  849,  113,  605, 2982,  893, 2465,   89, 2081, 2169, 3123,
        886, 1202, 1587,  333, 1493, 2176, 2563, 3533, 1102, 1572,   47,
       1097,  682,  660,  199,   76,  413,  227,  121, 1362, 3051, 1137,
       2272,  200, 1808,  760,  268,  368,  602,  319,  239,  615,  107,
       1377,  790,  313,  926,  115,  711, 1113, 1035,  335,  536,   13,
       2158, 2301, 1268, 1029,  367,  388,  553,   31, 2130,  527, 1424,
       1323,  789, 1323,  517, 1273,   18,  312, 1442,  256,  284, 1461,
        907,  595,  320,   88,  697, 2375,   68,  638,  187,  618,  539,
       1665, 2510,   57,  160, 1387,  547,  181, 3100, 1310, 2584,  874,
        336, 2771,  633, 2764,  876,  110,  570,  882, 3316,   82,   56,
       1624,  917, 2053, 1407, 1888,  403,   49,  311,  442,  529, 1336,
        885,  365,  598, 2126, 2423, 1706,  512,  216,   85,  848,  441,
       1216,  133, 3302,  476,  673,  256,   14,  279, 2885, 2465,  499,
       1496,   50, 1133,  222,  165, 1623, 1523, 3108,  621,  430,  540,
       1334, 1141, 1304, 1290,  109,   13,  178,  333, 2449,  622,  992,
       1038, 2459,  974,  151,  232, 2218,  122,  606, 1298, 3012,  642,
        328, 1013,  303,   96,  334, 1033,  622, 1419,  323, 1369,  199,
       1964,  776, 1213,  188,    4,   80,  696,   75, 1429,  394, 1838,
       1849, 1725, 1684, 2654, 1250,  924,  921, 1418,  531,   10, 2900,
       1958,  658, 1804,  519,  264, 1155,  408, 1316, 1492,  113, 2919,
       1389,  723, 1279, 1063,  934,  174,  353, 1199,  487,  847,  905,
       1898, 2247,   78,  462, 2090, 1688,  141, 2622,  658, 1812,  157,
        358,  188,  228,  793,  411, 2241,  420, 1416, 1545,  215,   41,
        684,  414, 3218,  535, 1411, 1119,  809,  986,  527, 2105,  758,
       2535, 1446,   33,  188,  240,   47,  948, 2247, 1902, 3684, 3188,
       1314, 1510, 1243, 1219,   29,  578,  646,  545, 1121,  738, 1537,
        482,  606,   21,  173,  905, 1622, 1502,  373,  203, 3135, 3441,
        803, 1720, 2198, 1132,  381, 2789,  752, 1317, 2990, 1724,  334,
        940,  844, 1385,  178,  757, 1882,  762, 2464,   27,  174,   33,
        601, 1453, 3065,  432, 2445, 1515,   14,  185,   13, 1212,  189,
         23, 1391,   17, 1336, 1778, 1225,  346, 1233,    4,  607,  566,
        923, 1438,  594,  672,  249,   41, 1125,  133,  518, 1565, 2103,
        435,  753, 2942,  394,  873,   46, 2900,  331, 1678,  349,  524,
       2758, 2906, 1287, 1346,   31, 1531,  903, 1361,  696,   80,  262,
        122, 1763, 1303, 1369,  518,  547,  126,  180,  123, 1941, 1019,
        666,  971,  388,  359,  120, 3005, 1309, 2956,   42,  270, 1367,
        112,  170,  390,  729,  538,  447, 1297,   55, 1055,   13, 3202,
        501,   77,  881,  540, 3885,  816, 1071,  700, 3427,  207, 1592,
       2181,  124, 1313,  719, 1011, 1679, 1354,   85, 2030,  474,  291,
        820, 1020,  783, 1284, 1604,  794, 2488,  233,  667,   74,  571,
       2565, 2536,  946, 2444,  281,   75, 1902,  835, 1212,  148,  476,
        670,  296, 1788,  968,  126, 1480,  960, 1625,   54, 1858, 1419,
        347,  108, 2789, 1687,   14,   30, 1717,   18,  127,  894,  387,
        778,   20, 1250,  421, 1251, 3283, 1460,  142,  115, 1113, 2542,
        729,  336,  106,  159,  973, 1312,  334,  703,  212,  433,   83,
       2025,  441,  106, 2857, 1146,    6,  610,   70,  589,  666, 2640,
        350,  186,  164,  203,  203,  164,   55,  581, 1973,  523,  453,
        447,  342, 2667, 1729,  256,    6, 2627, 1958,  417, 2366,    8,
       1383,  364,   29, 1586,  865, 1942, 2427, 1120,  733,  440,  162,
        939,  626,    4,  140,  875, 2190, 1270,  425,  590,  798,  735,
       2138,  236, 2589, 1133,  479,  890,  538, 2674, 2076,  988,  232,
       1021,  433,  622,  374, 1673,  730, 3079, 2526,  970, 1585,  296,
        253, 1114,  221, 3653, 2613,  466, 1503, 1042, 1410, 2667,  549,
        632, 2240,   60, 1287,  212,  156, 1038,  917,  679,  315,  279,
       1929, 3019, 1184,  741, 2231, 1406,  226,  292,  757, 2221,  728,
        135,  450, 1853, 2031,  600, 1303, 2158,  338, 2038,  664, 3550,
        461,   44,   28,  443, 3174,    5,  463,  158,   52, 1317, 1681,
         24,  318,  424,  364,   75, 1174, 3600,   85, 2358,  889,  105,
         60,  856,   73,  851, 1228, 1159,  968,  214,  176,  412,   90,
       3292,   49,  298,  127,  852, 1594,  425,  259,  479, 1849,  397,
       3115, 2108,  456,   67,  286, 1422, 1145, 1232, 3135, 2630,  286,
        622,    1, 1740,   27,  920,  185,  231,  918,  421,  399, 2253,
        149,  146, 1244,  992,  952, 2120, 1741, 1849,  167,  277,  963,
        959, 1647, 2035,   70, 3523,  593,  797, 1174, 1296, 1124,  194,
       1018, 1784,  828, 2866, 2510,  191,  809,  381,  367, 3266,  115,
        293,  911, 2066, 1275,  403,  502,  753,  563, 1589,  234,   79,
       1410,  481,  344, 3073,  272, 1343, 3245,   48,  514, 1325,  475,
       2209,    8, 1952,   80,  545,  807,  257, 1229,   35,  492,  123,
        440, 1261, 1921, 1701,  684,  108, 2982, 1120,  603,  360, 1351,
        878,  209,  297,  657,  436,  350,  767,  604,  639,  130, 2850,
        416,  666, 1052,  227,  141, 1050,   30,  843, 1025,  641, 2502,
       1212, 3685,  489,  171,  282,   46, 3620,  249,  208, 2739,  344,
        845, 2395,  950, 2389, 1092,  199, 1224, 1274, 2319,    0, 1680,
       3086,   47,  114, 1489,  291,  957,  150, 1065, 2914, 3351, 2449,
        112,  245, 1172,  757,   87,  251, 1449, 1391, 2865,  460, 2433,
        134,   58, 2613,  386, 1733,  517, 2670,    2, 1212,  264, 2096,
        185,  364,  862, 1215, 2144,   44, 1135, 2786,   99,  779,  445,
       1081,  143,  831, 3061, 1138, 3470, 1344, 3463,  114,  565,  459,
         54,  191, 1081,  317,  640,  825, 1938,  259,  136,  855, 2882,
        222,  220,   73,  299,  278, 1864, 1227, 3017,  189,  405, 2209,
       1054,  151,   27,   15, 2836,  368,  108,   86,  213,  404,  276,
       1158,  330,  785, 2584,  422, 1273, 2362,  145, 2979,   27,  777,
       1971,  602,   41,  905, 1012, 2118,  628,  743,  273, 2021,   98,
       1438,    1,  185,  360,   43, 3432,  338, 1539, 1107, 1960,  894,
        130, 2650,  196, 1600, 1370,   18,  172, 2255, 2366,  423,  129,
       1303,  101,  550,  178, 2863, 1788,  263, 3619,  512,  521,  463,
         80, 2937, 2806, 1284, 1499, 3313,  409,  219,  385,   25, 2754,
        486, 1260, 1938,  902,   79, 1405, 2316, 1502, 1240,  209,  181,
       1651,  102, 1803, 3354, 2210,  156, 2506,  341,  207, 2344,  219,
       1577, 2116,  481, 1872,  546,  178,  533,   94,  216,  274, 2775,
        221, 1138, 1128,  755, 1482, 2357,  553,  213,   97,   50,    5,
       2239,  242, 2164,  487,  150,  436,  177, 1504, 1540, 2044, 1007,
        509,  108, 2034,  630,  306,  299,   89, 1544,  371, 1327, 2954,
       1018,    7, 2576,  743,  228,  894,  810,  978,  261,  528,  401,
        265,  192,  963, 2363,  658, 2911,  569, 1525, 1700,  544,  707,
       2670, 1382, 1035,    5, 1512, 2696,    0,  663, 1223,  366, 1465,
        108,  542,  326, 1972, 1709, 1706,   84, 2030,  144,  877, 1076,
       1603,  388,  637,  176,  516,  111, 2100,  519,  734,   29, 2275,
        786, 1902, 1048, 1821,  160,  988,    1, 1932,  153, 1625,  629,
         39,  757, 3173,  365,  259,  831, 2462, 1956, 2756, 1309,  385,
         16, 2265,  323, 2582,  125, 1880, 1175,  124, 1326,  189,  394,
       1331, 2477, 2022, 3591,  971,  107, 1254, 1594, 3235, 1253,   96,
        919, 1439, 2004, 1137,  141, 1791,  636,  557,  770,  190,  110,
       2818, 1311,  718, 1079,  239, 2447, 1653, 1056, 1361,  519, 3852,
         79, 1401,  563,  893, 2506,   44,  651, 1777,  344,  106,   34,
       2543, 2543, 1075,  754, 2748,  485,  120, 1042,  192, 1774,  336,
        348, 1855, 1458,  138,  626, 2229, 1742,  690,  685, 1391, 1741,
        419, 1184,  162,  948,  456, 1521, 1175, 1055, 1804, 1317,  357,
         36, 1137, 1268,  213, 1097,  100,  622, 1639,  406, 1707,  193,
        516,  340,  200, 1456, 1312, 1881,  449,  247,  629, 2373,  762,
       2218,  661,    4, 1790,  696,   70,  110, 1357,  108,   70, 3918,
        412,  208,  223,   23,   62,   67,  356,  888,    1,  572, 1821,
        510, 2580, 1579,   98, 1976, 1633, 3618,  574,  230,  577,  651,
       1362,  762,  850,  701,  469, 2259,  193,  349,  974, 1534, 1234,
       2462, 1004,  104,  113,   45, 3580,  498,   32, 2625,  372,  461,
       1065, 3007,  349,  611,  478, 1976,  824,  445,  613, 1885,  496,
        788,    3,  729,  298,  352,  239, 1546,   44, 2392,  331,  610,
        241,  908,  116,  999, 2921,  655,  400,  961,   46, 1788,  461,
        633, 1591, 2478,  646,  147,  582, 2221,  984, 2307,   50,  329,
       2035,  123,  823,  102, 1421, 1527, 1547,  364, 1061,  663, 1825,
        144,  133, 1093,  537,  850,  354, 3541, 1562,  506,  173, 1750,
       2454,  405,  826,  510,  992,  281, 3174,  780, 1407,  235, 1026,
        686,  182,   32,  609, 2146, 2338, 1515,  391,    3,  988,  578,
        666,  143, 2949, 1116,  277, 1880,  422,   27, 1013,   11, 1951,
        544,  555,  277, 1247,   79,  272, 1209, 2209,  524,  728,  816,
        203,   10,    5, 2838, 2137, 1006, 1120,   56,  141, 1116,  809,
       1195, 1438,   96,  621,  500,    1, 1095,   12,  967,  801,  816,
         48,  417,  679, 3092,  770, 2740,  893,  558, 2747,   13,  794,
        372,  108,  467, 1758, 1170,  963,  129, 3260, 2332, 1357,  584,
        320,  356, 1413, 2458,  905, 1659,  128,  875, 3440, 1493,  788,
       1558, 1795, 1766,   32,   67,  805,  448,  108, 2168,  279,  114,
        102, 3077,    6, 1467, 1938,  105,  158,  892, 2458,  319, 3984,
        109,  608, 1179,  525,  203,  240,   21, 3752,   39,   62,  170,
       2064,  727,  139,  375, 1192, 1826,  322,  422, 1042,  197,  425,
        299,  155, 3001,  460, 1363,  404,  354,   92, 2191, 1178, 1877,
         38, 1416,  326,  168,  701,  429, 2067,   55,  155,  274,  255,
        390,  703, 2354,  477,  815,  797, 2618, 2680,  294,  186,  128,
       1394,    1,  908, 2001, 1772, 1987, 2142, 1537, 1532, 2364,  779,
        218,  451,  296, 2063, 2262, 2471,  167,  893,  638,  104,   13,
        160, 2341,   10,  730, 1772, 2117,   25,  333,  118, 3087,  141,
        203, 2232,  800,  107,  319,  940,  769,  423,  853,  841, 3277,
        842,  920,  356, 2418,  434,  159,  222,  934, 3371, 1171, 1119,
       1241,   20,  835,  553,  915,  372, 1029, 1188,  740,   71, 2144,
       2323,  455,  405,  369,  606, 2235, 1172,  318,  422,  101,    7,
         54,  241], dtype=int16)