graph main_graph (
  %onnx::Mul_1[INT16, 2x3x4x5], exponents: [-14]
  %onnx::Mul_0[INT16, 1x1x1x5], exponents: [-13]
) {
  %2 = Mul[quant_type = 'S16'](%onnx::Mul_0, %onnx::Mul_1)
  return %2
}


initializers value:



values info:
%onnx::Mul_1[INT16, 2x3x4x5], exponents: [-14]
%onnx::Mul_0[INT16, 1x1x1x5], exponents: [-13]
%2[INT16, 2x3x4x5], exponents: [-13]


test inputs value:
%onnx::Mul_0, shape: [1, 1, 1, 5], exponents: [-13], 
value: array([5979, 7386, 3374, 2463, 1380], dtype=int16)
%onnx::Mul_1, shape: [2, 3, 4, 5], exponents: [-14], 
value: array([ 2321, 13631, 12865,   382, 11514,  7832,  8600, 13108,  2470,
        7502,  9820, 16025, 12675,  8544,   136,  1063,   723, 12104,
        6370, 15780,   852,  5486, 16260, 15981,  7517,  6902,  3517,
        4846, 10804, 11560,  4184,  9288,  1868,   613, 15356, 13215,
        7520,  3585,  9729, 11539,  9030,  1013,  1569,  8364, 11793,
       11498,   514, 12921, 12332, 10242, 13381,  7648, 12669,  8787,
        4249, 16190,  7099,  8999,  1172, 11340,  1831, 14507, 10312,
        7887,  8191, 12494,  3403, 14137,   613, 10537, 10933,  4283,
        3722, 10514, 14340,  4182,  4064,  7389, 13235, 15209,  8471,
        3963,  1394, 12765, 15359, 13293, 12457,  5870,  2661,  5420,
        4676,  5426,  6104,   400,  4086, 15216,  3289,  3561,  6633,
       11808,  9558, 14573,   838,  2652,  1367, 12467, 15623,  2296,
       15380, 14104,  2131, 14461,  7191, 12864,   325,  3742,  5746,
       13303,   472, 15002], dtype=int16)


test outputs value:
%2, shape: [2, 3, 4, 5], exponents: [-13], 
value: array([ 847, 6145, 2649,   57,  970, 2858, 3877, 2699,  371,  632, 3584,
       7224, 2610, 1284,   11,  388,  326, 2493,  958, 1329,  311, 2473,
       3348, 2402,  633, 2519, 1585,  998, 1624,  974, 1527, 4187,  385,
         92, 1293, 4823, 3390,  738, 1463,  972, 3295,  457,  323, 1257,
        993, 4196,  232, 2661, 1854,  863, 4883, 3448, 2609, 1321,  358,
       5908, 3200, 1853,  176,  955,  668, 6540, 2124, 1186,  690, 4559,
       1534, 2911,   92,  888, 3990, 1931,  766, 1581, 1208, 1526, 1832,
       1522, 1990, 1281, 3091, 1787,  287, 1919, 1294, 4851, 5616, 1209,
        400,  457, 1706, 2446, 1257,   60,  344, 5553, 1483,  733,  997,
        995, 3488, 6570,  173,  399,  115, 4550, 7043,  473, 2312, 1188,
        778, 6519, 1481, 1934,   27, 1366, 2590, 2740,   71, 1264],
      dtype=int16)