graph main_graph (
  %onnx::Mul_0[INT16, 10x1x5x5], exponents: [-14]
  %onnx::Mul_1[INT16, 1x1x5x5], exponents: [-14]
) {
  %2 = Mul[quant_type = 'S16'](%onnx::Mul_0, %onnx::Mul_1)
  return %2
}


initializers value:



values info:
%onnx::Mul_0[INT16, 10x1x5x5], exponents: [-14]
%2[INT16, 10x1x5x5], exponents: [-13]
%onnx::Mul_1[INT16, 1x1x5x5], exponents: [-14]


test inputs value:
%onnx::Mul_0, shape: [10, 1, 5, 5], exponents: [-14], 
value: array([16328,  6060, 13829,  1834, 12077, 10016,  7749,  6780, 14670,
        2033,  8303,  3872,  4087, 12187, 13403,  3898, 12758,  9261,
         114, 10221,  2118, 13300,  6201,  9995, 10645,  6424,  5888,
        6302,  7653,  9912,  3208,  4311,  3982,   903, 15423, 10037,
         955,  6128, 16303,  8466,  6143,  4740,  8822,  6726, 16082,
        2519, 11479, 14547,  1776,  2655,  1010,  4811, 16089, 12287,
        8357, 12139, 13577,  1229,   158,  8881,  1373,  2806,  4473,
       11499, 11953, 14799, 14651, 16155, 16234,  6842,  9255,  3999,
       16366,  3100, 13696,  5046,  4801,  4351,  2128,  6697,  8046,
        3959, 12456,  3900,  5020,  7962,  3156, 12929,  2271,  5726,
        8849, 11523, 15448, 15307, 14900,  7127, 16063,  6809,  8626,
        2981, 13434, 14074,  8488, 10147,  5779, 11939,  1178, 13309,
        5588,  3049,   300,  9923,    21, 15359,  3144,  7433, 10506,
       15724,  3885,  1871,  2910, 15658, 11992,  4271,  1338,  2609,
       12909, 16379,  6675,  4788, 11616, 14237,  5885, 15988,  9217,
        5972,  6149,  1338, 10347, 14356, 12599, 13473,  8858,  1161,
        9647, 15275,  8500,  3285,  4681, 16134,  5867,  7116,  7856,
        4774,  9286, 13918,  1954, 14235, 14220,  6393, 14181,  7077,
        3394,  2580, 13331, 14083,  2577, 11493, 15788, 11076,  4427,
       11464, 15070, 12048, 12870,  6430, 15587,  7331,  2181, 10836,
       11970,  9492,  9088,  4073, 14150, 13447, 10377, 14390,  6552,
       13286,  9765, 15662, 11381,  4956, 15132, 12896,  9530,  5718,
        6471,  7652, 13417, 10839,   986, 12942,  1385,  5802, 15789,
        2639,  5181, 11068,  7477,  3444,  8962,  8463,  4912,   267,
       16048,  6875,  1248,  5908,  7069,  7794, 11899, 10831,  3425,
       15395,  8222, 14736, 11465,  1830,   228,  1768,  7904,  2351,
        3456, 15652,  2842,  7292,  5217,  1360,  8152,  8786,  1565,
        7964,  3757,  8113, 15127,  3696,  9797, 13442], dtype=int16)
%onnx::Mul_1, shape: [1, 1, 5, 5], exponents: [-14], 
value: array([ 6685, 14017,  8412,  2927,  1164, 16238, 10617, 12884,  1550,
        6655, 11571,  4856,  1924,  6932,   814,  5540,  1770,  6284,
          79,  6202,  6762,  9129,  9045, 15314,  7071], dtype=int16)


test outputs value:
%2, shape: [10, 1, 5, 5], exponents: [-13], 
value: array([3331, 2592, 3550,  164,  429, 4963, 2511, 2666,  694,  413, 2932,
        574,  240, 2578,  333,  659,  689, 1776,    0, 1935,  437, 3705,
       1712, 4671, 2297, 1311, 2519, 1618,  684,  352, 1590, 1397, 1566,
         43, 3132, 3544,  142,  360, 3449,  210, 1039,  256, 1692,   16,
       3044,  520, 3198, 4015,  830,  573,  206, 2058, 4130, 1098,  297,
       6015, 4399,  483,    7, 1804,  485,  416,  263, 2433,  297, 2502,
        791, 3098,   39, 1295, 1910, 1114, 4518, 1449, 2955, 1029, 2054,
       1117,  190,  238, 3987, 1283, 4898,  184, 1020, 2812,  468,  759,
        480,  142, 1496,  622, 2963,   37, 2820, 1471, 4475, 1879, 4031,
        643, 2741, 6020, 2179,  906,  205, 5916,  382, 5233,  264,  619,
        106, 1471,    1, 3249,   78, 1257,  567, 3015,    9,  354,  601,
       4362, 3310, 1996,  289,  532, 5522, 4205,  596,  170, 5756, 4613,
       2314,  756, 1872, 2109,  911,   79, 2189,  357, 2130,  728, 1699,
          3, 1826, 3152, 2368,  907, 2188, 3482, 1197, 3044, 2017,  426,
        330, 6897,  633, 5597,  673, 1298, 5008, 1049,  199,  546,  331,
       2381,  139, 2204,   38, 2096,  914, 3194, 4160, 5631, 2777, 1312,
       6668, 1882,  195,  385, 5932, 3075, 3573,  193, 2874, 4748, 1538,
        845, 1386,  330, 1651,  846, 2183,   12, 2864, 2661, 2655, 1578,
       3024, 1651, 2737, 4637,  253, 1156,   49, 2875, 5116, 1038,  245,
       2248, 2640,  510,  526, 1790,  122,   45,  867, 1318,    3, 1118,
       1459, 2171, 3284, 5062,  739, 3141, 3517, 3783, 1024,   65,  113,
        573, 3108,  111,  702, 5527,  421,  428, 1104,   34, 1378,  475,
        300,   19,  711, 1674, 4214, 1020, 4579, 2901], dtype=int16)