graph main_graph (
  %onnx::Mul_1[INT16, 1x1x5x5], exponents: [-14]
  %onnx::Mul_0[INT16, 10x1x5x5], exponents: [-14]
) {
  %2 = Mul[quant_type = 'S16'](%onnx::Mul_0, %onnx::Mul_1)
  return %2
}


initializers value:



values info:
%onnx::Mul_1[INT16, 1x1x5x5], exponents: [-14]
%onnx::Mul_0[INT16, 10x1x5x5], exponents: [-14]
%2[INT16, 10x1x5x5], exponents: [-14]


test inputs value:
%onnx::Mul_0, shape: [10, 1, 5, 5], exponents: [-14], 
value: array([11683,   997,  3288, 16096, 13654, 12802,  9786, 14275,  7182,
        4584,  4128, 14849, 11138,  4052, 12656, 10789,  7887, 13152,
        5574, 14825,  4141,  5795,  9117, 15194,  2798,  7176, 10991,
        2459,  2100, 10306,  8469,  9927, 13947,   825,  9617,  5631,
         110, 15980,  8447, 12069,  4365,  1537,  1369,  2630,  9120,
        3340, 13901,  5804,  6737,  8837, 11312, 11009, 11556,  3063,
        4439, 15411,  6341, 14667,  2606,  9810,  4089, 12881,  1456,
        2754, 16190,  6897, 13927,   242, 15526, 14019, 12643, 14844,
        7874,  7235,  1527, 14049,   759, 13523,  9527,  5142,   920,
        9897, 12298, 11049,  5055, 11236,  5628, 13085,  1321,  9775,
        1714,  4638,  8613, 13605, 15627,  6327,  4728,  7460, 14979,
       15458,  6889, 13377, 11452, 14906,  6378,   558,  4247, 15635,
        4683,  9727,   865, 11555, 12464, 10236,  2623, 12548, 14137,
       11572,  6496, 11776, 11257,  3866, 12617, 15753,  4461,  4669,
        5336, 15573, 11008,  5811,  6313, 16187,  1616, 13541, 13560,
       16205,  1678, 15281,  2218,  6156,  1834,  9845, 14696,  4024,
        4326, 10298,  3079,  8142, 15653, 12440, 14753, 14711,  9178,
        6282,   165,  2704,  1964,  1738,  1600,  9906, 14117, 13285,
         302,  6818, 11695, 16086,  6195,  7970,  8839,  5529, 10591,
       10005, 10037,  5500,  9797, 10765, 11541, 14265, 12982,  9230,
        3843,  7592,  2027, 15366,  2173,  3094, 12164,  2738, 12108,
        2134,  7654, 15035,  4119,    24, 12452,  8281,  1451,  5825,
        6632, 10520, 13374, 13114,  5695,  3387,  2348, 11595,  8207,
        7155,  6589,  3990,  5715,  1273, 14410,  4935,  4955, 12485,
       13310,  1578, 14604, 13843,  5445,  5011,  3933,  5508,  5128,
       16030, 11730,  4580,  7795,  3542, 14849,  2150,  6979, 10683,
       13721, 14313, 10701, 14485,  9087, 13257, 12606,  7943,  5192,
        1031,  2515, 11614, 11606,  8484, 12158,  1028], dtype=int16)
%onnx::Mul_1, shape: [1, 1, 5, 5], exponents: [-14], 
value: array([ 8080,  7137, 13263,  6129,  1476, 11993,  3032, 10738,  9241,
        4970,  2697,  2865,  3746, 13938, 14860, 15898, 16192,  4726,
       14335,  5922,  4883, 15696, 10379,  1208, 15478], dtype=int16)


test outputs value:
%2, shape: [10, 1, 5, 5], exponents: [-14], 
value: array([ 5762,   434,  2662,  6021,  1230,  9371,  1811,  9356,  4051,
        1391,   680,  2597,  2547,  3447, 11479, 10469,  7795,  3794,
        4877,  5358,  1234,  5552,  5775,  1120,  2643,  3539,  4788,
        1991,   786,   928,  6199,  1837,  9141,   465,  2917,   927,
          19,  3654,  7186, 10946,  4236,  1519,   395,  2301,  3296,
         995, 13317,  3677,   497,  8348,  5579,  4796,  9355,  1146,
         400, 11281,  1173,  9613,  1470,  2976,   673,  2252,   333,
        2343, 14684,  6692, 13764,    70, 13584,  5067,  3768, 14221,
        4988,   533,  1443,  6928,   331, 10947,  3564,   463,   673,
        1832,  8060,  6232,  1533,  1850,   984,  2992,  1124,  8866,
        1663,  4584,  2484, 11904,  5648,  1886,  4529,  4726,  1104,
       14603,  3397,  5827,  9271,  5576,   575,   408,   786, 10247,
        2641,  2951,   142,  2021,  2850,  8708,  2379, 12176, 13971,
        3338,  5684,  4256,  3355,  3704,  7993,  1161,  4214,  2303,
        2324, 12606,  4118,   524,  4621,  2996,  1059,  7637,  4113,
        2668,   293,  3494,  1887,  5583,  1780,  9730,  4239,  3521,
        1564,  3069,  2950,  5158,  1154, 11752,  7276,  6408,  7430,
        2350,    15,  1979,   363,  1139,   902,  3005,  2324,  2323,
          69,  5800, 10607, 15609,  6122,  2299,  7734,  1998,  3156,
        9585,  6358,   406,  9255,  5309,  5027, 11548,  4856,   832,
        2813,  1405,  1328,  8667,   659,   509,  2127,   626, 10300,
        1936,  7427, 14859,  1188,    21,  4501,  2468,  1390,  3690,
         489,  9938,  6596,  5713,  4610,  1267,   212,  8487,  1519,
        4689,  3716,  1210,   941,   223,  3295,  4198,  4494, 12115,
       13154,   455, 12778,  5004,  1623,  4801,  2491,   406,  4844,
        7905,  5110,  3708,  2916,   319, 10869,   398,  4574,  6025,
        4162,  2356,  1871,  3312,  7730, 12024, 12232,  7850,  1498,
         902,   909,  3461, 11119,  5374,   896,   971], dtype=int16)