graph main_graph (
  %onnx::Mul_0[INT16, 1x1x1x5], exponents: [-15]
  %onnx::Mul_1[INT16, 2x3x4x5], exponents: [-14]
) {
  %2 = Mul[quant_type = 'S16'](%onnx::Mul_0, %onnx::Mul_1)
  return %2
}


initializers value:



values info:
%onnx::Mul_0[INT16, 1x1x1x5], exponents: [-15]
%2[INT16, 2x3x4x5], exponents: [-13]
%onnx::Mul_1[INT16, 2x3x4x5], exponents: [-14]


test inputs value:
%onnx::Mul_0, shape: [1, 1, 1, 5], exponents: [-15], 
value: array([13754, 17678, 18601,  4169, 11732], dtype=int16)
%onnx::Mul_1, shape: [2, 3, 4, 5], exponents: [-14], 
value: array([10126,  9406, 12643,  9626, 16026, 14542, 11257, 10456, 16054,
        4977,  5418,  2674,  5250, 11418,  5412,  1130, 12857,  2571,
        4216, 10812,  4637, 15370,  5424, 13147,  7285,  2767,  9718,
        7891, 10490,  5825,  4647,  4338,    48, 12828,  3456,  5468,
        1294, 13186,   538,  7870, 10269,  8881, 10359,  8657, 15119,
        6662, 13077,  5986,  5549, 10892,  5883, 10824,  7810,  9845,
        6906,  5762,  5657,  6880, 11699, 12401,  8377,  9409, 15735,
       15628,  4687,  4526, 12383,  5492,  7264,  8060,   596, 13514,
        5909, 12729, 12720, 12648,  7512,  8653,  6322,  2628,  4079,
        7737, 15058,  2669, 10287, 15988, 11818, 15234,  2192, 10636,
        4671,  8036,  5075, 13857,  8779,  5287,   108,  7596, 15709,
        9073,  2692, 12989,  4935,  5360,   247,  4513, 11242,  9432,
       12401, 10101,  7759,  2522, 11185,  5973,  5131, 14440, 10207,
       11475,  8140,  9020], dtype=int16)


test outputs value:
%2, shape: [2, 3, 4, 5], exponents: [-13], 
value: array([2125, 2537, 3588,  612, 2869, 3052, 3037, 2968, 1021,  891, 1137,
        721, 1490,  726,  969,  237, 3468,  730,  268, 1936,  973, 4146,
       1539,  836, 1304,  581, 2621, 2240,  667, 1043,  975, 1170,   14,
        816,  619, 1148,  349, 3743,   34, 1409, 2155, 2396, 2940,  551,
       2707, 1398, 3527, 1699,  353, 1950, 1235, 2920, 2217,  626, 1236,
       1209, 1526, 1953,  744, 2220, 1758, 2538, 4466,  994,  839,  950,
       3340, 1559,  462, 1443,  125, 3645, 1677,  810, 2277, 2654, 2026,
       2456,  402,  470,  856, 2087, 4274,  170, 1842, 3355, 3188, 4324,
        139, 1904,  980, 2168, 1440,  881, 1572, 1110,   29, 2156,  999,
       1624,  565, 3504, 1401,  341,   44,  947, 3032, 2677,  789, 1808,
       1628,  680, 3175,  380,  919, 3031, 2753, 3257,  518, 1615],
      dtype=int16)