graph main_graph (
  %onnx::Equal_1[FLOAT, 1], exponents: [0]
  %onnx::Equal_0[FLOAT, 5x2x48], exponents: [0]
) {
  %2 = Equal[quant_type = 'F32'](%onnx::Equal_0, %onnx::Equal_1)
  return %2
}


initializers value:



values info:
%onnx::Equal_1[FLOAT, 1], exponents: [0]
%onnx::Equal_0[FLOAT, 5x2x48], exponents: [0]
%2[BOOL, 5x2x48], exponents: [0]


test inputs value:
%onnx::Equal_0, shape: [5, 2, 48], exponents: [0], 
value: array([0.4310972 , 0.764261  , 0.3072217 , 0.20988852, 0.8637029 ,
       0.90025824, 0.24636316, 0.28742784, 0.89100534, 0.6303646 ,
       0.36728328, 0.5997142 , 0.29066008, 0.9124995 , 0.23110068,
       0.5815778 , 0.09469241, 0.22806913, 0.2842772 , 0.58508766,
       0.486928  , 0.9792196 , 0.9588185 , 0.94975597, 0.70015776,
       0.6914646 , 0.15399504, 0.09095794, 0.7318474 , 0.21859848,
       0.52188796, 0.6881206 , 0.152709  , 0.5958277 , 0.02638513,
       0.2203725 , 0.8709108 , 0.19316757, 0.44571733, 0.99144584,
       0.57334304, 0.5740234 , 0.22251791, 0.353871  , 0.06951535,
       0.04063922, 0.8200787 , 0.44486707, 0.29818392, 0.65754956,
       0.4536265 , 0.3991205 , 0.9932363 , 0.46633327, 0.05056787,
       0.4010352 , 0.7649088 , 0.93353885, 0.13352025, 0.37444496,
       0.293056  , 0.470088  , 0.5724428 , 0.08909678, 0.24903852,
       0.69853926, 0.92672074, 0.04108828, 0.15168566, 0.5628113 ,
       0.57515216, 0.38315558, 0.9131675 , 0.58463186, 0.88240737,
       0.44694352, 0.05823404, 0.8765894 , 0.44884014, 0.32407677,
       0.5794308 , 0.08931178, 0.35362494, 0.09801984, 0.6101592 ,
       0.5329616 , 0.5836132 , 0.8630919 , 0.78932863, 0.91766524,
       0.14174342, 0.33641076, 0.8310831 , 0.51437527, 0.7092152 ,
       0.45181423, 0.36249346, 0.87191683, 0.93131596, 0.6539297 ,
       0.87539077, 0.14636868, 0.41896093, 0.6318379 , 0.22419316,
       0.538805  , 0.4988439 , 0.590639  , 0.18756527, 0.4257031 ,
       0.65931535, 0.7986009 , 0.92912626, 0.9848182 , 0.7976806 ,
       0.5733437 , 0.9999968 , 0.9008777 , 0.27615505, 0.7737893 ,
       0.36859077, 0.93413144, 0.19037211, 0.90515584, 0.71574366,
       0.9528562 , 0.02180988, 0.13674504, 0.44390798, 0.3690489 ,
       0.39279264, 0.5044609 , 0.88004977, 0.28314102, 0.05676562,
       0.6024855 , 0.02913713, 0.68075186, 0.9149325 , 0.12605482,
       0.6567976 , 0.4908951 , 0.8259359 , 0.4231208 , 0.68681157,
       0.7863683 , 0.10540694, 0.7330649 , 0.80342394, 0.7210301 ,
       0.5092142 , 0.06476665, 0.952998  , 0.01257032, 0.20876974,
       0.8720316 , 0.43718117, 0.55944836, 0.06433028, 0.8763571 ,
       0.19864738, 0.5522074 , 0.8254316 , 0.01178598, 0.804207  ,
       0.81787944, 0.8785456 , 0.83429277, 0.64025503, 0.0167048 ,
       0.42632765, 0.55536073, 0.4409057 , 0.6878712 , 0.11111498,
       0.16753018, 0.24042344, 0.9360411 , 0.5727418 , 0.4032954 ,
       0.03094465, 0.5413329 , 0.9186378 , 0.55560535, 0.05160397,
       0.618819  , 0.57897806, 0.9852651 , 0.39016438, 0.2549948 ,
       0.06858671, 0.86828774, 0.99926233, 0.9197122 , 0.49032688,
       0.7354471 , 0.29401046, 0.9056894 , 0.6941104 , 0.02000672,
       0.16774672, 0.6740274 , 0.6400683 , 0.73539567, 0.45101088,
       0.28895873, 0.7231651 , 0.52384025, 0.747435  , 0.7830081 ,
       0.1823191 , 0.2514484 , 0.7394808 , 0.55475235, 0.7041852 ,
       0.42257196, 0.36911952, 0.24500364, 0.9801301 , 0.82492894,
       0.67824477, 0.48835576, 0.9167866 , 0.42915595, 0.44689667,
       0.0046348 , 0.35090607, 0.7912312 , 0.97332287, 0.16627139,
       0.76624095, 0.6818719 , 0.94379514, 0.9352594 , 0.19760484,
       0.9700911 , 0.2888342 , 0.24049932, 0.0038237 , 0.91184163,
       0.55680555, 0.9775633 , 0.78254956, 0.6522792 , 0.50604546,
       0.1893248 , 0.6796752 , 0.75718445, 0.76249945, 0.9041983 ,
       0.44919497, 0.78062373, 0.10913914, 0.8606471 , 0.32861066,
       0.9375671 , 0.87873954, 0.53734183, 0.25238633, 0.499808  ,
       0.6336514 , 0.8638812 , 0.63023823, 0.28545552, 0.1236555 ,
       0.8734445 , 0.42890978, 0.29324478, 0.9385418 , 0.5466616 ,
       0.3189934 , 0.6532598 , 0.37258506, 0.20642221, 0.4047618 ,
       0.53792465, 0.74644506, 0.3663603 , 0.22121435, 0.5654464 ,
       0.66963875, 0.34772503, 0.9358562 , 0.7095398 , 0.89915663,
       0.72928786, 0.12670451, 0.3344893 , 0.72440404, 0.06529278,
       0.07791084, 0.75554067, 0.38031685, 0.27063066, 0.03396147,
       0.07137275, 0.872661  , 0.27882487, 0.0344224 , 0.7889768 ,
       0.30102414, 0.33078617, 0.90908134, 0.35139298, 0.45237142,
       0.95459235, 0.1987074 , 0.8883524 , 0.22804445, 0.23571968,
       0.6365551 , 0.12267166, 0.2737221 , 0.5415969 , 0.7263968 ,
       0.64814365, 0.6063871 , 0.5289708 , 0.6062127 , 0.7287311 ,
       0.52267694, 0.4896788 , 0.66787666, 0.7358208 , 0.8112446 ,
       0.82336247, 0.5073625 , 0.23560125, 0.8422242 , 0.24145317,
       0.55724263, 0.9181957 , 0.7952076 , 0.9669035 , 0.91525155,
       0.55584383, 0.93927765, 0.13213122, 0.41944414, 0.32007623,
       0.61167556, 0.23277146, 0.87246734, 0.49905598, 0.00788504,
       0.10041708, 0.1653012 , 0.45634907, 0.4949286 , 0.21225256,
       0.9071845 , 0.05094588, 0.7244439 , 0.00771838, 0.82023513,
       0.3734104 , 0.40018892, 0.16670495, 0.01609761, 0.29075795,
       0.3772322 , 0.798094  , 0.70266557, 0.58611983, 0.55630755,
       0.9851596 , 0.34180886, 0.74424887, 0.3684696 , 0.01275635,
       0.03701431, 0.63618803, 0.51081884, 0.07282865, 0.9698    ,
       0.45473164, 0.51826584, 0.0541929 , 0.11144978, 0.19316089,
       0.40361947, 0.6071627 , 0.7973328 , 0.5068162 , 0.7390489 ,
       0.15353471, 0.2170735 , 0.39014208, 0.6614946 , 0.18836969,
       0.6373866 , 0.4898674 , 0.23085529, 0.9444785 , 0.79595506,
       0.07915378, 0.1452474 , 0.771164  , 0.7149843 , 0.45210773,
       0.8724951 , 0.82477283, 0.15298414, 0.07737339, 0.27697742,
       0.5478646 , 0.66311616, 0.33594126, 0.46703964, 0.96284395,
       0.48357403, 0.12973475, 0.7745143 , 0.11020231, 0.595794  ,
       0.37562764, 0.75184005, 0.38934863, 0.13779944, 0.88764787,
       0.62980103, 0.9603439 , 0.7590947 , 0.7514324 , 0.5269016 ,
       0.3968001 , 0.185835  , 0.92579633, 0.2589417 , 0.82308733,
       0.2755556 , 0.7844866 , 0.2857424 , 0.2353391 , 0.04401773,
       0.56278014, 0.38765395, 0.09896332, 0.16421509, 0.9730292 ,
       0.63260823, 0.589342  , 0.2992764 , 0.8975246 , 0.8884743 ,
       0.9561026 , 0.9436952 , 0.7173969 , 0.71613294, 0.5529288 ,
       0.39512938, 0.51927257, 0.81473523, 0.19915313, 0.39347816,
       0.58322245, 0.8829145 , 0.7138934 , 0.25696057, 0.39382654,
       0.9416554 , 0.33588064, 0.32734787, 0.8806148 , 0.72840583,
       0.8836547 , 0.38712263, 0.22580427, 0.62566113, 0.6660692 ,
       0.5755841 , 0.0517953 , 0.9264089 , 0.8170468 , 0.9424438 ,
       0.3255672 , 0.31717992, 0.03320408, 0.26845497, 0.58406436],
      dtype=float32)
%onnx::Equal_1, shape: [1], exponents: [0], 
value: array([0.7970585], dtype=float32)


test outputs value:
%2, shape: [5, 2, 48], exponents: [0], 
value: array([False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False])