graph main_graph (
  %onnx::Equal_1[FLOAT, 1x96x5x48], exponents: [0]
  %onnx::Equal_0[FLOAT, 1x96x5x1], exponents: [0]
) {
  %2 = Equal[quant_type = 'F32'](%onnx::Equal_0, %onnx::Equal_1)
  return %2
}


initializers value:



values info:
%onnx::Equal_1[FLOAT, 1x96x5x48], exponents: [0]
%onnx::Equal_0[FLOAT, 1x96x5x1], exponents: [0]
%2[BOOL, 1x96x5x48], exponents: [0]


test inputs value:
%onnx::Equal_0, shape: [1, 96, 5, 1], exponents: [0], 
value: array([0.57008916, 0.1053158 , 0.06959397, 0.70904726, 0.3119561 ,
       0.16634095, 0.72592014, 0.04717833, 0.26681763, 0.56155115,
       0.02415437, 0.59798086, 0.4809327 , 0.8748225 , 0.1755597 ,
       0.580426  , 0.07404566, 0.4763021 , 0.06896216, 0.8273701 ,
       0.6966746 , 0.5076161 , 0.65431446, 0.35210967, 0.24495268,
       0.12498832, 0.8988828 , 0.14112216, 0.19610518, 0.14977741,
       0.5559697 , 0.5427533 , 0.618385  , 0.90641594, 0.59874403,
       0.874185  , 0.6157402 , 0.3713761 , 0.6277189 , 0.43052632,
       0.7897537 , 0.5424574 , 0.31380713, 0.7022183 , 0.05125821,
       0.2245472 , 0.07725853, 0.5036955 , 0.17703146, 0.6614258 ,
       0.58450735, 0.4063378 , 0.37440205, 0.14737517, 0.14822316,
       0.41425043, 0.9833367 , 0.43457752, 0.27331388, 0.70099443,
       0.48059058, 0.85941815, 0.9784582 , 0.82780343, 0.2566942 ,
       0.7296768 , 0.5141931 , 0.6872213 , 0.6543241 , 0.20351422,
       0.9542082 , 0.35477072, 0.17170167, 0.34267437, 0.8823019 ,
       0.04653186, 0.91795266, 0.2597413 , 0.15447801, 0.22306955,
       0.78004205, 0.6954785 , 0.822168  , 0.06735885, 0.4064896 ,
       0.21610725, 0.64597195, 0.6930552 , 0.57293236, 0.89379245,
       0.43612748, 0.15824264, 0.019804  , 0.73300636, 0.91687036,
       0.37072337, 0.52736527, 0.35129583, 0.31770986, 0.46764165,
       0.02056706, 0.56755537, 0.19119602, 0.84373695, 0.17308378,
       0.6203943 , 0.14671063, 0.60217875, 0.49794376, 0.73970854,
       0.28029978, 0.5911592 , 0.93707055, 0.35855377, 0.3647318 ,
       0.29614264, 0.6281763 , 0.45048487, 0.85272276, 0.27817148,
       0.162319  , 0.20165473, 0.84712607, 0.17567235, 0.46465504,
       0.9168817 , 0.71243894, 0.36824054, 0.8218315 , 0.82323736,
       0.88968086, 0.14112115, 0.3224122 , 0.76546   , 0.31072962,
       0.3114683 , 0.60023314, 0.2608742 , 0.9076365 , 0.5384327 ,
       0.47039932, 0.7627344 , 0.1642375 , 0.06762028, 0.82716435,
       0.11741483, 0.31273305, 0.8655787 , 0.04122961, 0.45386595,
       0.7360304 , 0.4238091 , 0.4618832 , 0.22762352, 0.35188878,
       0.75432193, 0.24625504, 0.3740251 , 0.44747704, 0.65077215,
       0.8177917 , 0.5114436 , 0.69622767, 0.82724994, 0.05335629,
       0.04904383, 0.6693341 , 0.20023435, 0.03217316, 0.22177356,
       0.18067598, 0.62199783, 0.15036768, 0.9149902 , 0.92012703,
       0.05478227, 0.42815006, 0.48150945, 0.15009552, 0.5236646 ,
       0.5945839 , 0.48132402, 0.12845272, 0.05435264, 0.8891261 ,
       0.87523955, 0.4749304 , 0.2058714 , 0.27105755, 0.8034049 ,
       0.48518777, 0.44940233, 0.6123568 , 0.24970162, 0.7757424 ,
       0.17740148, 0.56849045, 0.21193433, 0.49016386, 0.3827548 ,
       0.9916348 , 0.6235437 , 0.71685195, 0.34217012, 0.84078777,
       0.74235344, 0.968197  , 0.40015477, 0.74642825, 0.3338474 ,
       0.22299337, 0.558225  , 0.65106785, 0.7660913 , 0.6067656 ,
       0.15663409, 0.2874565 , 0.37939054, 0.01366186, 0.4303308 ,
       0.82639724, 0.749603  , 0.5665691 , 0.54069567, 0.02546972,
       0.88852626, 0.7276384 , 0.82880116, 0.24800795, 0.16728204,
       0.05489677, 0.07793194, 0.3090747 , 0.39088762, 0.3020997 ,
       0.7902123 , 0.7849107 , 0.76690805, 0.31108952, 0.11283112,
       0.90123165, 0.2979564 , 0.2504983 , 0.59731436, 0.9081276 ,
       0.44486678, 0.9663345 , 0.68366903, 0.6844381 , 0.3881607 ,
       0.15467334, 0.3195941 , 0.02405971, 0.8073579 , 0.51708776,
       0.33241767, 0.48526978, 0.03677815, 0.25067198, 0.75419223,
       0.13758826, 0.7655383 , 0.00732857, 0.9804907 , 0.70269686,
       0.650179  , 0.7819174 , 0.6925905 , 0.8120045 , 0.45590013,
       0.34978998, 0.27010965, 0.12214518, 0.7248736 , 0.96679497,
       0.077941  , 0.15054822, 0.76154864, 0.85988504, 0.49904174,
       0.8003228 , 0.9587134 , 0.292701  , 0.7360416 , 0.5889986 ,
       0.23413628, 0.82438666, 0.6987938 , 0.851833  , 0.61052436,
       0.797865  , 0.82542795, 0.7441929 , 0.62848985, 0.02233303,
       0.15082169, 0.5519175 , 0.52377766, 0.57684296, 0.05607468,
       0.35639358, 0.57405794, 0.46302193, 0.49385637, 0.08317631,
       0.30501723, 0.21977401, 0.77898425, 0.1582442 , 0.03562433,
       0.18320137, 0.721328  , 0.50309366, 0.48300898, 0.2016964 ,
       0.7682354 , 0.0633871 , 0.92197955, 0.8067601 , 0.46083575,
       0.06383395, 0.0349766 , 0.6224439 , 0.7415742 , 0.20308977,
       0.84384274, 0.23111254, 0.61496484, 0.8505317 , 0.07130438,
       0.19247562, 0.4018222 , 0.6146053 , 0.9931496 , 0.5518724 ,
       0.39155638, 0.8206945 , 0.8330854 , 0.5735366 , 0.8666275 ,
       0.15329063, 0.8664058 , 0.29562736, 0.11983335, 0.39220375,
       0.05285931, 0.11430979, 0.33693212, 0.9996825 , 0.6498332 ,
       0.347035  , 0.38628066, 0.7233572 , 0.24433881, 0.75840497,
       0.39067727, 0.79387397, 0.80151004, 0.34742212, 0.20345604,
       0.7068548 , 0.15648746, 0.7062564 , 0.75403726, 0.58251756,
       0.63574016, 0.9613602 , 0.31428945, 0.63357925, 0.6471295 ,
       0.03412271, 0.39281094, 0.16905189, 0.8603951 , 0.59866875,
       0.12964153, 0.2889734 , 0.73950696, 0.1020866 , 0.81981164,
       0.2502762 , 0.53463656, 0.8176486 , 0.5813932 , 0.40085173,
       0.42327237, 0.62692875, 0.04988623, 0.5912813 , 0.9295479 ,
       0.5095962 , 0.14737141, 0.08391237, 0.7880183 , 0.6228424 ,
       0.51307684, 0.6754351 , 0.5041191 , 0.4470387 , 0.3697437 ,
       0.6135651 , 0.448533  , 0.51065457, 0.9364525 , 0.9131335 ,
       0.4344504 , 0.6794457 , 0.6113564 , 0.6073211 , 0.6895655 ,
       0.75591224, 0.54773784, 0.07510662, 0.3243792 , 0.8084369 ,
       0.5852206 , 0.13509274, 0.8316738 , 0.95098853, 0.96369475,
       0.6876844 , 0.53800935, 0.05315942, 0.49329358, 0.31052113,
       0.29354495, 0.85981923, 0.3665833 , 0.42529136, 0.79003733,
       0.47651017, 0.07824206, 0.38810003, 0.97537416, 0.33300436,
       0.5265547 , 0.6108673 , 0.46703106, 0.826208  , 0.9263463 ,
       0.36118782, 0.27585799, 0.79708153, 0.05375767, 0.48258924,
       0.6420282 , 0.5117238 , 0.18637252, 0.7543306 , 0.23401546,
       0.9288748 , 0.5430451 , 0.64006066, 0.94013643, 0.8313968 ,
       0.7269807 , 0.961503  , 0.62840056, 0.89118415, 0.32822782,
       0.23903012, 0.06557828, 0.8253445 , 0.61724234, 0.34773284,
       0.34728473, 0.98328286, 0.35172433, 0.45749098, 0.18312556,
       0.7723597 , 0.68836135, 0.9137644 , 0.10602289, 0.70820755,
       0.7279936 , 0.5814208 , 0.5343271 , 0.8292197 , 0.26194048],
      dtype=float32)
%onnx::Equal_1, shape: [1, 96, 5, 48], exponents: [0], 
value: array([1.43991590e-01, 5.21571696e-01, 4.19998407e-01, 7.37238765e-01,
       5.76623559e-01, 7.02689648e-01, 7.58126497e-01, 8.59805405e-01,
       8.33084583e-01, 9.45736289e-01, 6.19538546e-01, 4.31237817e-02,
       1.84690177e-01, 9.79762673e-02, 3.82869303e-01, 1.25634670e-01,
       8.10402513e-01, 6.97264373e-01, 1.80693865e-01, 4.75875735e-02,
       2.08231628e-01, 1.01733148e-01, 2.58728981e-01, 3.20979655e-01,
       7.07608104e-01, 1.04884326e-01, 3.86263728e-02, 4.46219444e-02,
       4.77128446e-01, 9.29315329e-01, 8.52673292e-01, 9.91815150e-01,
       9.63087618e-01, 3.57774436e-01, 9.34046507e-02, 3.98081541e-02,
       5.86389244e-01, 7.28948236e-01, 6.69096708e-01, 2.66661048e-01,
       9.90176499e-01, 2.16639996e-01, 7.44722605e-01, 1.52150035e-01,
       1.80272043e-01, 5.16197026e-01, 9.00563776e-01, 5.71991920e-01,
       3.59133005e-01, 7.67901599e-01, 9.80874419e-01, 2.43943870e-01,
       3.03566456e-03, 8.81885231e-01, 6.78655505e-02, 7.14886904e-01,
       7.29596019e-01, 7.08754003e-01, 5.83058119e-01, 8.65960538e-01,
       3.28767300e-01, 2.54083335e-01, 8.51482153e-01, 4.28490043e-02,
       5.10206759e-01, 8.27730060e-01, 9.31656003e-01, 7.40118623e-02,
       3.79841805e-01, 2.54966795e-01, 2.99991190e-01, 3.74574184e-01,
       1.52783036e-01, 8.54119778e-01, 9.97126997e-01, 4.74748611e-02,
       4.51737404e-01, 4.65288997e-01, 6.77780867e-01, 4.09159660e-02,
       8.76650512e-01, 1.55696392e-01, 4.69162047e-01, 7.42469192e-01,
       4.53848004e-01, 2.70941257e-02, 6.09492481e-01, 2.35765576e-01,
       5.60558140e-01, 3.44027579e-01, 3.41536939e-01, 3.40595007e-01,
       6.12912536e-01, 7.70546377e-01, 4.80578005e-01, 3.24000180e-01,
       4.39121127e-01, 4.74942327e-01, 6.46965504e-01, 2.89887190e-03,
       9.30185437e-01, 6.51786745e-01, 7.22564638e-01, 4.34927881e-01,
       4.79282677e-01, 1.93288922e-02, 6.66391134e-01, 5.54753840e-01,
       4.00440216e-01, 9.10781205e-01, 8.71221423e-01, 8.98383915e-01,
       9.93214190e-01, 4.28495705e-01, 6.71885729e-01, 1.34507179e-01,
       1.31687164e-01, 6.12957358e-01, 3.21902871e-01, 8.86828899e-02,
       3.36195707e-01, 8.71632874e-01, 5.53251505e-02, 9.57807064e-01,
       3.47247005e-01, 2.96217263e-01, 5.27019203e-01, 2.40900218e-01,
       2.35963583e-01, 6.20898128e-01, 3.75900149e-01, 1.16515756e-01,
       5.06096303e-01, 5.20823658e-01, 4.29923773e-01, 9.57270682e-01,
       9.06791151e-01, 7.33430743e-01, 5.21435916e-01, 7.68163860e-01,
       5.09427011e-01, 6.00200176e-01, 4.08547640e-01, 9.37965035e-01,
       6.73947275e-01, 4.21567023e-01, 3.10649037e-01, 3.16387415e-03,
       8.91604364e-01, 9.54223335e-01, 5.24163723e-01, 9.78243768e-01,
       4.32716191e-01, 9.17143524e-01, 7.72588074e-01, 4.85184550e-01,
       3.86302233e-01, 8.19454849e-01, 4.85121012e-01, 9.87818241e-02,
       3.91675472e-01, 8.09962869e-01, 9.46158171e-02, 2.97612548e-01,
       1.71602547e-01, 4.82728541e-01, 9.96692777e-02, 9.66874421e-01,
       7.79323339e-01, 1.44073367e-02, 3.07172179e-01, 1.11617208e-01,
       4.74760652e-01, 2.68845022e-01, 4.02427733e-01, 7.14782536e-01,
       9.69116330e-01, 2.24981129e-01, 9.52606499e-01, 1.47164762e-01,
       6.37392163e-01, 6.29762113e-01, 9.31330204e-01, 7.42498040e-01,
       9.77889776e-01, 1.19168401e-01, 5.82382381e-01, 7.51955569e-01,
       5.22772372e-01, 9.97679830e-02, 9.21999514e-01, 3.05099905e-01,
       1.87890351e-01, 6.20865822e-03, 4.60581243e-01, 5.29969990e-01,
       2.31468439e-01, 4.99606013e-01, 9.84080374e-01, 6.63733125e-01,
       5.83705902e-01, 6.61350727e-01, 1.78359270e-01, 2.01855659e-01,
       6.92722321e-01, 7.67744362e-01, 5.48191905e-01, 3.17023575e-01,
       5.19013405e-02, 6.04445517e-01, 6.82086885e-01, 6.36421859e-01,
       1.00722313e-01, 2.49134898e-02, 1.01993561e-01, 6.99624419e-02,
       9.68958795e-01, 4.42825913e-01, 2.19947338e-01, 5.03986359e-01,
       5.46510696e-01, 9.22300518e-01, 7.16418028e-01, 7.80184865e-02,
       3.71178806e-01, 4.30958211e-01, 5.46683252e-01, 8.82341623e-01,
       8.29363585e-01, 2.75536001e-01, 8.87068212e-01, 2.48389840e-01,
       9.47952151e-01, 6.58361733e-01, 9.17406023e-01, 2.72159338e-01,
       2.41806328e-01, 5.66978514e-01, 6.67312503e-01, 8.69789302e-01,
       1.94019020e-01, 5.56955278e-01, 6.18049502e-01, 7.06027150e-02,
       5.10190129e-01, 5.67159712e-01, 7.98402905e-01, 3.94911170e-01,
       1.40831411e-01, 7.81792939e-01, 5.17420650e-01, 6.76590979e-01,
       8.54302883e-01, 2.58702040e-01, 5.56841850e-01, 6.25107288e-02,
       8.18500876e-01, 6.15631342e-02, 7.35387802e-01, 9.88900065e-02,
       5.12464404e-01, 9.70219731e-01, 8.15582216e-01, 4.91574883e-01,
       6.64350986e-02, 5.53779066e-01, 6.84934080e-01, 6.37742817e-01,
       8.37627172e-01, 6.16667330e-01, 1.74211860e-01, 9.43220377e-01,
       4.88697886e-02, 5.75563908e-01, 1.29670739e-01, 5.14806092e-01,
       5.10092437e-01, 7.62449563e-01, 6.25362992e-02, 2.14853048e-01,
       6.24387681e-01, 4.60983753e-01, 9.07709479e-01, 6.05856597e-01,
       8.55482399e-01, 3.18404019e-01, 9.46015716e-01, 9.65267539e-01,
       3.60817671e-01, 9.37983990e-02, 5.29151380e-01, 6.82407379e-01,
       1.96989417e-01, 2.94098556e-01, 4.33615327e-01, 4.44961190e-02,
       6.75990641e-01, 4.33348358e-01, 2.75052607e-01, 6.96609974e-01,
       5.35022736e-01, 5.52694798e-01, 8.46169949e-01, 1.66024387e-01,
       6.79189503e-01, 5.45616984e-01, 1.02279425e-01, 9.32323933e-01,
       1.49185240e-01, 6.97452426e-02, 8.42938244e-01, 6.23394966e-01,
       1.22774065e-01, 7.55022347e-01, 5.29183745e-01, 8.30037653e-01,
       8.04592490e-01, 1.97924256e-01, 3.77931714e-01, 6.06891930e-01,
       2.11912990e-02, 4.28195298e-01, 7.96221375e-01, 2.02198446e-01,
       5.28954864e-02, 3.39530170e-01, 5.91678143e-01, 5.23002744e-02,
       1.30101323e-01, 5.49435675e-01, 7.98865676e-01, 5.29263556e-01,
       3.11293006e-01, 2.52722442e-01, 5.10107994e-01, 7.25024283e-01,
       8.50340307e-01, 9.51117158e-01, 2.72389293e-01, 4.34921086e-01,
       7.92688370e-01, 4.15759265e-01, 6.28444672e-01, 7.76001692e-01,
       4.49717104e-01, 6.25531077e-02, 8.86307299e-01, 4.38031733e-01,
       2.75737584e-01, 6.34851336e-01, 1.65342689e-01, 8.64077449e-01,
       5.10331571e-01, 3.41417551e-01, 7.17941523e-02, 5.02414644e-01,
       2.32638836e-01, 8.67542028e-02, 9.48298573e-01, 4.24710989e-01,
       4.35912013e-02, 4.52289045e-01, 5.70224285e-01, 7.10539818e-02,
       4.95817900e-01, 3.84722173e-01, 7.67154634e-01, 8.75272751e-01,
       3.24888945e-01, 5.17783701e-01, 6.91415310e-01, 1.48450077e-01,
       8.18512261e-01, 9.67434287e-01, 7.33248711e-01, 6.37462378e-01,
       1.45835400e-01, 3.38831961e-01, 5.20555735e-01, 3.25347304e-01,
       4.52335238e-01, 5.30625165e-01, 1.38021111e-01, 9.08241570e-01,
       2.93579221e-01, 4.08042729e-01, 6.26172364e-01, 3.32741678e-01,
       3.45382690e-02, 5.42547047e-01, 5.29181421e-01, 8.49066198e-01,
       3.28803897e-01, 5.43870628e-01, 2.26722300e-01, 1.34678781e-01,
       3.47612202e-01, 1.01268589e-01, 4.09071267e-01, 2.49977708e-02,
       8.42190623e-01, 7.00650752e-01, 1.54075503e-01, 9.73517478e-01,
       2.58588016e-01, 9.63936388e-01, 2.37876832e-01, 9.35600221e-01,
       1.23097658e-01, 3.55985761e-01, 3.64012897e-01, 5.26496172e-02,
       9.56434786e-01, 5.76631665e-01, 9.93707299e-01, 3.30337703e-01,
       5.01386404e-01, 5.58839202e-01, 9.57046151e-01, 3.74104977e-02,
       2.83980966e-02, 3.35575223e-01, 5.43417454e-01, 7.34632850e-01,
       3.86562407e-01, 8.61483812e-03, 7.16523111e-01, 8.84645522e-01,
       5.55868268e-01, 7.99137056e-01, 5.35052955e-01, 7.91779578e-01,
       6.78264916e-01, 2.36109436e-01, 7.92481780e-01, 6.16276026e-01,
       5.94247282e-01, 3.25446069e-01, 1.42332494e-01, 3.73872876e-01,
       2.04037428e-02, 6.20491862e-01, 4.11318600e-01, 1.77759111e-01,
       4.62062955e-01, 4.60039198e-01, 5.45283020e-01, 4.98898685e-01,
       6.08666539e-02, 8.14626038e-01, 7.32595384e-01, 7.38770843e-01,
       7.26177514e-01, 9.24380720e-01, 2.66413271e-01, 9.01810050e-01,
       9.15292621e-01, 7.73758948e-01, 9.40329432e-02, 5.76899827e-01,
       2.76207805e-01, 3.24709594e-01, 3.14879656e-01, 5.39735138e-01,
       5.26392996e-01, 6.69593036e-01, 1.24180436e-01, 2.08149195e-01,
       2.08303988e-01, 7.85907567e-01, 3.77840102e-01, 4.97183740e-01,
       7.37443984e-01, 4.57924426e-01, 5.47275126e-01, 8.23813081e-01,
       3.69678497e-01, 4.49186504e-01, 4.25626814e-01, 5.05528986e-01,
       4.89059150e-01, 1.92157805e-01, 1.14530742e-01, 9.88344550e-02,
       6.21267736e-01, 8.63756537e-01, 1.72340751e-01, 8.04272830e-01,
       7.28963554e-01, 1.14858329e-01, 5.02704144e-01, 3.30760479e-02,
       4.16372657e-01, 9.84165430e-01, 2.65512764e-01, 9.07599747e-01,
       4.82387543e-01, 8.24783444e-01, 7.98535407e-01, 4.73792434e-01,
       9.52503681e-01, 9.06089604e-01, 8.08343470e-01, 4.14397597e-01,
       7.37817645e-01, 8.72085094e-01, 5.04297912e-01, 6.37701809e-01,
       4.39278722e-01, 5.13490200e-01, 3.41687262e-01, 1.89154327e-01,
       3.44041348e-01, 5.90464354e-01, 8.97270441e-02, 2.31951177e-01,
       9.65248168e-01, 3.48262250e-01, 5.32040894e-01, 9.79841769e-01,
       9.84707952e-01, 6.59395039e-01, 8.11470270e-01, 4.57098603e-01,
       9.18303132e-01, 4.61987674e-01, 2.27894723e-01, 5.86042285e-01,
       9.05767202e-01, 8.68871152e-01, 7.92017341e-01, 6.09944463e-02,
       3.33944857e-01, 4.04316783e-02, 1.32074773e-01, 6.55207098e-01,
       1.67833626e-01, 8.47306728e-01, 8.98441195e-01, 7.07064152e-01,
       4.39447939e-01, 3.59484553e-02, 8.23823512e-01, 5.37919998e-01,
       4.47105050e-01, 4.82444108e-01, 3.63109827e-01, 8.95033360e-01,
       5.60345769e-01, 1.93978965e-01, 9.27006185e-01, 5.07813275e-01,
       2.22363472e-01, 5.26105821e-01, 2.17123628e-02, 1.24918401e-01,
       7.14773059e-01, 2.64187813e-01, 9.04679835e-01, 4.78702009e-01,
       8.49727511e-01, 9.56035852e-01, 6.09189868e-01, 4.15220201e-01,
       2.01928496e-01, 2.53040910e-01, 6.48393095e-01, 5.42088985e-01,
       4.53419983e-01, 6.36909246e-01, 3.35986137e-01, 6.96831107e-01,
       8.79118860e-01, 7.60805964e-01, 2.80249178e-01, 2.99555659e-02,
       4.82848227e-01, 4.50354576e-01, 3.27321112e-01, 4.78810072e-03,
       4.60585475e-01, 5.47922194e-01, 5.95586777e-01, 5.16986012e-01,
       7.06170976e-01, 4.09315646e-01, 6.00137770e-01, 8.35698068e-01,
       9.50171530e-01, 3.77866209e-01, 2.83708870e-01, 2.62872458e-01,
       7.20812678e-01, 7.87399232e-01, 3.44188094e-01, 2.34275818e-01,
       9.53807235e-01, 9.65689003e-01, 5.00855982e-01, 5.05907476e-01,
       2.90151238e-02, 9.56190884e-01, 1.74686551e-01, 2.59025872e-01,
       8.40809107e-01, 1.05224252e-01, 2.63245404e-01, 6.42609298e-01,
       2.40674675e-01, 5.20484149e-01, 9.02086258e-01, 9.95228827e-01,
       1.31746531e-02, 2.01647162e-01, 3.12214792e-01, 3.32034171e-01,
       4.99818921e-01, 2.01785982e-01, 2.74717808e-03, 9.28218126e-01,
       5.41137159e-01, 6.39871359e-02, 2.18679786e-01, 2.40073681e-01,
       3.01225901e-01, 3.13758850e-04, 7.71716595e-01, 2.86807418e-01,
       8.97102714e-01, 3.45893502e-01, 7.53316343e-01, 6.23693109e-01,
       2.57573664e-01, 6.34420872e-01, 7.97754526e-03, 6.63673878e-03,
       8.26172233e-02, 8.80903542e-01, 5.19196570e-01, 6.77635372e-01,
       7.34308898e-01, 5.38569510e-01, 8.70118678e-01, 4.75335181e-01,
       2.48436391e-01, 8.68195534e-01, 8.75113010e-02, 6.01646781e-01,
       7.71896124e-01, 1.78132355e-01, 3.42307150e-01, 3.75916243e-01,
       2.27090895e-01, 2.43203163e-01, 8.66405308e-01, 9.92063344e-01,
       7.72837758e-01, 9.26699579e-01, 4.27513063e-01, 1.39461100e-01,
       4.94100630e-01, 7.74350524e-01, 9.48396921e-01, 5.76414466e-02,
       9.06703115e-01, 6.99852407e-01, 1.54556215e-01, 5.57918966e-01,
       8.51298392e-01, 1.78535759e-01, 9.75527763e-01, 5.40341198e-01,
       3.20545197e-01, 3.81666899e-01, 2.80555189e-01, 3.28902423e-01,
       9.37010884e-01, 4.28645134e-01, 9.40984309e-01, 4.01699185e-01,
       7.57174492e-01, 7.13909209e-01, 6.34739339e-01, 3.00597668e-01,
       5.49347281e-01, 5.57491958e-01, 2.41677046e-01, 6.24747276e-02,
       4.48087096e-01, 5.55720687e-01, 6.42051935e-01, 5.55014014e-02,
       6.26854897e-01, 3.68616462e-01, 4.30352926e-01, 9.55680370e-01,
       8.78550112e-01, 1.96549892e-02, 6.97917700e-01, 1.80168331e-01,
       2.39269912e-01, 1.31040633e-01, 1.18416607e-01, 9.65105653e-01,
       7.79088378e-01, 5.43283224e-02, 9.04444039e-01, 1.26034915e-01,
       6.37057722e-01, 3.90750349e-01, 5.68436265e-01, 5.30072093e-01,
       7.07877874e-02, 4.05998528e-01, 9.92838562e-01, 8.09644163e-01,
       2.07277477e-01, 2.81123817e-01, 7.16760576e-01, 5.33816278e-01,
       8.92206490e-01, 6.76632524e-02, 8.63241553e-02, 5.33423424e-02,
       8.77463102e-01, 1.00437462e-01, 8.88689637e-01, 1.99063599e-01,
       8.86411786e-01, 8.17070723e-01, 8.79782259e-01, 6.80847108e-01,
       9.79981780e-01, 4.94649887e-01, 9.65048969e-01, 4.99471843e-01,
       9.09850895e-01, 7.95496941e-01, 5.59185505e-01, 8.22597384e-01,
       9.01415408e-01, 9.73386705e-01, 1.24196231e-01, 4.45501089e-01,
       4.56301510e-01, 7.28766680e-01, 6.68259263e-02, 9.52299356e-01,
       3.11019301e-01, 7.92231083e-01, 7.91560352e-01, 4.70691919e-03,
       7.06414104e-01, 8.31128001e-01, 5.53747535e-01, 8.28315914e-01,
       9.04079020e-01, 6.75455809e-01, 9.62246716e-01, 6.47864938e-01,
       9.20663536e-01, 6.67392075e-01, 6.70464337e-01, 7.34021664e-02,
       3.70002687e-01, 1.91763639e-01, 6.08297884e-01, 7.08431840e-01,
       3.62033546e-01, 9.16977763e-01, 1.95936859e-01, 3.72840524e-01,
       3.78628731e-01, 3.85158658e-02, 5.37638783e-01, 4.42476153e-01,
       8.09156716e-01, 5.75683773e-01, 6.02024257e-01, 3.45979929e-02,
       1.25752091e-02, 2.81901717e-01, 3.92931998e-01, 7.13744998e-01,
       5.86076796e-01, 7.51303017e-01, 3.84238839e-01, 2.28881359e-01,
       8.91077518e-03, 9.25910354e-01, 2.01267064e-01, 9.87885118e-01,
       6.36386991e-01, 7.91654587e-02, 7.32725978e-01, 9.37010348e-01,
       9.21177626e-01, 4.92450655e-01, 2.84778178e-01, 1.57297313e-01,
       5.29968202e-01, 6.58127666e-01, 2.58662522e-01, 7.73009419e-01,
       8.79638791e-01, 3.23485851e-01, 3.62658441e-01, 4.57481742e-01,
       5.61129451e-02, 1.62956178e-01, 4.67724502e-01, 8.04849923e-01,
       1.72661364e-01, 1.07962132e-01, 9.07657802e-01, 3.54005694e-01,
       9.81062114e-01, 1.71833575e-01, 2.19521821e-01, 4.89648461e-01,
       3.12216699e-01, 8.18290353e-01, 4.40183342e-01, 5.72180986e-01,
       3.98650706e-01, 9.84509468e-01, 1.59935594e-01, 3.25840175e-01,
       6.18224382e-01, 4.84577715e-01, 9.34056699e-01, 2.53570080e-02,
       5.91180921e-02, 7.23113596e-01, 1.79194927e-01, 3.49778175e-01,
       4.90264475e-01, 5.66024661e-01, 7.01964259e-01, 2.99638271e-01,
       9.30438638e-01, 2.06171632e-01, 7.27622211e-01, 9.38869476e-01,
       4.44950283e-01, 4.19634819e-01, 4.12994146e-01, 6.11027718e-01,
       5.91801643e-01, 8.87473404e-01, 2.53618777e-01, 5.66966951e-01,
       8.88870835e-01, 7.76162982e-01, 7.73895621e-01, 3.48508894e-01,
       9.15950298e-01, 6.50558233e-01, 5.47539234e-01, 7.30429351e-01,
       3.91609311e-01, 8.83430660e-01, 9.52313662e-01, 3.65120351e-01,
       6.73147261e-01, 2.50147164e-01, 7.43097723e-01, 2.23962486e-01,
       9.59120095e-01, 7.54763484e-02, 6.41089976e-01, 2.93963671e-01,
       9.18770671e-01, 5.89887798e-01, 1.84150636e-01, 8.92515779e-01,
       1.41127586e-01, 2.86933303e-01, 7.95283735e-01, 6.60254776e-01,
       1.23801470e-01, 9.47590888e-01, 3.89020741e-01, 4.81260419e-01,
       7.19853163e-01, 3.40947390e-01, 5.76969028e-01, 8.86905611e-01,
       1.01650357e-01, 6.78035975e-01, 4.67153192e-01, 6.20134473e-01,
       6.68686807e-01, 7.20835567e-01, 3.20571661e-01, 2.88759768e-01,
       4.09162223e-01, 1.00907087e-02, 2.61858702e-01, 7.76014864e-01,
       5.03842771e-01, 7.54195035e-01, 7.65982985e-01, 1.49673223e-01,
       3.91707480e-01, 6.62891448e-01, 5.39640367e-01, 2.58224070e-01,
       6.34059429e-01, 4.95119095e-02, 3.00316572e-01, 4.32038486e-01,
       9.27046716e-01, 7.45215297e-01, 7.15788484e-01, 6.10850394e-01,
       5.84432364e-01, 2.41704583e-01, 4.67535257e-01, 2.29364634e-03,
       2.91134953e-01, 8.94902825e-01, 1.62024736e-01, 4.00556147e-01,
       5.79255342e-01, 2.09753633e-01, 7.14949191e-01, 4.46484089e-02,
       9.97558594e-01, 7.59821773e-01, 3.82314622e-01, 9.51478362e-01,
       8.44891071e-01, 6.16291881e-01, 2.46881843e-01, 5.11197269e-01,
       1.80405021e-01, 6.13787770e-01, 4.94203925e-01, 3.50170970e-01,
       1.78541422e-01, 7.20331609e-01, 9.34839666e-01, 9.45335269e-01,
       7.04265237e-02, 8.92839849e-01, 8.61619353e-01, 8.69045496e-01,
       3.31158280e-01, 8.53834748e-01, 4.60913181e-01, 1.41457558e-01,
       6.79700375e-01, 6.61090076e-01, 4.70839858e-01, 9.38770056e-01,
       9.70770121e-02, 6.96995258e-02, 6.65753841e-01, 5.22869587e-01,
       4.67250824e-01, 1.58333480e-01, 1.05562747e-01, 3.99467349e-01,
       8.48120272e-01, 4.02365088e-01, 2.14074671e-01, 8.73065233e-01,
       5.37701905e-01, 3.39905739e-01, 9.88145113e-01, 9.86665308e-01,
       1.60932660e-01, 5.82467437e-01, 8.15443993e-02, 4.76337433e-01,
       4.72415268e-01, 8.81544948e-02, 5.47629654e-01, 9.93193090e-01,
       1.65910304e-01, 3.09221148e-02, 1.29901707e-01, 7.92006850e-01,
       8.23653162e-01, 1.42196536e-01, 1.63884580e-01, 1.76520944e-01,
       9.25275505e-01, 2.39458442e-01, 4.41537917e-01, 2.63601542e-01,
       7.92800367e-01, 3.27583790e-01, 3.04335594e-01, 8.54926109e-02,
       3.40085745e-01, 2.21729636e-01, 7.25147784e-01, 4.85552728e-01,
       2.33063877e-01, 7.50608563e-01, 1.21631444e-01, 5.99009037e-01,
       9.86023366e-01, 2.89397657e-01, 5.90842962e-03, 6.27147734e-01,
       2.39171505e-01, 5.38037539e-01, 4.91058826e-01, 8.45225513e-01,
       3.04211617e-01, 3.40508997e-01, 8.11510324e-01, 3.74434531e-01,
       5.18551826e-01, 4.75329638e-01, 8.19370151e-02, 4.81048107e-01,
       8.88436854e-01, 4.79431212e-01, 3.25383127e-01, 9.12192822e-01,
       2.38622427e-01, 2.01569855e-01, 5.52841961e-01, 9.94451523e-01,
       2.65274465e-01, 8.76423180e-01, 5.50274551e-01, 5.51002085e-01,
       2.89728403e-01, 2.94602871e-01, 3.11602592e-01, 3.69502783e-01,
       6.11632824e-01, 5.78918934e-01, 6.43056691e-01, 9.25026774e-01,
       2.63656855e-01, 2.96801090e-01, 4.94140387e-03, 2.94565797e-01,
       3.92432272e-01, 6.14565015e-02, 6.19378030e-01, 3.22778940e-01,
       3.24046671e-01, 2.85162210e-01, 9.79391754e-01, 2.44842887e-01,
       5.44483840e-01, 3.94954443e-01, 2.74157941e-01, 5.60139418e-02,
       8.62018228e-01, 6.92477345e-01, 9.73583460e-02, 2.84137547e-01,
       4.31880057e-01, 3.63061130e-01, 8.39530945e-01, 6.19021773e-01,
       4.60160434e-01, 9.27921951e-01, 4.97850299e-01, 2.18220353e-01,
       1.91581070e-01, 3.13421488e-01, 8.93169582e-01, 2.36742139e-01,
       6.50718331e-01, 8.81183147e-03, 9.32923317e-01, 2.06539392e-01,
       6.70837879e-01, 2.63089895e-01, 5.27576745e-01, 2.16955960e-01,
       1.16385937e-01, 8.17863762e-01, 2.31517315e-01, 2.03628540e-01,
       3.75352025e-01, 5.56277752e-01, 1.59169436e-01, 6.60239756e-01,
       5.45823395e-01, 2.92006791e-01, 8.83983910e-01, 6.54976904e-01,
       4.60436761e-01, 6.54618502e-01, 6.67232931e-01, 4.09853280e-01,
       3.56873274e-02, 3.84992361e-02, 2.83806920e-01, 6.93185031e-01,
       8.70651662e-01, 4.02966499e-01, 5.22750020e-02, 7.11234033e-01,
       3.71196508e-01, 9.31141615e-01, 6.70836270e-01, 9.15899813e-01,
       2.27608383e-01, 9.50946212e-01, 7.26809204e-01, 3.20973158e-01,
       3.49057198e-01, 8.13339889e-01, 1.39687598e-01, 8.50290060e-02,
       5.07335365e-01, 9.81420696e-01, 7.44104624e-01, 8.29833388e-01,
       1.18787527e-01, 8.59776378e-01, 4.78892803e-01, 7.33188391e-01,
       9.70605016e-01, 3.68524432e-01, 7.91152716e-01, 7.60362566e-01,
       9.45340097e-01, 2.63204277e-01, 4.56633210e-01, 7.30592012e-02,
       3.59371662e-01, 5.02187669e-01, 4.99639511e-02, 3.46504688e-01,
       3.33047986e-01, 5.27740002e-01, 4.73211408e-01, 1.40182614e-01,
       1.23830736e-01, 2.25619972e-01, 2.12416649e-01, 4.48149860e-01,
       5.58186352e-01, 8.41588438e-01, 4.48240221e-01, 2.23369956e-01,
       2.15767443e-01, 6.70980275e-01, 4.83268917e-01, 2.77230382e-01,
       9.48542297e-01, 4.40726936e-01, 3.05193365e-01, 3.95608008e-01,
       8.60561132e-01, 6.01880431e-01, 4.31718767e-01, 6.79872632e-01,
       7.21428871e-01, 1.83841765e-01, 2.94662654e-01, 1.29568040e-01,
       1.40691817e-01, 1.37308955e-01, 9.88644004e-01, 3.76385510e-01,
       8.21376860e-01, 1.46360159e-01, 2.30826199e-01, 8.26750815e-01,
       7.23132789e-01, 5.73899388e-01, 6.71696067e-01, 5.61381519e-01,
       8.24239612e-01, 8.06983411e-01, 1.09240472e-01, 5.73673248e-02,
       1.66758716e-01, 6.29452705e-01, 3.09887350e-01, 8.36622059e-01,
       9.70666587e-01, 3.05640459e-01, 1.40692413e-01, 6.48308754e-01,
       7.68089116e-01, 6.60805881e-01, 3.40228021e-01, 8.24810922e-01,
       6.69413805e-03, 9.93886590e-02, 4.24855053e-01, 6.18648231e-01,
       7.54527688e-01, 9.73423541e-01, 5.10034204e-01, 2.90615320e-01,
       7.48551011e-01, 3.79555225e-02, 2.14330614e-01, 6.10337555e-01,
       7.29293883e-01, 2.13084280e-01, 2.50509322e-01, 1.00748360e-01,
       3.97924542e-01, 5.13585985e-01, 3.36022139e-01, 6.96326315e-01,
       3.71731222e-01, 4.39675927e-01, 1.78251028e-01, 5.64663172e-01,
       8.78064573e-01, 2.61025667e-01, 6.16067171e-01, 4.08431649e-01,
       6.73252344e-03, 5.49710393e-02, 2.02804267e-01, 3.18230629e-01,
       9.56233799e-01, 1.17140055e-01, 2.72890210e-01, 8.90425920e-01,
       7.58151770e-01, 5.07001162e-01, 9.77512002e-02, 8.52768719e-01,
       8.17446768e-01, 4.41630244e-01, 6.20656550e-01, 8.94052207e-01,
       3.96508396e-01, 4.26853299e-01, 8.37338150e-01, 3.94788980e-01,
       9.08027291e-02, 6.55830085e-01, 8.03868949e-01, 9.64027762e-01,
       7.20454454e-01, 7.91446209e-01, 5.15741706e-02, 5.51699638e-01,
       9.64748979e-01, 7.90435672e-02, 4.44896996e-01, 1.98909760e-01,
       5.57684660e-01, 7.13374138e-01, 5.55486798e-01, 8.38395059e-01,
       5.25416672e-01, 7.34426856e-01, 3.58868897e-01, 7.29118884e-01,
       5.83862662e-02, 6.42118156e-01, 6.25683665e-02, 4.66845095e-01,
       1.69119298e-01, 6.89890802e-01, 6.30681634e-01, 8.06955516e-01,
       8.43099356e-01, 2.27064669e-01, 5.64467311e-02, 2.18136013e-01,
       4.13583875e-01, 6.18058980e-01, 4.38809335e-01, 6.50937259e-01,
       5.99519670e-01, 4.30494964e-01, 2.28217483e-01, 5.06302357e-01,
       5.03982902e-01, 3.89366865e-01, 1.32715046e-01, 2.06626832e-01,
       5.88985503e-01, 8.43097985e-01, 9.47602808e-01, 7.15958238e-01,
       3.71408820e-01, 6.25427604e-01, 8.21349561e-01, 9.28378999e-01,
       6.20992780e-02, 9.57438588e-01, 6.73224568e-01, 5.41985989e-01,
       9.91822541e-01, 5.77928782e-01, 3.35766494e-01, 4.24351037e-01,
       8.16953063e-01, 1.65113091e-01, 3.51266026e-01, 2.94472694e-01,
       6.60729408e-01, 1.53348565e-01, 3.91973794e-01, 9.89434898e-01,
       1.40211344e-01, 8.12120676e-01, 3.65350187e-01, 8.01412463e-02,
       3.81696701e-01, 9.44672823e-01, 7.44279802e-01, 2.80595422e-01,
       8.05380166e-01, 7.11219013e-01, 9.72954571e-01, 7.03332782e-01,
       2.27769673e-01, 8.74354482e-01, 2.73300767e-01, 1.07120574e-01,
       6.77549839e-02, 6.23190045e-01, 5.41009843e-01, 3.27979922e-01,
       9.55984950e-01, 4.93793368e-01, 8.20909202e-01, 4.93250966e-01,
       6.21330678e-01, 5.08830070e-01, 4.57745552e-01, 9.00551081e-01,
       9.68171656e-01, 9.27738011e-01, 6.13247693e-01, 1.77706897e-01,
       5.79170585e-01, 6.18063390e-01, 2.71450818e-01, 9.42459106e-01,
       2.92337239e-01, 8.70118856e-01, 6.43463552e-01, 9.33185756e-01,
       6.36000633e-01, 7.91133165e-01, 5.66949069e-01, 3.85672569e-01,
       7.21814811e-01, 1.80901349e-01, 7.29092300e-01, 2.87650824e-02,
       5.04044771e-01, 9.93094385e-01, 3.08752060e-02, 9.87299085e-01,
       5.72568119e-01, 2.13947415e-01, 9.85825360e-01, 1.65898621e-01,
       8.89164984e-01, 3.36350083e-01, 1.36047482e-01, 1.08394980e-01,
       6.53001308e-01, 1.78340197e-01, 5.28539777e-01, 5.63668728e-01,
       7.98015356e-01, 3.18150520e-02, 1.81370974e-03, 6.27295732e-01,
       2.19120800e-01, 6.18957043e-01, 7.66023636e-01, 6.30090654e-01,
       8.83149445e-01, 2.13718891e-01, 7.66484797e-01, 6.92462325e-02,
       1.26613081e-01, 4.77694094e-01, 1.60640657e-01, 5.62431872e-01,
       5.35464883e-02, 4.90284503e-01, 2.20839143e-01, 5.26502013e-01,
       8.70103955e-01, 6.35744750e-01, 3.55479956e-01, 9.67388451e-01,
       7.92191505e-01, 3.05687964e-01, 1.43753290e-01, 1.70329332e-01,
       1.33444607e-01, 8.10753644e-01, 7.33761430e-01, 4.80379343e-01,
       9.13893461e-01, 1.72212541e-01, 5.48412323e-01, 4.08542693e-01,
       2.97082961e-01, 4.62559462e-02, 5.38527966e-01, 1.46065772e-01,
       1.07563436e-01, 5.45453548e-01, 8.88445973e-01, 4.37554121e-01,
       1.41399980e-01, 2.46762991e-01, 3.77453446e-01, 1.42769694e-01,
       8.74325037e-02, 6.03996575e-01, 5.32274842e-01, 4.37141299e-01,
       7.34425187e-01, 6.98480844e-01, 2.53168523e-01, 7.01146364e-01,
       6.32299900e-01, 7.00442016e-01, 9.78569090e-01, 7.18799353e-01,
       6.84170544e-01, 1.11896336e-01, 1.95293665e-01, 1.48625970e-01,
       7.81317890e-01, 1.09892011e-01, 7.33673573e-02, 6.65096104e-01,
       2.89157629e-02, 9.46005762e-01, 6.83640063e-01, 7.58403838e-01,
       8.94280612e-01, 7.55226672e-01, 6.25019610e-01, 5.90645134e-01,
       1.05680883e-01, 1.47254825e-01, 5.30571818e-01, 9.60574389e-01,
       2.63651907e-01, 1.91725314e-01, 8.88690114e-01, 6.84391081e-01,
       6.79029286e-01, 8.81725192e-01, 1.85677707e-01, 5.18201292e-01,
       8.46048355e-01, 5.02402663e-01, 7.28703082e-01, 1.76411152e-01,
       2.02982843e-01, 6.71576679e-01, 6.89419687e-01, 2.92203963e-01,
       9.05742109e-01, 6.02836430e-01, 8.02890003e-01, 2.68340170e-01,
       5.94084382e-01, 8.06086063e-02, 5.24934173e-01, 3.08476686e-01,
       7.69069195e-02, 3.11408103e-01, 4.24644768e-01, 7.81103373e-02,
       4.08217251e-01, 1.57798648e-01, 6.05460405e-02, 9.26132858e-01,
       4.97702360e-02, 2.49220908e-01, 1.87896907e-01, 6.53719008e-01,
       1.87892914e-02, 4.57989097e-01, 8.68242800e-01, 9.15000081e-01,
       7.82205939e-01, 3.02412570e-01, 2.20288098e-01, 1.15219355e-02,
       1.03704929e-02, 5.81757963e-01, 3.87824178e-02, 3.42927039e-01,
       2.03274488e-01, 1.20913863e-01, 6.76357150e-01, 9.57465410e-01,
       6.49710596e-01, 7.29056597e-01, 6.51702285e-01, 7.46978283e-01,
       3.34398746e-01, 6.98216558e-02, 6.29758835e-03, 1.03973389e-01,
       4.35647309e-01, 2.19513416e-01, 9.55933630e-01, 1.38912857e-01,
       4.52335060e-01, 8.94112051e-01, 5.10815620e-01, 6.73118353e-01,
       3.41989398e-02, 1.76149666e-01, 4.90803301e-01, 9.88945425e-01,
       8.61077845e-01, 7.85957694e-01, 7.92230010e-01, 4.23961878e-01,
       7.44192719e-01, 1.40854120e-02, 3.65435123e-01, 3.37168157e-01,
       8.72954190e-01, 1.97965026e-01, 2.80457973e-01, 3.96827102e-01,
       6.97768867e-01, 3.32688689e-01, 5.30985594e-01, 5.03737271e-01,
       7.50067830e-01, 6.19707227e-01, 9.43744600e-01, 3.31204057e-01,
       1.82472467e-01, 1.77716136e-01, 1.21873140e-01, 3.18591475e-01,
       7.12629020e-01, 1.11036301e-02, 4.43942070e-01, 5.69860160e-01,
       6.71329498e-01, 7.74799705e-01, 9.76638854e-01, 9.08149660e-01,
       5.91773391e-02, 4.29330826e-01, 2.69421339e-01, 6.60597563e-01,
       3.82135510e-01, 7.98620343e-01, 7.95509934e-01, 7.41570771e-01,
       7.02875972e-01, 2.74127305e-01, 1.42542839e-01, 1.47945225e-01,
       1.43254220e-01, 1.05625749e-01, 8.52284610e-01, 2.33402848e-02,
       6.51726484e-01, 8.01444054e-02, 9.96599317e-01, 4.71426845e-02,
       6.54671311e-01, 2.73953676e-02, 1.52416706e-01, 5.94516516e-01,
       1.28076911e-01, 2.01836586e-01, 7.81626225e-01, 3.08548808e-02,
       9.15213227e-01, 7.98946142e-01, 6.05796874e-01, 1.84793472e-02,
       3.03942323e-01, 4.92031932e-01, 6.02570593e-01, 8.03535938e-01,
       7.93392539e-01, 5.27002215e-01, 2.54031420e-02, 6.48582757e-01,
       1.92568421e-01, 7.17732012e-01, 8.81689727e-01, 1.33757710e-01,
       4.15505826e-01, 7.23495007e-01, 4.83828425e-01, 9.18822289e-01,
       4.29104149e-01, 8.57425511e-01, 8.14581394e-01, 4.33927238e-01,
       9.61392045e-01, 9.99812663e-01, 6.38193786e-01, 2.96679735e-01,
       9.31804180e-01, 2.46073008e-01, 6.43073082e-01, 8.61267447e-01,
       9.94164348e-01, 4.61143970e-01, 7.45386064e-01, 3.41337442e-01,
       6.29679084e-01, 8.07438493e-01, 4.28956687e-01, 9.60324764e-01,
       4.91144001e-01, 3.32723916e-01, 6.00827575e-01, 9.68817174e-01,
       2.88663745e-01, 4.21213865e-01, 2.16704011e-01, 3.00896764e-02,
       2.17706800e-01, 9.91265714e-01, 6.34669781e-01, 1.90813005e-01,
       7.14224696e-01, 6.07106626e-01, 8.91761482e-01, 7.50823975e-01,
       4.33655977e-01, 6.80691361e-01, 5.74679255e-01, 9.47006583e-01,
       3.86082470e-01, 5.19575000e-01, 6.16081715e-01, 3.71086180e-01,
       2.39820480e-01, 1.85946703e-01, 7.59244144e-01, 4.39623952e-01,
       7.80746877e-01, 1.37807965e-01, 6.40736878e-01, 2.64294326e-01,
       3.17096651e-01, 5.91571927e-02, 7.52372622e-01, 6.17937922e-01,
       8.83336842e-01, 8.79902065e-01, 9.09244180e-01, 9.18155193e-01,
       3.53285253e-01, 2.52729535e-01, 5.46926558e-01, 1.85386181e-01,
       6.67271972e-01, 7.81339884e-01, 3.86628628e-01, 8.38282168e-01,
       5.08351326e-02, 4.60193574e-01, 2.27221131e-01, 9.51129913e-01,
       7.75227547e-02, 4.36296880e-01, 7.96305478e-01, 1.10448837e-01,
       2.37154305e-01, 3.22345734e-01, 9.04776394e-01, 4.72030461e-01,
       3.24418604e-01, 4.13604259e-01, 3.43864501e-01, 2.14417756e-01,
       9.67479348e-01, 5.65006852e-01, 2.82527626e-01, 5.99381924e-02,
       6.29985332e-02, 8.64827037e-02, 4.46225166e-01, 7.91281998e-01,
       3.57446373e-01, 4.88367260e-01, 4.55339015e-01, 6.24826074e-01,
       6.04140759e-03, 8.00732970e-01, 8.55116367e-01, 8.33990753e-01,
       5.19394994e-01, 1.94660187e-01, 2.81925201e-02, 5.73554397e-01,
       1.06386125e-01, 8.18365276e-01, 9.45336103e-01, 6.40345037e-01,
       7.88234651e-01, 2.98000455e-01, 8.47316861e-01, 7.50448704e-01,
       1.71084344e-01, 3.10478210e-02, 8.07434916e-02, 4.99546826e-01,
       9.10274684e-01, 1.40524030e-01, 1.14784360e-01, 8.81679773e-01,
       6.67918503e-01, 4.43563521e-01, 3.48281503e-01, 8.69129777e-01,
       1.75401747e-01, 5.14457107e-01, 4.20460880e-01, 5.39944053e-01,
       5.66793144e-01, 4.08558309e-01, 6.34043872e-01, 5.63031793e-01,
       1.74389184e-01, 4.76354957e-02, 3.18771482e-01, 3.31615388e-01,
       4.16890264e-01, 8.04803073e-01, 5.38339615e-01, 6.14952326e-01,
       1.43892944e-01, 9.51058745e-01, 7.27588236e-01, 9.04724956e-01,
       6.23804331e-01, 2.56267607e-01, 3.41102242e-01, 8.38041961e-01,
       7.39932477e-01, 7.27746487e-01, 7.44830310e-01, 2.63989627e-01,
       6.29894495e-01, 2.09980667e-01, 5.83503246e-01, 4.16776538e-02,
       9.47328746e-01, 3.58326435e-01, 2.43274987e-01, 5.99349797e-01,
       7.54110336e-01, 7.63925910e-02, 3.64456415e-01, 9.93589997e-01,
       1.84184968e-01, 1.76765442e-01, 3.65299523e-01, 6.62720561e-01,
       6.46783292e-01, 6.23107553e-01, 5.74032247e-01, 9.56837535e-02,
       4.54738081e-01, 3.89050364e-01, 7.23317444e-01, 6.34722590e-01,
       6.58713102e-01, 4.30559516e-01, 6.44794941e-01, 1.00155592e-01,
       2.27587700e-01, 4.40818787e-01, 8.30743313e-01, 3.98944736e-01,
       1.82835162e-01, 5.57431102e-01, 3.44191790e-02, 4.28457439e-01,
       9.53918099e-01, 4.61747885e-01, 3.55335772e-01, 7.53581345e-01,
       2.30343819e-01, 5.97999334e-01, 8.60479295e-01, 9.62485671e-02,
       8.01290810e-01, 2.70865500e-01, 9.73459661e-01, 5.17688632e-01,
       4.86086428e-01, 6.23215437e-01, 9.24493551e-01, 4.05416787e-01,
       4.68083501e-01, 6.26411617e-01, 4.00466323e-01, 5.68143010e-01,
       1.63601875e-01, 7.67679870e-01, 6.21088147e-01, 4.77187932e-01,
       1.85836077e-01, 4.10673499e-01, 5.40304065e-01, 7.73657382e-01,
       3.61710787e-03, 9.97719765e-02, 3.29407811e-01, 2.82431543e-01,
       4.43688035e-01, 2.38227189e-01, 2.41768181e-01, 4.93089974e-01,
       2.07287133e-01, 9.07512367e-01, 2.17315078e-01, 7.30891049e-01,
       9.02354062e-01, 4.77194250e-01, 2.24105835e-01, 4.28455591e-01,
       5.88460922e-01, 9.39954042e-01, 6.01105690e-01, 3.03123891e-01,
       5.44836164e-01, 6.80933654e-01, 3.42599690e-01, 8.34395468e-01,
       2.04516590e-01, 4.35725749e-01, 7.62879014e-01, 4.55808282e-01,
       5.62662840e-01, 2.13153660e-01, 6.35492444e-01, 1.46506131e-01,
       7.08750606e-01, 8.43020618e-01, 4.18382525e-01, 7.10756898e-01,
       2.30175495e-01, 9.70968604e-02, 7.40568757e-01, 9.48442400e-01,
       8.77076447e-01, 6.17731571e-01, 1.75878882e-01, 5.07826626e-01,
       2.60902047e-02, 6.22481823e-01, 9.39740658e-01, 9.79251206e-01,
       5.26428938e-01, 1.99084282e-02, 9.97915566e-01, 2.76174486e-01,
       8.96567583e-01, 1.83410704e-01, 8.16550076e-01, 5.04723787e-02,
       2.95902431e-01, 5.41216373e-01, 3.51992369e-01, 2.03530788e-01,
       9.78744090e-01, 8.06391180e-01, 3.42231572e-01, 3.63863826e-01,
       6.82528794e-01, 7.20343947e-01, 5.10514438e-01, 7.76439786e-01,
       9.25543308e-01, 4.76382136e-01, 6.33762479e-01, 7.42992580e-01,
       6.29123688e-01, 5.84609509e-02, 8.84601891e-01, 6.09422922e-02,
       3.93359840e-01, 6.74696088e-01, 3.26548874e-01, 4.90265369e-01,
       8.16738546e-01, 6.11817718e-01, 1.08673930e-01, 1.57292664e-01,
       3.94136786e-01, 9.12907004e-01, 9.76745605e-01, 2.76773989e-01,
       6.28748715e-01, 3.29502225e-02, 8.76419544e-01, 3.23144972e-01,
       7.61289895e-01, 2.61989951e-01, 3.47943068e-01, 7.16553986e-01,
       6.82364166e-01, 5.21578610e-01, 6.79842532e-01, 1.11419320e-01,
       8.35140884e-01, 6.96392417e-01, 5.55101514e-01, 4.24881816e-01,
       3.58811080e-01, 4.63931203e-01, 3.52560639e-01, 6.69803202e-01,
       4.91546392e-02, 3.04440677e-01, 4.07856703e-02, 8.68644714e-02,
       2.31207430e-01, 5.86361706e-01, 8.36309254e-01, 1.33323908e-01,
       6.06970131e-01, 1.82488084e-01, 3.10816765e-01, 8.57954979e-01,
       3.21377397e-01, 4.69891727e-01, 4.62077856e-01, 9.72573400e-01,
       7.54328907e-01, 4.59604681e-01, 5.13497412e-01, 8.67463529e-01,
       4.71319139e-01, 8.72881651e-01, 3.22501063e-02, 4.32813764e-02,
       3.79016638e-01, 7.75934398e-01, 8.12050879e-01, 9.18212891e-01,
       4.25236046e-01, 4.47261035e-01, 8.50910485e-01, 4.93821800e-01,
       3.09540570e-01, 5.78381240e-01, 6.58722401e-01, 2.24143505e-01,
       8.93568277e-01, 3.68399560e-01, 3.65976095e-02, 6.51872993e-01,
       9.00390923e-01, 3.34543586e-02, 4.84323978e-01, 7.88417578e-01,
       4.88765121e-01, 6.24689758e-01, 4.11005974e-01, 8.94237518e-01,
       2.99445987e-02, 8.97036195e-02, 1.41308069e-01, 7.60665059e-01,
       8.93256068e-01, 7.60021210e-02, 3.50694060e-02, 1.89986348e-01,
       8.13094854e-01, 2.40050018e-01, 8.02438021e-01, 6.82747424e-01,
       9.31618214e-02, 8.94973159e-01, 1.06305361e-01, 6.69333160e-01,
       2.82302737e-01, 2.85971224e-01, 5.18219173e-01, 5.32893240e-01,
       4.55253243e-01, 3.55299592e-01, 4.32887137e-01, 2.66025960e-01,
       9.24486518e-02, 2.63606191e-01, 7.10322082e-01, 1.80455625e-01,
       2.64892817e-01, 3.17874610e-01, 9.32383537e-01, 9.99609351e-01,
       1.93926036e-01, 3.59792709e-02, 6.10343456e-01, 2.70707786e-01,
       7.60185122e-02, 9.54411209e-01, 4.37528610e-01, 3.57171476e-01,
       2.40667522e-01, 4.48134422e-01, 6.87735081e-01, 3.49514008e-01,
       6.91683531e-01, 3.89492095e-01, 1.78622723e-01, 6.77153468e-01,
       4.85143065e-02, 5.11281610e-01, 8.81047964e-01, 4.56954956e-01,
       4.45043504e-01, 9.90022123e-01, 3.49329770e-01, 6.49546027e-01,
       7.45361030e-01, 2.87804663e-01, 4.12020326e-01, 4.78463233e-01,
       7.97306299e-02, 8.47258866e-01, 6.84010804e-01, 3.27021539e-01,
       7.15980411e-01, 9.48735237e-01, 7.06428766e-01, 9.92570281e-01,
       2.95840621e-01, 7.64368117e-01, 8.01198006e-01, 4.98193741e-01,
       9.39973235e-01, 5.19374132e-01, 5.54330945e-01, 6.37847781e-01,
       6.94561005e-03, 5.30787706e-01, 9.82872248e-01, 1.71193182e-01,
       6.47382498e-01, 5.42891741e-01, 2.66093910e-01, 7.06957817e-01,
       4.03988957e-01, 1.01213038e-01, 8.13992083e-01, 2.96542943e-01,
       4.36650872e-01, 1.62185907e-01, 1.22991681e-01, 7.24544227e-01,
       9.39615250e-01, 1.95493519e-01, 6.72967851e-01, 5.69872499e-01,
       1.88004792e-01, 3.89075577e-01, 5.79578757e-01, 5.14317989e-01,
       6.04685605e-01, 1.23185515e-02, 1.17174089e-01, 8.95174146e-02,
       7.97496200e-01, 8.02136540e-01, 1.27331972e-01, 6.73056543e-01,
       2.09777296e-01, 5.52270412e-02, 5.48563063e-01, 5.80800772e-02,
       3.42692733e-01, 7.16515601e-01, 8.69907975e-01, 2.03837514e-01,
       6.49490058e-01, 5.25253594e-01, 4.34309542e-01, 4.43885267e-01,
       6.27498150e-01, 3.61610353e-01, 3.38441133e-03, 7.97806382e-01,
       7.68697917e-01, 3.22563648e-02, 8.06594193e-01, 6.46332383e-01,
       8.62615108e-02, 8.57844591e-01, 7.69319296e-01, 8.37623894e-01,
       8.97854567e-02, 7.32159138e-01, 6.74687743e-01, 7.43619800e-02,
       4.42308426e-01, 5.02712011e-01, 6.72438920e-01, 6.02757812e-01,
       5.05081952e-01, 4.12972927e-01, 8.38701069e-01, 5.36227703e-01,
       6.44656539e-01, 2.21719146e-02, 1.89745784e-01, 9.25530970e-01,
       5.95340610e-01, 5.61592162e-01, 6.77592754e-01, 3.25485468e-01,
       5.07960618e-01, 1.85955763e-01, 2.08968163e-01, 8.61665666e-01,
       8.77300560e-01, 9.24085200e-01, 5.66083848e-01, 3.05508673e-01,
       9.48258936e-01, 4.44872379e-02, 8.97536278e-02, 3.03372145e-02,
       3.27826738e-01, 6.17794335e-01, 7.89445639e-02, 3.39394808e-02,
       7.80410945e-01, 7.72893429e-01, 4.44859743e-01, 3.09245288e-01,
       4.62427378e-01, 4.14974749e-01, 8.54415298e-02, 1.64466619e-01,
       2.06346869e-01, 1.80698454e-01, 3.37385118e-01, 7.40087926e-01,
       6.21729076e-01, 2.02289820e-01, 4.04394805e-01, 5.02189934e-01,
       3.70111346e-01, 5.17889917e-01, 3.62763643e-01, 6.93230510e-01,
       9.09091532e-01, 4.88597691e-01, 6.12194896e-01, 5.47774911e-01,
       8.42021585e-01, 6.54766142e-01, 2.27917850e-01, 8.22586358e-01,
       7.83749580e-01, 2.16421306e-01, 4.45249736e-01, 3.33389342e-01,
       7.62709618e-01, 2.09756017e-01, 4.93919492e-01, 4.92357969e-01,
       5.37651300e-01, 2.84961581e-01, 4.95970130e-01, 6.40682578e-02,
       7.17748821e-01, 5.61851799e-01, 7.54774094e-01, 9.80785847e-01,
       5.62705398e-02, 6.60491765e-01, 1.74341619e-01, 1.23879969e-01,
       4.08773661e-01, 3.22416008e-01, 1.10110760e-01, 6.19379580e-01,
       7.15593100e-02, 6.68748021e-01, 3.75276268e-01, 9.49827969e-01,
       3.58295560e-01, 8.09750557e-01, 2.61946499e-01, 7.85600543e-01,
       1.65961266e-01, 7.64186978e-02, 5.59426069e-01, 2.10013509e-01,
       7.43387938e-01, 5.87779701e-01, 7.44216502e-01, 8.23671341e-01,
       6.95536196e-01, 9.57700789e-01, 6.08466148e-01, 4.58197951e-01,
       9.33179975e-01, 3.29453349e-01, 9.72847521e-01, 7.34293997e-01,
       1.10920370e-01, 6.15864098e-01, 9.49186027e-01, 9.34088886e-01,
       3.69913638e-01, 9.40573156e-01, 9.31619704e-01, 7.96427131e-01,
       9.73891258e-01, 9.79615569e-01, 1.63876891e-01, 9.70084667e-01,
       7.81676710e-01, 4.89079773e-01, 7.07026362e-01, 6.68928921e-01,
       4.12791491e-01, 3.73354733e-01, 5.83638608e-01, 9.14441407e-01,
       3.12065482e-01, 2.05308914e-01, 4.56585169e-01, 8.75576735e-02,
       1.63730264e-01, 7.54552484e-02, 1.77105308e-01, 9.69861388e-01,
       2.77747154e-01, 9.48741794e-01, 8.02625299e-01, 1.63417816e-01,
       7.82080829e-01, 4.42059636e-02, 8.51769507e-01, 6.68456912e-01,
       6.41254187e-01, 5.78305602e-01, 3.14395070e-01, 1.57910705e-01,
       5.93631208e-01, 4.50619519e-01, 2.32462883e-01, 9.04036045e-01,
       6.25513792e-02, 6.83054924e-01, 8.07896912e-01, 5.67809880e-01,
       9.48967338e-01, 5.04911304e-01, 3.78041863e-02, 8.67208242e-02,
       5.98194599e-01, 2.95931399e-01, 5.43163478e-01, 8.91245365e-01,
       2.71163046e-01, 9.58754241e-01, 3.49148035e-01, 4.25767362e-01,
       4.00727391e-01, 3.71730983e-01, 4.94932175e-01, 3.45454693e-01,
       1.39372468e-01, 5.40281773e-01, 5.43493152e-01, 2.74845243e-01,
       8.97537172e-01, 3.92401040e-01, 3.09427977e-02, 5.70948720e-01,
       4.29634452e-02, 5.37135005e-01, 2.78118730e-01, 6.72873616e-01,
       4.48842764e-01, 6.46774650e-01, 7.70010054e-01, 2.28606284e-01,
       4.33504164e-01, 6.50656044e-01, 8.24548125e-01, 4.24768746e-01,
       5.65500736e-01, 3.30866694e-01, 3.41607392e-01, 8.79298329e-01,
       1.50747299e-02, 3.18775356e-01, 4.42854166e-02, 2.46240020e-01,
       6.14989221e-01, 5.30450702e-01, 2.74672210e-01, 4.29442167e-01,
       7.94764578e-01, 3.70953321e-01, 1.26036882e-01, 1.85206771e-01,
       6.32930458e-01, 2.98669994e-01, 9.80388522e-02, 4.01511610e-01,
       1.31886601e-01, 5.60152531e-01, 9.31076288e-01, 3.23203981e-01,
       2.44746208e-02, 4.28856671e-01, 1.64936066e-01, 5.94474435e-01,
       3.27803850e-01, 7.02319682e-01, 8.93542171e-01, 8.79145920e-01,
       4.89199162e-02, 4.67704415e-01, 8.22757125e-01, 8.75205934e-01,
       6.06605172e-01, 9.41786587e-01, 8.81774962e-01, 8.58690679e-01,
       3.23765874e-02, 4.11328316e-01, 9.41950858e-01, 6.90093338e-01,
       6.87123418e-01, 1.21487796e-01, 7.38198459e-01, 8.50987554e-01,
       1.68846309e-01, 7.39280581e-02, 1.91172063e-01, 6.69658184e-04,
       8.14158916e-02, 5.95025420e-01, 8.18521678e-01, 2.19365895e-01,
       4.04494345e-01, 7.60363162e-01, 7.25382805e-01, 8.74341369e-01,
       2.87361920e-01, 9.45297480e-02, 5.89593053e-01, 1.72005832e-01,
       1.26847625e-01, 7.80823827e-02, 7.36125231e-01, 3.35202157e-01,
       3.88629496e-01, 6.60870850e-01, 7.94864476e-01, 6.61103606e-01,
       4.14157033e-01, 8.35243285e-01, 3.60848010e-01, 8.09109569e-01,
       3.12585115e-01, 6.07984662e-01, 6.23441100e-01, 1.06255352e-01,
       7.93710053e-01, 7.08645999e-01, 3.91947031e-02, 5.39507091e-01,
       4.00715292e-01, 6.01255715e-01, 4.41453218e-01, 4.77989614e-01,
       5.25093973e-01, 3.61258924e-01, 4.44304883e-01, 9.07881379e-01,
       9.70786154e-01, 7.45367646e-01, 7.96901047e-01, 5.58727086e-01,
       3.04925859e-01, 3.30314517e-01, 3.65007401e-01, 8.19164157e-01,
       6.79079652e-01, 6.74514771e-02, 6.58513784e-01, 3.99147570e-01,
       4.90962803e-01, 1.24323368e-01, 8.35404158e-01, 2.69593656e-01,
       2.56637573e-01, 4.73605514e-01, 8.51310492e-01, 1.76083803e-01,
       7.18980372e-01, 2.63074517e-01, 2.63239205e-01, 1.53489172e-01,
       9.91620302e-01, 3.11190665e-01, 5.89179456e-01, 5.79169571e-01,
