graph main_graph (
  %onnx::Equal_1[FLOAT, 2x1], exponents: [0]
  %onnx::Equal_0[FLOAT, 2x5], exponents: [0]
) {
  %2 = Equal[quant_type = 'F32'](%onnx::Equal_0, %onnx::Equal_1)
  return %2
}


initializers value:



values info:
%onnx::Equal_1[FLOAT, 2x1], exponents: [0]
%onnx::Equal_0[FLOAT, 2x5], exponents: [0]
%2[BOOL, 2x5], exponents: [0]


test inputs value:
%onnx::Equal_0, shape: [2, 5], exponents: [0], 
value: array([0.86300224, 0.47478318, 0.22174197, 0.4522522 , 0.39583647,
       0.88034976, 0.8082794 , 0.85169095, 0.79022473, 0.7767937 ],
      dtype=float32)
%onnx::Equal_1, shape: [2, 1], exponents: [0], 
value: array([0.7999474, 0.3010924], dtype=float32)


test outputs value:
%2, shape: [2, 5], exponents: [0], 
value: array([False, False, False, False, False, False, False, False, False,
       False])