graph main_graph (
  %onnx::Equal_1[FLOAT, 1], exponents: [0]
  %onnx::Equal_0[FLOAT, 2x5], exponents: [0]
) {
  %2 = Equal[quant_type = 'F32'](%onnx::Equal_0, %onnx::Equal_1)
  return %2
}


initializers value:



values info:
%onnx::Equal_1[FLOAT, 1], exponents: [0]
%onnx::Equal_0[FLOAT, 2x5], exponents: [0]
%2[BOOL, 2x5], exponents: [0]


test inputs value:
%onnx::Equal_0, shape: [2, 5], exponents: [0], 
value: array([0.62454385, 0.47055387, 0.76008993, 0.5802395 , 0.8820666 ,
       0.80624735, 0.85952926, 0.67802954, 0.11540425, 0.22354817],
      dtype=float32)
%onnx::Equal_1, shape: [1], exponents: [0], 
value: array([0.41596645], dtype=float32)


test outputs value:
%2, shape: [2, 5], exponents: [0], 
value: array([False, False, False, False, False, False, False, False, False,
       False])