graph main_graph (
  %onnx::Mul_0[INT8, 10x1x5x5], exponents: [-6]
  %onnx::Mul_1[INT8, 1x1x5x5], exponents: [-5]
) {
  %2 = Mul[quant_type = 'S8'](%onnx::Mul_0, %onnx::Mul_1)
  return %2
}


initializers value:



values info:
%2[INT8, 10x1x5x5], exponents: [-5]
%onnx::Mul_0[INT8, 10x1x5x5], exponents: [-6]
%onnx::Mul_1[INT8, 1x1x5x5], exponents: [-5]


test inputs value:
%onnx::Mul_0, shape: [10, 1, 5, 5], exponents: [-6], 
value: array([12, 38, 47, 61, 50, 33, 37, 60,  9, 44, 25, 43, 49, 36, 15, 43, 17,
        0, 22, 37, 51, 55, 53, 30, 15, 37, 12, 23, 16, 59, 17, 53, 55, 44,
        6, 36,  3, 45, 18, 24,  0, 42, 63, 29,  4, 47, 42, 39, 56, 34, 44,
        5, 28, 57, 20, 28, 23, 27, 21, 18, 40,  9, 38, 34, 29, 45, 18, 23,
       30, 39,  9, 18, 18,  8,  4, 15,  2, 10,  9, 49, 24, 27, 23, 42, 37,
       14,  9, 55,  3, 50, 10, 60, 19, 34, 27, 27, 22, 62, 27, 57,  8, 33,
       23, 26, 32, 54, 39, 16, 35, 48, 30, 59,  3,  0, 27, 58, 25, 62,  4,
       62, 10, 11, 50, 47, 18, 46, 31, 24, 47,  4, 13, 49,  3, 39, 27, 18,
       19, 17, 46, 33, 39, 15, 23,  3, 25, 21, 48, 18, 48, 44, 53, 16, 53,
       16, 45, 59, 55, 44, 15, 30, 10, 42,  2, 55, 53, 11,  2, 45, 46, 20,
       36,  7, 16, 58,  7,  7,  5, 34, 17, 16,  5, 37, 47, 58, 36, 46, 61,
        9,  3, 21, 35, 32, 13, 59, 63,  7, 25,  3, 30, 15, 36, 42,  1, 12,
       38, 17, 20, 54, 58, 15, 41,  2, 27, 19,  1,  5, 56, 63, 29,  1, 58,
        8, 47, 13, 31, 23,  8, 37, 20, 36, 22, 54, 25, 11, 14, 55, 15,  6,
       64, 42, 63, 13,  2,  0, 61, 19, 12, 46,  8, 63], dtype=int8)
%onnx::Mul_1, shape: [1, 1, 5, 5], exponents: [-5], 
value: array([23, 15, 21,  8, 25,  2, 17,  9, 31,  4, 26, 15, 19, 28, 11, 30, 29,
       32, 29, 15, 22, 25,  4,  8, 23], dtype=int8)


test outputs value:
%2, shape: [10, 1, 5, 5], exponents: [-5], 
value: array([ 4,  9, 15,  8, 20,  1, 10,  8,  4,  3, 10, 10, 15, 16,  3, 20,  8,
        0, 10,  9, 18, 21,  3,  4,  5, 13,  3,  8,  2, 23,  1, 14,  8, 21,
        0, 15,  1, 13,  8,  4,  0, 19, 32, 13,  1, 16, 16,  2,  7, 12, 16,
        1,  9,  7,  8,  1,  6,  4, 10,  1, 16,  2, 11, 15,  5, 21,  8, 12,
       14,  9,  3,  7,  1,  1,  1,  5,  0,  3,  1, 19,  1,  7,  3, 20,  2,
        6,  2, 16,  1,  9,  5, 27, 10, 15,  6,  9,  9,  4,  3, 20,  3,  8,
        8,  3, 12,  2, 10,  2, 17,  3, 12, 14,  1,  0,  5, 27, 11, 31,  2,
       15,  3,  4,  3,  6,  6, 17,  7,  8,  6,  2,  0, 13,  0, 19,  2,  7,
        4,  5, 20,  6, 18,  7, 12,  1,  6,  7, 19,  1,  6, 16, 19,  4, 17,
        2, 18,  2, 15,  6,  7,  2,  4, 10,  1, 24,  9,  5,  1, 22, 21,  5,
       12,  3,  1,  7,  3,  3,  1, 11,  2,  6,  0, 10,  7, 28,  2, 19, 14,
        3,  1,  4, 16, 14,  6, 27, 15,  2, 10,  0,  4,  5, 13, 10,  0,  2,
       15,  1,  5,  8, 28,  1, 17,  0,  8,  8,  0,  2, 25, 32, 13,  0, 20,
        3,  3,  2, 11,  8,  2, 12,  2, 14,  1, 14,  4,  5,  1, 22,  4,  2,
       28,  7, 30,  6,  1,  0, 14,  7,  5,  3,  1, 23], dtype=int8)