graph main_graph (
  %onnx::Mul_0[INT8, 2x5], exponents: [-6]
  %onnx::Mul_1[INT8, 1], exponents: [-9]
) {
  %2 = Mul[quant_type = 'S8'](%onnx::Mul_0, %onnx::Mul_1)
  return %2
}


initializers value:



values info:
%2[INT8, 2x5], exponents: [-8]
%onnx::Mul_0[INT8, 2x5], exponents: [-6]
%onnx::Mul_1[INT8, 1], exponents: [-9]


test inputs value:
%onnx::Mul_0, shape: [2, 5], exponents: [-6], 
value: array([59, 49, 15, 64, 40, 46, 48, 11, 31, 40], dtype=int8)
%onnx::Mul_1, shape: [1], exponents: [-9], 
value: array([127], dtype=int8)


test outputs value:
%2, shape: [2, 5], exponents: [-8], 
value: array([59, 49, 15, 64, 40, 46, 48, 11, 31, 40], dtype=int8)