graph main_graph (
  %onnx::Mul_0[INT8, 2x3x4x5], exponents: [-6]
  %onnx::Mul_1[INT8, 1x1x1x5], exponents: [-6]
) {
  %2 = Mul[quant_type = 'S8'](%onnx::Mul_0, %onnx::Mul_1)
  return %2
}


initializers value:



values info:
%2[INT8, 2x3x4x5], exponents: [-5]
%onnx::Mul_0[INT8, 2x3x4x5], exponents: [-6]
%onnx::Mul_1[INT8, 1x1x1x5], exponents: [-6]


test inputs value:
%onnx::Mul_0, shape: [2, 3, 4, 5], exponents: [-6], 
value: array([31, 18, 41, 16, 20, 33, 43, 17, 42, 34, 49, 24,  5, 17, 27, 28, 42,
       25, 56,  8, 48, 56, 61, 36, 57, 27, 12, 33, 31, 56, 42, 52,  3, 26,
       13, 29,  1, 46, 24, 50, 29, 59, 27,  2, 41, 47, 25, 20, 28,  9, 55,
       28, 50, 45, 64, 48,  5, 53, 30, 42, 11, 28,  9, 48, 34, 52, 23, 48,
        8, 32, 47, 31, 39, 38, 28, 19, 17,  4, 46, 39, 59, 37, 35, 21, 21,
       20, 50,  7, 62, 38, 48, 11, 40, 40, 60, 52, 12, 28,  9, 53, 38, 13,
       44, 57, 27, 49, 39, 11,  1,  7, 17,  8,  4, 12, 42, 55, 61, 27, 22,
       64], dtype=int8)
%onnx::Mul_1, shape: [1, 1, 1, 5], exponents: [-6], 
value: array([54,  8, 35, 44, 34], dtype=int8)


test outputs value:
%2, shape: [2, 3, 4, 5], exponents: [-5], 
value: array([13,  1, 11,  6,  5, 14,  3,  5, 14,  9, 21,  2,  1,  6,  7, 12,  3,
        7, 19,  2, 20,  4, 17, 12, 15, 11,  1,  9, 11, 15, 18,  3,  1,  9,
        3, 12,  0, 13,  8, 13, 12,  4,  7,  1, 11, 20,  2,  5, 10,  2, 23,
        2, 14, 15, 17, 20,  0, 14, 10, 11,  5,  2,  2, 16,  9, 22,  1, 13,
        3,  8, 20,  2, 11, 13,  7,  8,  1,  1, 16, 10, 25,  2, 10,  7,  6,
        8,  3,  2, 21, 10, 20,  1, 11, 14, 16, 22,  1,  8,  3, 14, 16,  1,
       12, 20,  7, 21,  2,  3,  0,  2,  7,  0,  1,  4, 11, 23,  4,  7,  8,
       17], dtype=int8)