graph main_graph (
  %onnx::Mul_0[INT8, 5x2x48], exponents: [-6]
  %onnx::Mul_1[INT8, 1], exponents: [-10]
) {
  %2 = Mul[quant_type = 'S8'](%onnx::Mul_0, %onnx::Mul_1)
  return %2
}


initializers value:



values info:
%2[INT8, 5x2x48], exponents: [-8]
%onnx::Mul_0[INT8, 5x2x48], exponents: [-6]
%onnx::Mul_1[INT8, 1], exponents: [-10]


test inputs value:
%onnx::Mul_0, shape: [5, 2, 48], exponents: [-6], 
value: array([34, 13, 55, 16, 28, 11, 34,  9, 19, 22, 45, 38, 25, 54,  2, 59, 37,
       37, 58, 25,  5, 59, 30, 20, 44, 28,  3, 39, 49, 23, 56, 61, 37, 12,
       54, 12, 29, 59, 27, 42, 22, 22, 16,  3, 48, 32, 44, 11, 55, 34, 47,
       35, 54, 20, 56, 43, 19, 58, 58, 36, 29, 21, 44,  8, 44, 41, 12, 56,
        7,  6, 48, 60,  2, 61,  7, 45, 45, 59, 37, 42, 55, 15, 48,  8, 45,
       23, 43, 19, 17, 63, 43, 53, 39,  3, 23, 17, 10, 43, 37, 14, 42, 13,
        2, 63, 51, 10, 23, 48, 45, 57, 29, 15, 53, 10, 56, 46, 62, 50,  1,
        4, 38, 52, 61, 53, 14, 25, 40, 50, 59, 58, 20, 61, 14, 14, 58, 64,
       48, 60, 23, 13, 50, 35, 13, 64, 14, 46, 56, 28, 35, 58, 50,  7,  1,
       45, 25,  3, 25, 23, 63, 39, 23, 39, 63, 44, 38, 34, 36, 17,  7, 30,
        3, 32, 58, 40, 59, 45, 38, 37, 35, 15, 56, 61,  9, 37, 39, 17, 37,
        0, 46, 24, 51, 39, 48,  8, 31, 53, 63,  6, 63, 40, 20,  4, 30, 13,
       18,  5, 19, 15, 37, 21, 60, 15, 50, 31, 48, 63, 22, 11, 29, 40,  3,
       24, 34, 11, 43, 36, 37, 58, 42, 57, 57,  5, 20, 22,  4, 42,  3, 18,
       33, 25, 37, 49, 31, 12,  3,  0, 20, 36, 59, 15, 30, 20, 14, 31, 36,
       48, 59, 50, 14,  7, 63, 40, 52, 56, 63, 53, 58,  2, 16,  3, 15, 60,
       56, 62, 37, 38, 53, 14,  7, 44, 47, 31,  4, 58, 27, 38, 39, 54, 21,
       24, 44, 24, 39, 52,  6, 14, 21, 21,  5, 51, 38, 49, 26,  4,  7, 45,
        1, 22,  8, 21, 52,  3, 24, 62, 43, 61, 47, 25, 34,  1, 13, 41, 40,
       42, 14, 10, 26, 26,  5, 32,  7,  7, 41,  5, 11, 10, 52, 26, 28, 45,
        9, 47, 43, 15, 30, 32, 61, 43, 38, 45,  9, 50, 39, 11,  8, 43,  2,
       48, 64, 15, 62, 40, 64, 28, 56, 27, 10,  4,  4, 32, 32, 46, 20,  2,
       50, 20,  3, 28,  1, 63, 13, 20,  8, 30, 26, 45, 46, 52, 53, 61, 56,
       12, 41, 37,  4, 12,  6, 40, 13, 23,  3, 21, 46, 42, 62, 31, 28, 25,
       20, 52,  9, 23, 57, 55,  6, 35, 33, 15, 41, 24, 57, 12, 61, 21, 43,
        7, 26, 32, 47, 43, 30, 55, 18,  7, 43, 41, 58, 19,  7,  9, 38, 59,
       37, 17, 14, 51, 64, 62, 39, 60, 12, 11, 43, 18, 25,  1, 11, 21, 28,
       38, 58, 46, 63, 53,  6,  3, 21, 17, 42, 59, 40, 41, 37, 45, 21, 58,
       42,  6, 22, 36], dtype=int8)
%onnx::Mul_1, shape: [1], exponents: [-10], 
value: array([127], dtype=int8)


test outputs value:
%2, shape: [5, 2, 48], exponents: [-8], 
value: array([17,  6, 27,  8, 14,  5, 17,  4,  9, 11, 22, 19, 12, 27,  1, 29, 18,
       18, 29, 12,  2, 29, 15, 10, 22, 14,  1, 19, 24, 11, 28, 30, 18,  6,
       27,  6, 14, 29, 13, 21, 11, 11,  8,  1, 24, 16, 22,  5, 27, 17, 23,
       17, 27, 10, 28, 21,  9, 29, 29, 18, 14, 10, 22,  4, 22, 20,  6, 28,
        3,  3, 24, 30,  1, 30,  3, 22, 22, 29, 18, 21, 27,  7, 24,  4, 22,
       11, 21,  9,  8, 31, 21, 26, 19,  1, 11,  8,  5, 21, 18,  7, 21,  6,
        1, 31, 25,  5, 11, 24, 22, 28, 14,  7, 26,  5, 28, 23, 31, 25,  0,
        2, 19, 26, 30, 26,  7, 12, 20, 25, 29, 29, 10, 30,  7,  7, 29, 32,
       24, 30, 11,  6, 25, 17,  6, 32,  7, 23, 28, 14, 17, 29, 25,  3,  0,
       22, 12,  1, 12, 11, 31, 19, 11, 19, 31, 22, 19, 17, 18,  8,  3, 15,
        1, 16, 29, 20, 29, 22, 19, 18, 17,  7, 28, 30,  4, 18, 19,  8, 18,
        0, 23, 12, 25, 19, 24,  4, 15, 26, 31,  3, 31, 20, 10,  2, 15,  6,
        9,  2,  9,  7, 18, 10, 30,  7, 25, 15, 24, 31, 11,  5, 14, 20,  1,
       12, 17,  5, 21, 18, 18, 29, 21, 28, 28,  2, 10, 11,  2, 21,  1,  9,
       16, 12, 18, 24, 15,  6,  1,  0, 10, 18, 29,  7, 15, 10,  7, 15, 18,
       24, 29, 25,  7,  3, 31, 20, 26, 28, 31, 26, 29,  1,  8,  1,  7, 30,
       28, 31, 18, 19, 26,  7,  3, 22, 23, 15,  2, 29, 13, 19, 19, 27, 10,
       12, 22, 12, 19, 26,  3,  7, 10, 10,  2, 25, 19, 24, 13,  2,  3, 22,
        0, 11,  4, 10, 26,  1, 12, 31, 21, 30, 23, 12, 17,  0,  6, 20, 20,
       21,  7,  5, 13, 13,  2, 16,  3,  3, 20,  2,  5,  5, 26, 13, 14, 22,
        4, 23, 21,  7, 15, 16, 30, 21, 19, 22,  4, 25, 19,  5,  4, 21,  1,
       24, 32,  7, 31, 20, 32, 14, 28, 13,  5,  2,  2, 16, 16, 23, 10,  1,
       25, 10,  1, 14,  0, 31,  6, 10,  4, 15, 13, 22, 23, 26, 26, 30, 28,
        6, 20, 18,  2,  6,  3, 20,  6, 11,  1, 10, 23, 21, 31, 15, 14, 12,
       10, 26,  4, 11, 28, 27,  3, 17, 16,  7, 20, 12, 28,  6, 30, 10, 21,
        3, 13, 16, 23, 21, 15, 27,  9,  3, 21, 20, 29,  9,  3,  4, 19, 29,
       18,  8,  7, 25, 32, 31, 19, 30,  6,  5, 21,  9, 12,  0,  5, 10, 14,
       19, 29, 23, 31, 26,  3,  1, 10,  8, 21, 29, 20, 20, 18, 22, 10, 29,
       21,  3, 11, 18], dtype=int8)