graph main_graph (
  %onnx::Mul_0[INT8, 5], exponents: [-8]
  %onnx::Mul_1[INT8, 1], exponents: [-10]
) {
  %2 = Mul[quant_type = 'S8'](%onnx::Mul_0, %onnx::Mul_1)
  return %2
}


initializers value:



values info:
%2[INT8, 5], exponents: [-11]
%onnx::Mul_0[INT8, 5], exponents: [-8]
%onnx::Mul_1[INT8, 1], exponents: [-10]


test inputs value:
%onnx::Mul_0, shape: [5], exponents: [-8], 
value: array([127, 127, 122, 127,  29], dtype=int8)
%onnx::Mul_1, shape: [1], exponents: [-10], 
value: array([127], dtype=int8)


test outputs value:
%2, shape: [5], exponents: [-11], 
value: array([126, 126, 121, 126,  29], dtype=int8)