graph main_graph (
  %onnx::Mul_0[INT8, 48], exponents: [-7]
  %onnx::Mul_1[INT8, 1], exponents: [-7]
) {
  %2 = Mul[quant_type = 'S8'](%onnx::Mul_0, %onnx::Mul_1)
  return %2
}


initializers value:



values info:
%2[INT8, 48], exponents: [-7]
%onnx::Mul_0[INT8, 48], exponents: [-7]
%onnx::Mul_1[INT8, 1], exponents: [-7]


test inputs value:
%onnx::Mul_0, shape: [48], exponents: [-7], 
value: array([119,  72,  99,  64, 118,  94,  37,  59,  41,  61,  98,  31,  62,
        65,  92, 126,  23,  70,  75,  11,  32, 127, 101,  17,   4, 102,
        47,  10,  60,  25,   7,  76,  54,  21, 127, 102, 118,  58,  40,
        42,  87,  71,  63, 101, 100,  15,  21, 113], dtype=int8)
%onnx::Mul_1, shape: [1], exponents: [-7], 
value: array([115], dtype=int8)


test outputs value:
%2, shape: [48], exponents: [-7], 
value: array([107,  65,  89,  58, 106,  84,  33,  53,  37,  55,  88,  28,  56,
        58,  83, 113,  21,  63,  67,  10,  29, 114,  91,  15,   4,  92,
        42,   9,  54,  22,   6,  68,  49,  19, 114,  92, 106,  52,  36,
        38,  78,  64,  57,  91,  90,  13,  19, 102], dtype=int8)