graph main_graph (
  %onnx::Mul_0[INT8, 1x3x4x5], exponents: [-5]
  %onnx::Mul_1[INT8, 2x1x1x1], exponents: [-7]
) {
  %2 = Mul[quant_type = 'S8'](%onnx::Mul_0, %onnx::Mul_1)
  return %2
}


initializers value:



values info:
%2[INT8, 2x3x4x5], exponents: [-6]
%onnx::Mul_0[INT8, 1x3x4x5], exponents: [-5]
%onnx::Mul_1[INT8, 2x1x1x1], exponents: [-7]


test inputs value:
%onnx::Mul_0, shape: [1, 3, 4, 5], exponents: [-5], 
value: array([ 7, 26, 15,  1,  9,  1, 29, 28,  4, 18, 11,  2,  4, 14, 30, 25,  8,
       26, 23, 23, 24,  3, 30,  1,  7, 22, 27, 12, 15, 18,  4,  6, 21, 31,
       19,  7,  4,  4,  7, 27,  8, 18,  8, 19,  4,  8,  8,  1, 23, 16, 15,
        6, 20, 32, 25,  8, 24, 24, 29, 31], dtype=int8)
%onnx::Mul_1, shape: [2, 1, 1, 1], exponents: [-7], 
value: array([22, 18], dtype=int8)


test outputs value:
%2, shape: [2, 3, 4, 5], exponents: [-6], 
value: array([ 2,  9,  5,  0,  3,  0, 10, 10,  1,  6,  4,  1,  1,  5, 10,  9,  3,
        9,  8,  8,  8,  1, 10,  0,  2,  8,  9,  4,  5,  6,  1,  2,  7, 11,
        7,  2,  1,  1,  2,  9,  3,  6,  3,  7,  1,  3,  3,  0,  8,  6,  5,
        2,  7, 11,  9,  3,  8,  8, 10, 11,  2,  7,  4,  0,  3,  0,  8,  8,
        1,  5,  3,  1,  1,  4,  8,  7,  2,  7,  6,  6,  7,  1,  8,  0,  2,
        6,  8,  3,  4,  5,  1,  2,  6,  9,  5,  2,  1,  1,  2,  8,  2,  5,
        2,  5,  1,  2,  2,  0,  6,  4,  4,  2,  6,  9,  7,  2,  7,  7,  8,
        9], dtype=int8)