graph main_graph (
  %onnx::Mul_0[INT8, 8x2x5], exponents: [-7]
  %onnx::Mul_1[INT8, 2x1], exponents: [-8]
) {
  %2 = Mul[quant_type = 'S8'](%onnx::Mul_0, %onnx::Mul_1)
  return %2
}


initializers value:



values info:
%2[INT8, 8x2x5], exponents: [-8]
%onnx::Mul_0[INT8, 8x2x5], exponents: [-7]
%onnx::Mul_1[INT8, 2x1], exponents: [-8]


test inputs value:
%onnx::Mul_0, shape: [8, 2, 5], exponents: [-7], 
value: array([110, 111,  45, 116,  25, 101,  17, 101,  40,  86, 115,  34,  35,
        64,  21, 118,  27,  98,  44,  18, 124, 106,  19,  67,  63,  91,
       127,  19,  65,  64,  11,  84,  78,  98,  70,  94,  11, 120,   9,
        93,   7,  48,  59,  66,  18,  95, 102,  19,  28, 125,  58,  37,
       113,  43,   2,  93,  96,  23,  16, 120,  55,  57, 112,  59,  85,
        93,  94,  29,  71, 106, 108,   5,  44,  42, 124,  54,  62,  85,
       101,  26], dtype=int8)
%onnx::Mul_1, shape: [2, 1], exponents: [-8], 
value: array([66, 49], dtype=int8)


test outputs value:
%2, shape: [8, 2, 5], exponents: [-8], 
value: array([57, 57, 23, 60, 13, 39,  7, 39, 15, 33, 59, 18, 18, 33, 11, 45, 10,
       38, 17,  7, 64, 55, 10, 35, 32, 35, 49,  7, 25, 24,  6, 43, 40, 51,
       36, 36,  4, 46,  3, 36,  4, 25, 30, 34,  9, 36, 39,  7, 11, 48, 30,
       19, 58, 22,  1, 36, 37,  9,  6, 46, 28, 29, 58, 30, 44, 36, 36, 11,
       27, 41, 56,  3, 23, 22, 64, 21, 24, 33, 39, 10], dtype=int8)