graph main_graph (
  %onnx::Mul_0[INT8, 1x1x4x5], exponents: [-6]
  %onnx::Mul_1[INT8, 2x3x1x1], exponents: [-6]
) {
  %2 = Mul[quant_type = 'S8'](%onnx::Mul_0, %onnx::Mul_1)
  return %2
}


initializers value:



values info:
%2[INT8, 2x3x4x5], exponents: [-5]
%onnx::Mul_0[INT8, 1x1x4x5], exponents: [-6]
%onnx::Mul_1[INT8, 2x3x1x1], exponents: [-6]


test inputs value:
%onnx::Mul_0, shape: [1, 1, 4, 5], exponents: [-6], 
value: array([33, 45, 37, 50, 15,  7,  4,  1, 39, 25, 58, 44, 25, 51, 13, 26, 25,
       64,  1,  5], dtype=int8)
%onnx::Mul_1, shape: [2, 3, 1, 1], exponents: [-6], 
value: array([ 2, 12, 62, 41, 13, 22], dtype=int8)


test outputs value:
%2, shape: [2, 3, 4, 5], exponents: [-5], 
value: array([ 1,  1,  1,  1,  0,  0,  0,  0,  1,  0,  1,  1,  0,  1,  0,  0,  0,
        1,  0,  0,  3,  4,  3,  5,  1,  1,  0,  0,  4,  2,  5,  4,  2,  5,
        1,  2,  2,  6,  0,  0, 16, 22, 18, 24,  7,  3,  2,  0, 19, 12, 28,
       21, 12, 25,  6, 13, 12, 31,  0,  2, 11, 14, 12, 16,  5,  2,  1,  0,
       12,  8, 19, 14,  8, 16,  4,  8,  8, 20,  0,  2,  3,  5,  4,  5,  2,
        1,  0,  0,  4,  3,  6,  4,  3,  5,  1,  3,  3,  6,  0,  1,  6,  8,
        6,  9,  3,  1,  1,  0,  7,  4, 10,  8,  4,  9,  2,  4,  4, 11,  0,
        1], dtype=int8)