graph main_graph (
  %onnx::Add_0[INT8, 2x3x4x5], exponents: [-5]
  %onnx::Add_1[INT8, 1x1x1x1], exponents: [-5]
) {
  %2 = Add[quant_type = 'S8'](%onnx::Add_0, %onnx::Add_1)
  return %2
}


initializers value:



values info:
%onnx::Add_0[INT8, 2x3x4x5], exponents: [-5]
%2[INT8, 2x3x4x5], exponents: [-5]
%onnx::Add_1[INT8, 1x1x1x1], exponents: [-5]


test inputs value:
%onnx::Add_0, shape: [2, 3, 4, 5], exponents: [-5], 
value: array([19, 14, 12, 21, 18, 29, 17, 16, 27, 31, 29, 19,  1, 22,  4, 23, 23,
       24, 14,  3, 16, 11, 28, 27,  3, 11, 13, 22, 18,  4, 27, 19, 12, 32,
       22,  1, 20, 20,  1, 24, 32,  5, 27, 32, 23, 18,  9,  5, 23, 24,  6,
       26, 21, 24,  7,  6, 31,  9, 22,  3,  8,  9, 18, 18,  9,  4, 26,  5,
       14, 17, 25, 13,  5, 13, 13, 30, 13, 12, 15, 21, 29, 25,  6,  9, 15,
       24, 17, 21, 18, 16,  8, 11,  5, 27, 22, 13,  5, 20, 13,  2, 13, 29,
       28, 29, 25, 13,  8, 13,  8, 23, 27, 22, 27,  7, 12, 15, 27, 16,  1,
       12], dtype=int8)
%onnx::Add_1, shape: [1, 1, 1, 1], exponents: [-5], 
value: array([27], dtype=int8)


test outputs value:
%2, shape: [2, 3, 4, 5], exponents: [-5], 
value: array([46, 41, 39, 48, 45, 56, 44, 43, 54, 58, 56, 46, 28, 49, 31, 50, 50,
       51, 41, 30, 43, 38, 55, 54, 30, 38, 40, 49, 45, 31, 54, 46, 39, 59,
       49, 28, 47, 47, 28, 51, 59, 32, 54, 59, 50, 45, 36, 32, 50, 51, 33,
       53, 48, 51, 34, 33, 58, 36, 49, 30, 35, 36, 45, 45, 36, 31, 53, 32,
       41, 44, 52, 40, 32, 40, 40, 57, 40, 39, 42, 48, 56, 52, 33, 36, 42,
       51, 44, 48, 45, 43, 35, 38, 32, 54, 49, 40, 32, 47, 40, 29, 40, 56,
       55, 56, 52, 40, 35, 40, 35, 50, 54, 49, 54, 34, 39, 42, 54, 43, 28,
       39], dtype=int8)