graph main_graph (
  %onnx::Add_0[INT8, 1x1x1x5], exponents: [-5]
  %onnx::Add_1[INT8, 2x3x4x5], exponents: [-5]
) {
  %2 = Add[quant_type = 'S8'](%onnx::Add_0, %onnx::Add_1)
  return %2
}


initializers value:



values info:
%onnx::Add_0[INT8, 1x1x1x5], exponents: [-5]
%2[INT8, 2x3x4x5], exponents: [-5]
%onnx::Add_1[INT8, 2x3x4x5], exponents: [-5]


test inputs value:
%onnx::Add_0, shape: [1, 1, 1, 5], exponents: [-5], 
value: array([ 1, 29, 12, 22,  1], dtype=int8)
%onnx::Add_1, shape: [2, 3, 4, 5], exponents: [-5], 
value: array([19, 31, 14, 27, 27,  3,  7, 21, 13, 21, 29, 30, 14,  8,  1, 28, 23,
       23,  4,  5,  4, 11, 17, 16, 12, 28,  1, 24, 11, 22, 10, 13,  3,  3,
       20, 10, 30, 31,  0,  2, 31, 16, 20, 28, 28, 10, 24, 18, 31, 13,  1,
       32,  9, 20, 21, 24, 17, 19, 24, 22,  6, 18, 31, 21, 12,  4, 31, 22,
       14, 17, 29,  5, 14,  8, 22, 29, 11,  7, 31, 28, 17, 14, 13, 16,  3,
       31, 13, 15, 19, 12,  2,  8, 27,  5, 10, 10, 22,  5, 17, 22,  6,  1,
        1,  5,  4, 25, 16, 15,  7, 11, 21, 14, 15, 12,  3, 12, 29, 11, 10,
       29], dtype=int8)


test outputs value:
%2, shape: [2, 3, 4, 5], exponents: [-5], 
value: array([20, 60, 26, 49, 28,  4, 36, 33, 35, 22, 30, 59, 26, 30,  2, 29, 52,
       35, 26,  6,  5, 40, 29, 38, 13, 29, 30, 36, 33, 23, 11, 42, 15, 25,
       21, 11, 59, 43, 22,  3, 32, 45, 32, 50, 29, 11, 53, 30, 53, 14,  2,
       61, 21, 42, 22, 25, 46, 31, 46, 23,  7, 47, 43, 43, 13,  5, 60, 34,
       36, 18, 30, 34, 26, 30, 23, 30, 40, 19, 53, 29, 18, 43, 25, 38,  4,
       32, 42, 27, 41, 13,  3, 37, 39, 27, 11, 11, 51, 17, 39, 23,  7, 30,
       13, 27,  5, 26, 45, 27, 29, 12, 22, 43, 27, 34,  4, 13, 58, 23, 32,
       30], dtype=int8)