graph main_graph (
  %onnx::Add_0[INT8, 1x5x5x31], exponents: [-5]
  %onnx::Add_1[INT8, 1x1x1x31], exponents: [-5]
) {
  %2 = Add[quant_type = 'S8'](%onnx::Add_0, %onnx::Add_1)
  return %2
}


initializers value:



values info:
%onnx::Add_0[INT8, 1x5x5x31], exponents: [-5]
%2[INT8, 1x5x5x31], exponents: [-5]
%onnx::Add_1[INT8, 1x1x1x31], exponents: [-5]


test inputs value:
%onnx::Add_0, shape: [1, 5, 5, 31], exponents: [-5], 
value: array([19, 32, 23, 20, 26, 13, 18, 19, 16,  7,  7, 13,  9,  4,  6, 18, 11,
       20, 17, 19, 29, 21, 16, 25,  3,  0, 28,  3, 29, 25, 12,  3,  3, 13,
       31,  9, 26, 20, 10, 21, 14, 28, 19,  9,  7, 18,  3, 19, 18, 19, 19,
        8,  2,  5, 12,  1, 23, 20,  3, 17, 25, 23,  2, 12, 17, 31,  4, 18,
        1, 31, 15, 11, 15, 11, 27, 14, 30, 18,  3,  2,  4, 30,  8, 31, 30,
       24, 20, 14, 21, 22, 25, 10, 25, 15, 27, 23, 12, 25,  4, 22, 10,  4,
       16, 18,  3,  4, 23,  4,  3, 18, 18, 22, 22,  6, 22,  5, 14,  5, 28,
       18, 16, 18, 28, 11, 32, 30, 26,  7, 28,  3, 25, 30,  8, 28,  6,  8,
       10, 23, 24,  9, 29,  6, 17, 19,  4,  7, 17,  8,  3, 12, 17, 12,  4,
       12,  4,  2,  5,  1, 18,  9,  8, 26,  6, 14,  5,  9, 31, 18, 10,  3,
        8,  1, 12, 20,  9, 29, 20, 13,  7, 24, 29, 11, 15, 30, 22, 11,  2,
       23, 25,  9, 27, 11, 28, 22, 25,  5,  8, 20,  9,  9, 14, 13, 25,  5,
        4,  4, 17, 26, 18,  2, 15, 24,  4,  6,  4, 12, 14, 21, 27, 19, 27,
       24, 22, 25, 11, 10, 13,  4, 11, 15,  3,  4, 10,  4,  6,  5, 10,  4,
       29,  8, 23, 29, 22,  7, 15, 27, 27, 27, 22,  3,  9,  3, 11,  5, 26,
       20,  8,  7,  7, 22,  1,  2, 25, 11, 16, 20,  0, 26, 31, 22, 14,  7,
       15, 15, 16, 13, 27,  0, 31, 17, 24, 10,  5, 18,  5, 12,  4, 20, 16,
       21, 27, 20, 20, 11, 11, 16,  6, 19, 19, 20, 28,  4,  8,  6, 16, 13,
        9, 11, 28, 19, 10, 24, 15, 19, 31,  7, 15, 19, 22, 14,  5, 25, 23,
        2,  2, 18, 16, 29,  7,  7,  2,  3,  1, 12,  6, 10, 21,  0, 26, 22,
       20, 12, 15,  5, 29, 10,  6,  5, 16, 31, 21, 15,  2, 30, 10, 13,  1,
       15,  5,  8, 17, 12, 24, 16,  9,  9, 30, 29, 11, 30, 27,  7, 30, 16,
       26, 27, 14,  1, 31, 24,  3,  4, 27,  2, 23,  8, 29, 13, 17,  9,  5,
       11, 29, 21, 32, 16, 22, 19,  8, 29, 25,  7, 28, 31, 13, 18, 26, 29,
       18, 23, 30,  1, 24,  4,  0, 31, 23, 11, 29, 20, 16,  1, 12, 29,  9,
       28, 27, 13,  5,  0, 14, 23,  9, 14,  7, 17,  3,  1,  5,  6, 25, 20,
       11,  5,  3,  3, 22,  6, 25,  8, 11,  0,  5,  3, 14, 27, 18, 17, 26,
       21, 23, 18, 30, 29,  3,  5,  1, 29, 11, 29,  5, 26, 24, 29,  2, 17,
        9, 31,  0, 18, 31, 21,  7, 22, 25, 22,  5, 27, 27, 12,  7,  6, 22,
       17, 28, 10, 13,  8, 22, 19, 14, 17, 14,  4, 25, 19, 32, 26, 30, 28,
       13, 27, 10, 21, 22, 24, 20, 20,  2,  4,  6, 24,  0, 15,  4, 19,  2,
       16, 21, 15,  5, 29,  6, 22, 21, 17,  4, 13, 26, 18, 23, 31, 13, 11,
       28, 29, 10, 21, 27, 17, 15, 22,  3,  2, 23, 30, 22,  4, 29, 28,  3,
       23, 30, 13, 14,  2, 23,  7, 12, 16, 30, 22, 24, 24, 23, 30, 10, 14,
        2, 30, 25, 14, 20, 29, 25,  6,  4, 10, 10, 26, 16,  3, 32, 19, 23,
       30, 14,  6, 16, 29,  4, 18, 23, 14, 18,  5,  6, 10, 25, 13, 12, 28,
       23, 20, 15,  9,  1,  3,  2, 16,  2,  4,  1, 29,  5, 18, 20, 11, 24,
       28, 14, 30, 28, 31, 31,  2,  6, 16, 11,  1, 23, 27, 14,  6, 12,  9,
       27, 18, 17,  4, 24, 31, 14, 29,  6, 25, 20, 30, 24, 30,  4, 14, 24,
       14,  7, 25, 31,  7,  2,  1, 22, 23, 25, 12, 29, 18, 32, 19, 16, 31,
       26, 13, 24,  5, 24, 25, 15, 31,  7, 30, 31,  8, 13, 30, 22, 25, 16,
       19,  1, 27, 21,  5, 12, 26,  8, 22, 31,  8,  9,  6, 32, 26, 18, 25,
       26, 24, 28, 15, 28, 16, 19,  2, 25, 22, 12, 17, 24, 26, 21,  7, 15,
        9, 14, 26,  5,  5, 16, 13, 20, 28,  2, 21, 22, 26, 32, 20, 17, 12,
       25, 30, 16, 26, 25,  1, 24, 28, 20, 30, 10,  9,  0, 11, 11,  9,  9,
       20, 32, 23,  8,  9,  8, 17, 27, 20,  5], dtype=int8)
%onnx::Add_1, shape: [1, 1, 1, 31], exponents: [-5], 
value: array([25, 14,  8,  2, 30, 11, 24,  9,  5, 21, 23, 30, 24,  3, 17, 28,  0,
       12,  6, 31, 16, 19,  7,  2, 16, 30, 14, 13, 16, 19, 25], dtype=int8)


test outputs value:
%2, shape: [1, 5, 5, 31], exponents: [-5], 
value: array([44, 46, 31, 22, 56, 24, 42, 28, 21, 28, 30, 43, 33,  7, 23, 46, 11,
       32, 23, 50, 45, 40, 23, 27, 19, 30, 42, 16, 45, 44, 37, 28, 17, 21,
       33, 39, 37, 44, 19, 26, 35, 51, 49, 33, 10, 35, 31, 19, 30, 25, 50,
       24, 21, 12, 14, 17, 53, 34, 16, 33, 44, 48, 27, 26, 25, 33, 34, 29,
       25, 40, 20, 32, 38, 41, 51, 17, 47, 46,  3, 14, 10, 61, 24, 50, 37,
       26, 36, 44, 35, 35, 41, 29, 50, 40, 41, 31, 14, 55, 15, 46, 19,  9,
       37, 41, 33, 28, 26, 21, 31, 18, 30, 28, 53, 22, 41, 12, 16, 21, 58,
       32, 29, 34, 47, 36, 57, 44, 34,  9, 58, 14, 49, 39, 13, 49, 29, 38,
       34, 26, 41, 37, 29, 18, 23, 50, 20, 26, 24, 10, 19, 42, 31, 25, 20,
       31, 29, 27, 19,  9, 20, 39, 19, 50, 15, 19, 26, 32, 61, 42, 13, 20,
       36,  1, 24, 26, 40, 45, 39, 20,  9, 40, 59, 25, 28, 46, 41, 36, 27,
       37, 33, 11, 57, 22, 52, 31, 30, 26, 31, 50, 33, 12, 31, 41, 25, 17,
       10, 35, 33, 45, 25,  4, 31, 54, 18, 19, 20, 31, 39, 46, 41, 27, 29,
       54, 33, 49, 20, 15, 34, 27, 41, 39,  6, 21, 38,  4, 18, 11, 41, 20,
       48, 15, 25, 45, 52, 21, 28, 43, 46, 52, 47, 17, 17,  5, 41, 16, 50,
       29, 13, 28, 30, 52, 25,  5, 42, 39, 16, 32,  6, 57, 47, 41, 21,  9,
       31, 45, 30, 26, 43, 19, 56, 42, 38, 18,  7, 48, 16, 36, 13, 25, 37,
       44, 57, 44, 23, 28, 39, 16, 18, 25, 50, 36, 47, 11, 10, 22, 46, 27,
       22, 27, 47, 44, 35, 38, 23, 21, 61, 18, 39, 28, 27, 35, 28, 55, 47,
        5, 19, 46, 16, 41, 13, 38, 18, 22,  8, 14, 22, 40, 35, 13, 42, 41,
       45, 37, 29, 13, 31, 40, 17, 29, 25, 36, 42, 38, 32, 54, 13, 30, 29,
       15, 17, 14, 48, 28, 43, 23, 11, 25, 60, 43, 24, 46, 46, 32, 55, 30,
       34, 29, 44, 12, 55, 33,  8, 25, 50, 32, 47, 11, 46, 41, 17, 21, 11,
       42, 45, 40, 39, 18, 38, 49, 22, 42, 41, 26, 53, 56, 27, 26, 28, 59,
       29, 47, 39,  6, 45, 27, 30, 55, 26, 28, 57, 20, 28,  7, 43, 45, 28,
       35, 29, 29, 35, 14, 27, 39, 28, 39, 32, 31, 11,  3, 35, 17, 49, 29,
       16, 26, 26, 33, 46,  9, 42, 36, 11, 12, 11, 34, 30, 46, 25, 19, 42,
       51, 37, 31, 46, 48, 28, 30, 15, 37, 13, 59, 16, 50, 33, 34, 23, 40,
       39, 55,  3, 35, 59, 21, 19, 28, 56, 38, 24, 34, 29, 28, 37, 20, 35,
       33, 47, 35, 38, 22, 30, 21, 44, 28, 38, 13, 30, 40, 55, 56, 54, 31,
       30, 55, 10, 33, 28, 55, 36, 39,  9,  6, 22, 54, 14, 28, 20, 38, 27,
       41, 35, 23,  7, 59, 17, 46, 30, 22, 25, 36, 56, 42, 26, 48, 41, 11,
       40, 35, 41, 37, 46, 24, 17, 38, 33, 16, 36, 46, 41, 29, 54, 42, 11,
       25, 60, 24, 38, 11, 28, 28, 35, 46, 54, 25, 41, 52, 23, 42, 16, 45,
       18, 49, 32, 16, 36, 59, 39, 19, 20, 29, 35, 51, 30, 11, 34, 49, 34,
       54, 23, 11, 37, 52, 34, 42, 26, 31, 46,  5, 18, 16, 56, 29, 31, 35,
       25, 36, 45, 23, 14, 19, 21, 41, 27, 18,  9, 31, 35, 29, 44, 20, 29,
       49, 37, 60, 52, 34, 48, 30,  6, 28, 17, 32, 39, 46, 21,  8, 28, 39,
       41, 31, 33, 23, 49, 56, 28, 37,  8, 55, 31, 54, 33, 35, 25, 37, 54,
       38, 10, 42, 59,  7, 14,  7, 53, 39, 44, 19, 31, 34, 62, 33, 29, 47,
       45, 38, 49, 19, 32, 27, 45, 42, 31, 39, 36, 29, 36, 60, 46, 28, 33,
       47,  1, 39, 27, 36, 28, 45, 15, 24, 47, 38, 23, 19, 48, 45, 43, 50,
       40, 32, 30, 45, 39, 40, 28,  7, 46, 45, 42, 41, 27, 43, 49,  7, 27,
       15, 45, 42, 24, 12, 18, 29, 50, 42, 15, 37, 41, 51, 57, 34, 25, 14,
       55, 41, 40, 35, 30, 22, 47, 58, 44, 33, 27, 37,  0, 23, 17, 40, 25,
       39, 39, 25, 24, 39, 22, 30, 43, 39, 30], dtype=int8)