graph main_graph (
  %onnx::Add_0[INT8, 10x1x5x5], exponents: [-5]
  %onnx::Add_1[INT8, 1x1x5x5], exponents: [-5]
) {
  %2 = Add[quant_type = 'S8'](%onnx::Add_0, %onnx::Add_1)
  return %2
}


initializers value:



values info:
%onnx::Add_0[INT8, 10x1x5x5], exponents: [-5]
%2[INT8, 10x1x5x5], exponents: [-5]
%onnx::Add_1[INT8, 1x1x5x5], exponents: [-5]


test inputs value:
%onnx::Add_0, shape: [10, 1, 5, 5], exponents: [-5], 
value: array([27, 22,  4, 31, 12,  7, 27, 30, 22, 28,  4, 22, 13, 22, 11, 28, 13,
       13,  4, 24, 24, 15, 30, 27, 30, 16, 21,  7, 28,  5,  8,  6, 24, 24,
       11, 12, 28,  1,  5, 28, 26, 21, 20, 12,  3, 14, 11, 31,  8,  6, 19,
       23, 22, 23, 20, 11,  1, 32, 30, 12, 22,  7, 30, 31, 24,  7,  4,  4,
       29, 17, 22, 16, 13, 23, 16, 20, 18, 26, 10, 27,  7,  2, 29, 19, 28,
       29, 14, 28, 15,  1, 18, 26,  4,  9, 20, 23,  2, 19,  8, 24, 28,  5,
       17, 19, 12,  9, 15,  2, 13, 21,  8,  3, 14, 11, 26, 14, 24, 26,  9,
       19,  5, 22, 11, 30, 14,  8, 27, 12, 19, 15,  7, 26, 27, 11,  2, 14,
       25, 11,  7, 19, 16, 15, 24, 26, 24, 28, 20, 17,  3, 18, 10,  8, 23,
       26, 27, 30, 26, 26, 14, 29,  0,  6, 11, 20, 15, 28,  8,  3,  0,  2,
       27,  5,  8,  6, 25, 16, 10, 32, 30,  5, 29, 15,  8, 28, 26, 17, 19,
       12,  6,  6,  0,  6, 29, 28,  3,  7,  6, 26,  7, 10,  6, 27,  6, 12,
        3, 29, 24, 32, 25,  5,  6, 25, 19, 25, 24, 17, 13,  7, 31,  5,  5,
       10, 26, 15,  9, 18,  6, 15, 23, 31, 30, 13,  4, 28, 20, 32,  6, 16,
        7, 30,  9, 24,  4, 18, 22, 28, 24,  7, 12,  4], dtype=int8)
%onnx::Add_1, shape: [1, 1, 5, 5], exponents: [-5], 
value: array([26, 20, 26, 32, 30,  1, 14, 28, 13, 27, 16, 25,  9, 22,  0, 21, 23,
       13,  9,  1, 31, 13,  3, 11, 29], dtype=int8)


test outputs value:
%2, shape: [10, 1, 5, 5], exponents: [-5], 
value: array([53, 42, 30, 63, 42,  8, 41, 58, 35, 55, 20, 47, 22, 44, 11, 49, 36,
       26, 13, 25, 55, 28, 33, 38, 59, 42, 41, 33, 60, 35,  9, 20, 52, 37,
       38, 28, 53, 10, 27, 28, 47, 44, 33, 21,  4, 45, 24, 34, 19, 35, 45,
       43, 48, 55, 50, 12, 15, 60, 43, 39, 38, 32, 39, 53, 24, 28, 27, 17,
       38, 18, 53, 29, 16, 34, 45, 46, 38, 52, 42, 57,  8, 16, 57, 32, 55,
       45, 39, 37, 37,  1, 39, 49, 17, 18, 21, 54, 15, 22, 19, 53, 54, 25,
       43, 51, 42, 10, 29, 30, 26, 48, 24, 28, 23, 33, 26, 35, 47, 39, 18,
       20, 36, 35, 14, 41, 43, 34, 47, 38, 51, 45,  8, 40, 55, 24, 29, 30,
       50, 20, 29, 19, 37, 38, 37, 35, 25, 59, 33, 20, 14, 47, 36, 28, 49,
       58, 57, 31, 40, 54, 27, 56, 16, 31, 20, 42, 15, 49, 31, 16,  9,  3,
       58, 18, 11, 17, 54, 42, 30, 58, 62, 35, 30, 29, 36, 41, 53, 33, 44,
       21, 28,  6, 21, 29, 42, 37,  4, 38, 19, 29, 18, 39, 32, 47, 32, 44,
       33, 30, 38, 60, 38, 32, 22, 50, 28, 47, 24, 38, 36, 20, 40,  6, 36,
       23, 29, 26, 38, 44, 26, 41, 55, 61, 31, 27, 32, 41, 47, 48, 31, 25,
       29, 30, 30, 47, 17, 27, 23, 59, 37, 10, 23, 33], dtype=int8)