graph main_graph (
  %onnx::Add_0[INT8, 2x48], exponents: [-6]
  %onnx::Add_1[INT8, 1], exponents: [-6]
) {
  %2 = Add[quant_type = 'S8'](%onnx::Add_0, %onnx::Add_1)
  return %2
}


initializers value:



values info:
%onnx::Add_0[INT8, 2x48], exponents: [-6]
%2[INT8, 2x48], exponents: [-6]
%onnx::Add_1[INT8, 1], exponents: [-6]


test inputs value:
%onnx::Add_0, shape: [2, 48], exponents: [-6], 
value: array([16, 18, 33, 59, 34, 22, 20, 24, 26, 16,  5, 58, 27, 60, 62, 31, 12,
       32, 35, 51, 63, 20, 15, 25, 56, 14, 36, 48, 33, 52,  5, 18, 32, 32,
       35, 21, 34, 62, 10, 50, 22, 32, 20, 40,  4,  9, 61, 11, 36, 58, 42,
        1, 48, 50, 19, 41, 54, 48, 46, 52, 45, 17, 60, 58, 19,  2, 34,  0,
        2, 45, 47, 23, 19, 50, 57,  3,  6, 51, 61, 62, 20, 40, 23, 61, 22,
       19, 32,  5, 46, 62, 37, 18, 41,  7, 27, 16], dtype=int8)
%onnx::Add_1, shape: [1], exponents: [-6], 
value: array([42], dtype=int8)


test outputs value:
%2, shape: [2, 48], exponents: [-6], 
value: array([ 58,  60,  75, 101,  76,  64,  62,  66,  68,  58,  47, 100,  69,
       102, 104,  73,  54,  74,  77,  93, 105,  62,  57,  67,  98,  56,
        78,  90,  75,  94,  47,  60,  74,  74,  77,  63,  76, 104,  52,
        92,  64,  74,  62,  82,  46,  51, 103,  53,  78, 100,  84,  43,
        90,  92,  61,  83,  96,  90,  88,  94,  87,  59, 102, 100,  61,
        44,  76,  42,  44,  87,  89,  65,  61,  92,  99,  45,  48,  93,
       103, 104,  62,  82,  65, 103,  64,  61,  74,  47,  88, 104,  79,
        60,  83,  49,  69,  58], dtype=int8)