graph main_graph (
  %onnx::Add_0[INT8, 1x1x4x5], exponents: [-4]
  %onnx::Add_1[INT8, 2x3x4x5], exponents: [-4]
) {
  %2 = Add[quant_type = 'S8'](%onnx::Add_0, %onnx::Add_1)
  return %2
}


initializers value:



values info:
%onnx::Add_0[INT8, 1x1x4x5], exponents: [-4]
%2[INT8, 2x3x4x5], exponents: [-4]
%onnx::Add_1[INT8, 2x3x4x5], exponents: [-4]


test inputs value:
%onnx::Add_0, shape: [1, 1, 4, 5], exponents: [-4], 
value: array([ 5, 14,  3,  7,  9,  1, 12, 10, 11, 11,  9,  7, 15,  4,  9,  1, 14,
        2, 16, 16], dtype=int8)
%onnx::Add_1, shape: [2, 3, 4, 5], exponents: [-4], 
value: array([13,  0,  8,  7,  5,  6,  0,  1,  7,  7,  5,  8, 14, 16, 10, 16, 15,
        1,  3, 10, 10,  3,  3, 13,  9, 13,  7,  6,  1,  4,  7,  2,  3,  5,
        8,  0, 10, 13, 11,  3, 16,  7,  6, 14, 12, 14, 12, 12, 14, 10, 13,
        5, 10, 16, 12,  6,  3,  7,  2,  9, 16, 12, 11,  4,  9,  9,  8,  8,
        0,  6, 11,  1, 15,  2, 15, 12, 14,  1,  6,  2,  9, 15,  8, 15,  9,
       12,  7,  5,  7,  7,  1, 14, 10,  4,  1, 11, 11,  3,  9,  9,  4, 15,
        9,  2,  6, 14, 15, 12,  9,  2, 11,  5, 13,  1,  3,  7, 13,  5,  2,
       11], dtype=int8)


test outputs value:
%2, shape: [2, 3, 4, 5], exponents: [-4], 
value: array([18, 14, 11, 14, 14,  7, 12, 11, 18, 18, 14, 15, 29, 20, 19, 17, 29,
        3, 19, 26, 15, 17,  6, 20, 18, 14, 19, 16, 12, 15, 16,  9, 18,  9,
       17,  1, 24, 15, 27, 19, 21, 21,  9, 21, 21, 15, 24, 22, 25, 21, 22,
       12, 25, 20, 21,  7, 17,  9, 18, 25, 21, 26, 14, 11, 18, 10, 20, 18,
       11, 17, 20,  8, 30,  6, 24, 13, 28,  3, 22, 18, 14, 29, 11, 22, 18,
       13, 19, 15, 18, 18, 10, 21, 25,  8, 10, 12, 25,  5, 25, 25,  9, 29,
       12,  9, 15, 15, 27, 22, 20, 13, 20, 12, 28,  5, 12,  8, 27,  7, 18,
       27], dtype=int8)