graph main_graph (
  %onnx::Add_0[INT8, 5], exponents: [-7]
  %onnx::Add_1[INT8, 1], exponents: [-7]
) {
  %2 = Add[quant_type = 'S8'](%onnx::Add_0, %onnx::Add_1)
  return %2
}


initializers value:



values info:
%onnx::Add_0[INT8, 5], exponents: [-7]
%2[INT8, 5], exponents: [-7]
%onnx::Add_1[INT8, 1], exponents: [-7]


test inputs value:
%onnx::Add_0, shape: [5], exponents: [-7], 
value: array([101,  50, 107, 111,  54], dtype=int8)
%onnx::Add_1, shape: [1], exponents: [-7], 
value: array([38], dtype=int8)


test outputs value:
%2, shape: [5], exponents: [-7], 
value: array([127,  88, 127, 127,  92], dtype=int8)