graph main_graph (
  %onnx::Add_0[INT8, 10x1x5x5], exponents: [-6]
  %onnx::Add_1[INT8, 1x1x5x5], exponents: [-6]
) {
  %2 = Add[quant_type = 'S8'](%onnx::Add_0, %onnx::Add_1)
  return %2
}


initializers value:



values info:
%2[INT8, 10x1x5x5], exponents: [-6]
%onnx::Add_0[INT8, 10x1x5x5], exponents: [-6]
%onnx::Add_1[INT8, 1x1x5x5], exponents: [-6]


test inputs value:
%onnx::Add_0, shape: [10, 1, 5, 5], exponents: [-6], 
value: array([46, 12, 12,  9, 41, 34, 16, 55, 18, 45, 63, 17, 58, 46, 52, 20, 20,
       10, 47, 49, 48, 49, 30, 36, 46, 41, 41, 44, 60, 44, 15, 32, 41,  1,
       48, 61, 18,  5,  3, 36, 40, 26, 59,  6, 40, 35,  2, 51, 54,  7, 43,
       43, 11, 20, 54, 44,  8, 39, 22, 32, 64, 37, 54, 10, 39, 46, 38, 52,
       20, 41, 57, 59, 17, 58, 34, 53, 33, 35, 50, 32,  3, 40, 15, 14, 61,
        5, 29, 55, 44, 26, 60, 42, 45, 16, 31, 26, 22, 55, 59, 13, 37, 13,
       58, 37, 52, 56, 18, 15, 30, 47, 10, 28,  7,  8, 18, 52, 34, 46, 32,
       53, 12, 41, 49, 48, 16,  7,  2, 61, 48, 40, 63,  8, 40, 59,  6, 44,
       14, 40, 27, 40, 60,  9, 33,  9, 53,  9, 42, 55, 37, 28, 42, 46, 25,
       19, 25, 44, 59,  3, 47, 24, 26, 39, 13, 39, 61, 12,  2, 55, 58, 26,
       46, 46, 41, 32, 45, 48, 31, 31,  8, 52, 54, 31, 24, 19, 43, 37, 16,
        7, 24, 20, 51, 43, 46, 26, 27, 38, 13,  4, 23, 47, 56,  4, 20, 44,
       60,  6, 42, 21, 52, 32, 39, 46, 41, 34, 16, 35, 61, 17, 34, 54, 58,
       62, 10, 64,  6, 52,  3, 58, 16, 57, 29, 49, 10,  1, 48,  4, 60, 54,
       45, 29, 28, 13,  6, 33,  6, 18, 44, 56, 43, 54], dtype=int8)
%onnx::Add_1, shape: [1, 1, 5, 5], exponents: [-6], 
value: array([35, 30,  9, 14,  7, 14, 52, 26, 60, 52, 25, 44,  6,  3, 16, 47,  1,
       42, 15, 63, 59, 57, 27,  7, 50], dtype=int8)


test outputs value:
%2, shape: [10, 1, 5, 5], exponents: [-6], 
value: array([ 81,  42,  21,  23,  48,  48,  68,  81,  78,  97,  88,  61,  64,
        49,  68,  67,  21,  52,  62, 112, 107, 106,  57,  43,  96,  76,
        71,  53,  74,  51,  29,  84,  67,  61, 100,  86,  62,  11,   6,
        52,  87,  27, 101,  21, 103,  94,  59,  78,  61,  57,  78,  73,
        20,  34,  61,  58,  60,  65,  82,  84,  89,  81,  60,  13,  55,
        93,  39,  94,  35, 104, 116, 116,  44,  65,  84,  88,  63,  44,
        64,  39,  17,  92,  41,  74, 113,  30,  73,  61,  47,  42, 107,
        43,  87,  31,  94,  85,  79,  82,  66,  63,  72,  43,  67,  51,
        59,  70,  70,  41,  90,  99,  35,  72,  13,  11,  34,  99,  35,
        88,  47, 116,  71,  98,  76,  55,  66,  42,  32,  70,  62,  47,
        77,  60,  66, 119,  58,  69,  58,  46,  30,  56, 107,  10,  75,
        24, 116,  68,  99,  82,  44,  78,  77,  76,  34,  33,  32,  58,
       111,  29, 107,  76,  51,  83,  19,  42,  77,  59,   3,  97,  73,
        89, 105, 103,  68,  39,  95,  83,  61,  40,  22,  59,  68,  83,
        50,  79,  95,  62,  60,  13,  27,  36,  98,  44,  88,  41,  90,
        97,  70,  31,  30,  97,  91,  34,  29,  58,  67,  20,  94,  47,
       112,  84,  64,  90,  47,  37,  32,  82,  62,  59,  49, 117, 117,
       119,  37,  71,  56,  87,  33,  67,  30,  64,  43, 101,  36,  61,
       100,  29, 104,  60,  48,  45,  75,  14,  48,  48,  69,  77, 101,
        83,  50, 104], dtype=int8)