graph main_graph (
  %onnx::Add_0[INT8, 2x5], exponents: [-6]
  %onnx::Add_1[INT8, 2x1], exponents: [-6]
) {
  %2 = Add[quant_type = 'S8'](%onnx::Add_0, %onnx::Add_1)
  return %2
}


initializers value:



values info:
%2[INT8, 2x5], exponents: [-6]
%onnx::Add_0[INT8, 2x5], exponents: [-6]
%onnx::Add_1[INT8, 2x1], exponents: [-6]


test inputs value:
%onnx::Add_0, shape: [2, 5], exponents: [-6], 
value: array([57, 58, 38, 19,  2, 38, 36, 20,  8, 11], dtype=int8)
%onnx::Add_1, shape: [2, 1], exponents: [-6], 
value: array([53, 18], dtype=int8)


test outputs value:
%2, shape: [2, 5], exponents: [-6], 
value: array([110, 111,  91,  72,  55,  56,  54,  38,  26,  29], dtype=int8)