graph main_graph (
  %onnx::Add_0[INT8, 1x1x1x5], exponents: [-5]
  %onnx::Add_1[INT8, 2x3x4x5], exponents: [-5]
) {
  %2 = Add[quant_type = 'S8'](%onnx::Add_0, %onnx::Add_1)
  return %2
}


initializers value:



values info:
%2[INT8, 2x3x4x5], exponents: [-5]
%onnx::Add_0[INT8, 1x1x1x5], exponents: [-5]
%onnx::Add_1[INT8, 2x3x4x5], exponents: [-5]


test inputs value:
%onnx::Add_0, shape: [1, 1, 1, 5], exponents: [-5], 
value: array([14, 28, 26,  6, 26], dtype=int8)
%onnx::Add_1, shape: [2, 3, 4, 5], exponents: [-5], 
value: array([ 8, 12, 27,  4, 14, 14, 30,  2,  1, 10,  3, 10, 14, 26,  1, 29, 13,
       17, 20, 20,  2, 19, 20, 11, 10,  2,  7,  9, 16,  1, 11, 20, 21, 30,
        7, 20, 28, 30,  4, 10, 18, 32,  5, 24, 29,  6,  1, 17, 14, 13, 20,
       29,  8, 22, 13, 22,  6,  1, 28, 16,  1, 17, 13, 11, 14, 15, 32, 31,
       11, 13,  2, 21,  2, 15, 22, 15,  2, 27, 23,  5, 20, 27,  5,  3, 16,
        6, 22, 21, 27, 12, 15, 11,  6,  3, 27,  5, 13, 11,  6,  3,  5, 21,
       28, 20, 17, 26,  7, 14, 14, 11,  8,  8, 25, 32, 19,  8, 22, 18, 16,
       14], dtype=int8)


test outputs value:
%2, shape: [2, 3, 4, 5], exponents: [-5], 
value: array([22, 40, 53, 10, 40, 28, 58, 28,  7, 36, 17, 38, 40, 32, 27, 43, 41,
       43, 26, 46, 16, 47, 46, 17, 36, 16, 35, 35, 22, 27, 25, 48, 47, 36,
       33, 34, 56, 56, 10, 36, 32, 60, 31, 30, 55, 20, 29, 43, 20, 39, 34,
       57, 34, 28, 39, 36, 34, 27, 34, 42, 15, 45, 39, 17, 40, 29, 60, 57,
       17, 39, 16, 49, 28, 21, 48, 29, 30, 53, 29, 31, 34, 55, 31,  9, 42,
       20, 50, 47, 33, 38, 29, 39, 32,  9, 53, 19, 41, 37, 12, 29, 19, 49,
       54, 26, 43, 40, 35, 40, 20, 37, 22, 36, 51, 38, 45, 22, 50, 44, 22,
       40], dtype=int8)