graph main_graph (
  %onnx::Add_0[INT16, 2x48], exponents: [-13]
  %onnx::Add_1[INT16, 1], exponents: [-13]
) {
  %2 = Add[quant_type = 'S16'](%onnx::Add_0, %onnx::Add_1)
  return %2
}


initializers value:



values info:
%onnx::Add_0[INT16, 2x48], exponents: [-13]
%onnx::Add_1[INT16, 1], exponents: [-13]
%2[INT16, 2x48], exponents: [-13]


test inputs value:
%onnx::Add_0, shape: [2, 48], exponents: [-13], 
value: array([3453, 1277, 2190, 1156, 7962, 3276, 5422, 6215, 1424, 2056, 2547,
       8131, 3554, 4393, 6946, 3051, 5197, 4741, 1606, 2002, 6269, 4365,
       1526, 2819, 2021, 5938, 4351, 3854, 5127, 4528, 5020, 3845, 2183,
       2993, 6572, 6393,  391, 6275, 3389, 5566, 1466, 7569, 2363, 5630,
       7852, 5127, 5339, 5331,  239, 2265, 2080,  257, 1301, 4649,  806,
       8104, 6975,  445, 7864, 4692, 1250, 4057, 1368, 7788,  288, 2113,
        815, 2952,  163, 4028, 4317, 2303, 6096,  901, 1920, 1854, 4049,
       3930, 6354, 2664, 6164,  230, 2968, 7060, 5848, 7994, 3038, 5544,
       2860, 5907, 5136, 6553, 2051, 5595, 8123, 1356], dtype=int16)
%onnx::Add_1, shape: [1], exponents: [-13], 
value: array([6353], dtype=int16)


test outputs value:
%2, shape: [2, 48], exponents: [-13], 
value: array([ 9806,  7630,  8543,  7509, 14315,  9629, 11775, 12568,  7777,
        8409,  8900, 14484,  9907, 10746, 13299,  9404, 11550, 11094,
        7959,  8355, 12622, 10718,  7879,  9172,  8374, 12291, 10704,
       10207, 11480, 10881, 11373, 10198,  8536,  9346, 12925, 12746,
        6744, 12628,  9742, 11919,  7819, 13922,  8716, 11983, 14205,
       11480, 11692, 11684,  6592,  8618,  8433,  6610,  7654, 11002,
        7159, 14457, 13328,  6798, 14217, 11045,  7603, 10410,  7721,
       14141,  6641,  8466,  7168,  9305,  6516, 10381, 10670,  8656,
       12449,  7254,  8273,  8207, 10402, 10283, 12707,  9017, 12517,
        6583,  9321, 13413, 12201, 14347,  9391, 11897,  9213, 12260,
       11489, 12906,  8404, 11948, 14476,  7709], dtype=int16)