graph main_graph (
  %onnx::Add_0[INT8, 2x48], exponents: [-5]
  %onnx::Add_1[INT8, 1], exponents: [-5]
) {
  %2 = Add[quant_type = 'S8'](%onnx::Add_0, %onnx::Add_1)
  return %2
}


initializers value:



values info:
%2[INT8, 2x48], exponents: [-5]
%onnx::Add_0[INT8, 2x48], exponents: [-5]
%onnx::Add_1[INT8, 1], exponents: [-5]


test inputs value:
%onnx::Add_0, shape: [2, 48], exponents: [-5], 
value: array([ 4, 30,  6, 28,  2, 22, 17,  7, 10, 26, 11, 23, 16, 30, 16, 15, 22,
       32,  7, 17, 23,  4, 14,  2,  9,  8,  1, 28, 23,  3, 25, 31,  0,  4,
       25,  4, 31, 27, 31, 13, 23, 28, 31,  3,  2,  9,  5, 26,  2, 19, 27,
        1,  4,  4, 18,  0, 31, 23, 11, 27, 14, 11,  6, 21, 29, 10, 11, 27,
       16, 16, 31,  2, 30, 11, 13, 16,  6, 16, 28,  4,  9, 26, 21, 20, 15,
        7, 17, 18, 27, 24, 13,  4,  1,  1, 15, 21], dtype=int8)
%onnx::Add_1, shape: [1], exponents: [-5], 
value: array([11], dtype=int8)


test outputs value:
%2, shape: [2, 48], exponents: [-5], 
value: array([15, 41, 17, 39, 13, 33, 28, 18, 21, 37, 22, 34, 27, 41, 27, 26, 33,
       43, 18, 28, 34, 15, 25, 13, 20, 19, 12, 39, 34, 14, 36, 42, 11, 15,
       36, 15, 42, 38, 42, 24, 34, 39, 42, 14, 13, 20, 16, 37, 13, 30, 38,
       12, 15, 15, 29, 11, 42, 34, 22, 38, 25, 22, 17, 32, 40, 21, 22, 38,
       27, 27, 42, 13, 41, 22, 24, 27, 17, 27, 39, 15, 20, 37, 32, 31, 26,
       18, 28, 29, 38, 35, 24, 15, 12, 12, 26, 32], dtype=int8)