graph main_graph (
  %onnx::Add_0[INT8, 1x3x4x5], exponents: [-6]
  %onnx::Add_1[INT8, 2x1x1x1], exponents: [-6]
) {
  %2 = Add[quant_type = 'S8'](%onnx::Add_0, %onnx::Add_1)
  return %2
}


initializers value:



values info:
%2[INT8, 2x3x4x5], exponents: [-6]
%onnx::Add_0[INT8, 1x3x4x5], exponents: [-6]
%onnx::Add_1[INT8, 2x1x1x1], exponents: [-6]


test inputs value:
%onnx::Add_0, shape: [1, 3, 4, 5], exponents: [-6], 
value: array([49, 39, 19, 19, 11,  5, 27, 47, 39, 12, 48, 29, 53, 53, 60, 35, 25,
       45, 53, 56, 45, 24, 63, 39, 37, 56, 10, 41, 60,  1, 55, 57,  4, 48,
        3,  8, 21, 44, 40, 19,  7, 47, 23, 55,  8, 61, 58, 50, 36, 35, 27,
       34,  5, 38, 20, 15, 40, 58, 43, 22], dtype=int8)
%onnx::Add_1, shape: [2, 1, 1, 1], exponents: [-6], 
value: array([35, 55], dtype=int8)


test outputs value:
%2, shape: [2, 3, 4, 5], exponents: [-6], 
value: array([ 84,  74,  54,  54,  46,  40,  62,  82,  74,  47,  83,  64,  88,
        88,  95,  70,  60,  80,  88,  91,  80,  59,  98,  74,  72,  91,
        45,  76,  95,  36,  90,  92,  39,  83,  38,  43,  56,  79,  75,
        54,  42,  82,  58,  90,  43,  96,  93,  85,  71,  70,  62,  69,
        40,  73,  55,  50,  75,  93,  78,  57, 104,  94,  74,  74,  66,
        60,  82, 102,  94,  67, 103,  84, 108, 108, 115,  90,  80, 100,
       108, 111, 100,  79, 118,  94,  92, 111,  65,  96, 115,  56, 110,
       112,  59, 103,  58,  63,  76,  99,  95,  74,  62, 102,  78, 110,
        63, 116, 113, 105,  91,  90,  82,  89,  60,  93,  75,  70,  95,
       113,  98,  77], dtype=int8)