graph main_graph (
  %onnx::Add_0[INT16, 8x2x5], exponents: [-13]
  %onnx::Add_1[INT16, 2x1], exponents: [-13]
) {
  %2 = Add[quant_type = 'S16'](%onnx::Add_0, %onnx::Add_1)
  return %2
}


initializers value:



values info:
%onnx::Add_0[INT16, 8x2x5], exponents: [-13]
%onnx::Add_1[INT16, 2x1], exponents: [-13]
%2[INT16, 8x2x5], exponents: [-13]


test inputs value:
%onnx::Add_0, shape: [8, 2, 5], exponents: [-13], 
value: array([6687, 2787, 1216, 1841, 1703, 7803, 2662, 1420, 5648, 7584, 7176,
       7560, 7128, 5540, 2321, 7280,  492, 3975, 5063, 1704, 6390, 4935,
       8052, 4212, 7668, 6588, 2862, 3081, 3417, 2132, 6993, 4923, 4757,
       5175, 2464, 1229,  283,  574,  589, 4536, 7930, 6624, 4642, 3187,
       8005, 5797, 4269, 6528, 4844, 7906, 7139, 5808,  306, 5400, 1531,
       7896, 1114, 6737, 4575, 6250, 7506,  854, 5143, 5371, 4055, 1070,
       5712, 3764,    5, 5954, 2920, 3942, 7313, 1753,  531, 3145, 3028,
       5456, 6535, 2052], dtype=int16)
%onnx::Add_1, shape: [2, 1], exponents: [-13], 
value: array([748, 882], dtype=int16)


test outputs value:
%2, shape: [8, 2, 5], exponents: [-13], 
value: array([7435, 3535, 1964, 2589, 2451, 8685, 3544, 2302, 6530, 8466, 7924,
       8308, 7876, 6288, 3069, 8162, 1374, 4857, 5945, 2586, 7138, 5683,
       8800, 4960, 8416, 7470, 3744, 3963, 4299, 3014, 7741, 5671, 5505,
       5923, 3212, 2111, 1165, 1456, 1471, 5418, 8678, 7372, 5390, 3935,
       8753, 6679, 5151, 7410, 5726, 8788, 7887, 6556, 1054, 6148, 2279,
       8778, 1996, 7619, 5457, 7132, 8254, 1602, 5891, 6119, 4803, 1952,
       6594, 4646,  887, 6836, 3668, 4690, 8061, 2501, 1279, 4027, 3910,
       6338, 7417, 2934], dtype=int16)