graph main_graph (
  %onnx::Add_0[INT16, 10x1x5x5], exponents: [-13]
  %onnx::Add_1[INT16, 1x1x5x5], exponents: [-13]
) {
  %2 = Add[quant_type = 'S16'](%onnx::Add_0, %onnx::Add_1)
  return %2
}


initializers value:



values info:
%onnx::Add_0[INT16, 10x1x5x5], exponents: [-13]
%onnx::Add_1[INT16, 1x1x5x5], exponents: [-13]
%2[INT16, 10x1x5x5], exponents: [-13]


test inputs value:
%onnx::Add_0, shape: [10, 1, 5, 5], exponents: [-13], 
value: array([6602, 6626, 4881, 4029, 2569,  745, 1652, 3490, 7298, 3320, 5047,
       4575, 6357, 5728, 7908, 4869, 6692, 3668, 4663, 6687, 7510, 5875,
       3994, 7959, 2152, 7852, 2648, 1657, 3367, 7969, 5496, 1951, 7626,
       5389,  226, 7888, 1018, 3648, 4434, 8016, 6178, 2483, 1997, 2287,
       2158, 5922,  158, 1585, 5071, 3964, 5280, 6164, 1478, 7435, 3459,
       3416, 6891, 4919, 7569, 5327, 1185, 6922, 4934,  363, 4460, 7031,
       4645,  168, 3159, 5713, 7602, 5746, 7603, 5347,  252, 6881, 4688,
       5507, 5889, 7151, 5143, 3093, 3975, 1846,  155, 1190, 6129,  708,
       7341, 4698,  459, 3587, 4667, 6599,  864, 3269, 3830, 1413, 3051,
       7366, 1092, 1278, 4870, 5752, 4781,  728,  520, 6481, 3217, 5926,
       3483, 3569, 3740, 6686, 2268, 4027, 5055, 4547, 1525, 1934, 4609,
       7780,   90, 4427, 3356, 5251, 2826, 5594, 6228, 2424, 5030, 1684,
       4436,  860, 5555, 6307, 4766, 5216, 4104, 1280,  723, 4864, 4417,
       7730,  618, 4278,  200, 4238, 1570, 5155, 2539, 3510, 2138, 1170,
       6934, 1712, 4912, 6714, 5827, 4971,  999, 5835,  872, 2370, 7728,
       2258, 5970, 2036, 3436, 3878, 2333,  617, 6156, 5558, 7071, 1403,
        523,  924, 3961, 4780, 5302, 4627, 6642, 2135, 4704, 6731, 2242,
       1343, 1096, 3951, 6060,  583, 4233, 4095, 5882, 2254, 1205, 5407,
       7543, 3274, 8049, 7254, 3405, 5500, 6937,   71, 2644, 4263, 8126,
       7736, 3038, 6078, 5471, 4011, 3029,  270, 4372, 7503, 7621, 6163,
       4126, 3494, 3377,  906, 1117, 5505, 5663, 3162, 4758,  971, 6067,
       2322, 6535, 8083, 4460, 3077, 8140, 1433, 7944, 3741,  739, 1115,
        271,  412, 6643, 6451, 3091, 1530, 5951, 3307], dtype=int16)
%onnx::Add_1, shape: [1, 1, 5, 5], exponents: [-13], 
value: array([ 841,  634, 4886, 6594, 4154, 7458, 4312,  919, 7327, 1117,  298,
       5915, 6273, 5412, 1561, 7412, 6083, 8144, 3988, 4092, 4146,  678,
       5314, 7189, 2258], dtype=int16)


test outputs value:
%2, shape: [10, 1, 5, 5], exponents: [-13], 
value: array([ 7443,  7260,  9767, 10623,  6723,  8203,  5964,  4409, 14625,
        4437,  5345, 10490, 12630, 11140,  9469, 12281, 12775, 11812,
        8651, 10779, 11656,  6553,  9308, 15148,  4410,  8693,  3282,
        6543,  9961, 12123, 12954,  6263,  8545, 12716,  1343,  8186,
        6933,  9921,  9846,  9577, 13590,  8566, 10141,  6275,  6250,
       10068,   836,  6899, 12260,  6222,  6121,  6798,  6364, 14029,
        7613, 10874, 11203,  5838, 14896,  6444,  1483, 12837, 11207,
        5775,  6021, 14443, 10728,  8312,  7147,  9805, 11748,  6424,
       12917, 12536,  2510,  7722,  5322, 10393, 12483, 11305, 12601,
        7405,  4894,  9173,  1272,  1488, 12044,  6981, 12753,  6259,
        7871,  9670, 12811, 10587,  4956,  7415,  4508,  6727, 10240,
        9624,  1933,  1912,  9756, 12346,  8935,  8186,  4832,  7400,
       10544,  7043,  3781,  9484, 10013, 12098,  3829, 11439, 11138,
       12691,  5513,  6026,  8755,  8458,  5404, 11616,  5614,  6092,
        3460, 10480, 12822,  6578, 12488,  5996,  5355,  8187,  6672,
        6605, 10681, 11489,  9516,  2841,  8135, 10947, 12561, 11718,
        4710,  8424,   878,  9552,  8759,  7413,  3380,  4144,  7024,
        7764, 11088,  9170,  9224,  7633, 13154,  6088,  1297, 11750,
        7145,  7782,  9289,  9670, 12053, 10180,  7424,  7970,  6479,
        1295, 11470, 12747,  9329,  2244,  1157,  5810, 10555,  8934,
       12760,  8939,  7561,  9462,  5821,  7029,  8157,  7616,  6508,
        5512, 13472,  6666, 12377,  8083,  9974,  6400,  1883, 10721,
       14732,  5532,  8890,  7888,  8291, 12094, 11091,  7529,  6956,
        5182, 15453,  8853,  3336, 11993, 11744,  9423,  4590,  7682,
       10455, 15647, 11609, 10255,  8272,  4172,  8691,  8095,  3375,
        6346,  6297,  8048, 11352,  5125, 13525,  6634,  7454, 15410,
        5577,  3375, 14055,  7706, 13356,  5302,  8151,  7198,  8415,
        4400, 10735, 10597,  3769,  6844, 13140,  5565], dtype=int16)