graph main_graph (
  %onnx::Add_0[INT16, 1x1x1x1], exponents: [-15]
  %onnx::Add_1[INT16, 1x1x1x1], exponents: [-15]
) {
  %2 = Add[quant_type = 'S16'](%onnx::Add_0, %onnx::Add_1)
  return %2
}


initializers value:



values info:
%onnx::Add_0[INT16, 1x1x1x1], exponents: [-15]
%onnx::Add_1[INT16, 1x1x1x1], exponents: [-15]
%2[INT16, 1x1x1x1], exponents: [-15]


test inputs value:
%onnx::Add_0, shape: [1, 1, 1, 1], exponents: [-15], 
value: array([15465], dtype=int16)
%onnx::Add_1, shape: [1, 1, 1, 1], exponents: [-15], 
value: array([4318], dtype=int16)


test outputs value:
%2, shape: [1, 1, 1, 1], exponents: [-15], 
value: array([19783], dtype=int16)