graph main_graph (
  %onnx::Add_0[INT8, 2x3x4x5], exponents: [-5]
  %onnx::Add_1[INT8, 1x1x1x1], exponents: [-5]
) {
  %2 = Add[quant_type = 'S8'](%onnx::Add_0, %onnx::Add_1)
  return %2
}


initializers value:



values info:
%2[INT8, 2x3x4x5], exponents: [-5]
%onnx::Add_0[INT8, 2x3x4x5], exponents: [-5]
%onnx::Add_1[INT8, 1x1x1x1], exponents: [-5]


test inputs value:
%onnx::Add_0, shape: [2, 3, 4, 5], exponents: [-5], 
value: array([16, 22, 21,  9,  8,  4, 11, 28, 29,  7, 14,  5,  1, 23, 14, 30, 18,
       11,  4, 27,  6, 31,  8,  9, 27, 20, 10,  3, 31,  7,  1, 25, 21, 24,
       14, 31, 23,  9, 32, 24, 14, 16,  4, 21,  4, 15, 13, 18, 13, 25, 28,
        1, 28, 12, 12, 22, 28, 25,  1, 13, 20, 21, 11, 29, 11,  2,  4,  6,
       14, 12, 27,  5,  2, 16,  8, 31, 15,  4,  8, 28, 18,  7, 13,  5, 16,
       22, 26, 25, 26, 10,  7, 29, 25, 22, 29, 17, 20, 13,  4, 10, 13, 18,
       14, 31, 25,  6, 15, 15, 14,  1, 25, 16, 14, 32, 10, 21, 30, 15, 26,
        1], dtype=int8)
%onnx::Add_1, shape: [1, 1, 1, 1], exponents: [-5], 
value: array([9], dtype=int8)


test outputs value:
%2, shape: [2, 3, 4, 5], exponents: [-5], 
value: array([25, 31, 30, 18, 17, 13, 20, 37, 38, 16, 23, 14, 10, 32, 23, 39, 27,
       20, 13, 36, 15, 40, 17, 18, 36, 29, 19, 12, 40, 16, 10, 34, 30, 33,
       23, 40, 32, 18, 41, 33, 23, 25, 13, 30, 13, 24, 22, 27, 22, 34, 37,
       10, 37, 21, 21, 31, 37, 34, 10, 22, 29, 30, 20, 38, 20, 11, 13, 15,
       23, 21, 36, 14, 11, 25, 17, 40, 24, 13, 17, 37, 27, 16, 22, 14, 25,
       31, 35, 34, 35, 19, 16, 38, 34, 31, 38, 26, 29, 22, 13, 19, 22, 27,
       23, 40, 34, 15, 24, 24, 23, 10, 34, 25, 23, 41, 19, 30, 39, 24, 35,
       10], dtype=int8)