graph main_graph (
  %onnx::Add_0[INT16, 1x96x5x5], exponents: [-13]
  %onnx::Add_1[INT16, 1x96x5x5], exponents: [-13]
) {
  %2 = Add[quant_type = 'S16'](%onnx::Add_0, %onnx::Add_1)
  return %2
}


initializers value:



values info:
%onnx::Add_0[INT16, 1x96x5x5], exponents: [-13]
%onnx::Add_1[INT16, 1x96x5x5], exponents: [-13]
%2[INT16, 1x96x5x5], exponents: [-13]


test inputs value:
%onnx::Add_0, shape: [1, 96, 5, 5], exponents: [-13], 
value: array([2303, 1080, 4464,  446, 2147, 7205, 3506,  166,  871, 7021, 2454,
       7691, 7777, 8094,   84, 2821, 4682, 6058, 2978, 7926, 7395, 1205,
       2241, 3398, 2611, 6241, 2211, 7061,  422, 1269,  742, 4109, 4053,
       4645, 5243, 5654,  336, 1112,  981, 5336, 8191, 2516, 2018, 5473,
       3067, 2273,  122, 3800, 6948, 3905, 3780, 6598, 1693, 2747,  267,
       2482, 2670, 4269, 5627, 6061, 2739, 4835, 4681, 4349, 5271, 7992,
       1536, 4391, 1991, 5575, 2933, 5038, 2121,  188, 5468, 6509, 8039,
       5673, 7066,  298, 5040, 6977, 1221, 4731,  680, 7236, 4479, 7485,
        306, 6535, 7402, 6454, 4218, 6754, 2405, 6946, 5328, 5733, 3501,
       6014, 1002, 1813, 2073, 1872, 7636, 5972, 7895,  570, 3231, 3336,
       1005,  527, 3774, 4047, 2969,  700, 1480,  396,  860, 7959, 6312,
       2488, 3661, 8060, 1170, 8011, 1154, 6825, 6928, 7037, 6974, 2374,
       4943, 3506, 3597, 6564, 3120, 5003, 4135, 2325, 3792,  307, 1458,
       1305, 1190,  788,  343,  732, 2290,  650,  132, 2114, 5997,  281,
       2704,  308,  141, 4829,  148, 2145, 7184, 7639, 2445,  407, 7795,
       5756, 5460, 6674,  507, 4075, 3701, 3401, 1164, 7846,  440, 5103,
       2224, 5116, 5865, 6424, 5867, 7013, 6164, 7767, 2485, 7050,  303,
       2767, 3159, 4754, 5458, 3623, 1280,  507,  145,  192, 6287,  742,
       5009,  804,  644, 2828, 7379, 5446,  466, 8047, 4742, 1783, 1845,
       7851, 5589, 1153, 2351, 7794, 8134, 3399, 5709, 4900, 6957, 6294,
       7837, 4210, 5676, 6068, 8065, 6907, 2903, 8014,  246, 7362, 7163,
       1924, 2643, 2280, 1674,  561, 2671, 2289, 1192, 6389, 6811, 3508,
       1433, 3588,  156, 7256, 1957, 7527, 6180, 8031, 3569, 1969, 5950,
       7854, 1434, 6603, 2027,  449, 1262, 5671,  295, 7890, 2313, 4831,
       3364, 5460, 2792, 3155, 6370, 4238, 7853, 6020, 3436, 6369, 6129,
       1393, 5084, 6151, 5554, 1896, 8107, 1916, 4613,  516, 8117,  664,
       5898, 6370, 3487, 5852, 4328, 4997, 4407, 7352, 4643, 6965, 4762,
       5302, 6099, 4182, 3818, 5664,  140, 6694,   80, 7997, 5401, 4926,
       1841,  495,  863, 4448, 5569, 6999, 4632, 8069, 3751, 6233, 7667,
       7008, 6265, 8007, 4745, 2573,  375, 3825, 7807, 6815, 7472, 2301,
       8017, 7302, 6692, 6343, 3857, 5719, 5062, 2654, 3772, 3080, 2495,
        667, 5683, 2760, 7902, 3374, 3121, 4944, 7552,  856, 5001, 7126,
       2726, 7015, 2506, 5840, 1178, 4281, 5012, 1413, 3913, 7491, 5289,
       6472, 2198, 6812, 7709, 4702, 6769, 5375, 7047, 7991, 7630, 4467,
       3534, 5679, 2139, 1590, 6065, 2883, 4330, 1819, 7903,  705, 3047,
       2878, 7722, 2531, 1830, 5158, 6708, 3019, 2899,  646, 5502, 7446,
       6996, 1953, 8039, 7376,  118, 1960, 6834, 1589,  555, 3181, 8173,
       1571, 6715, 1849, 5806, 2505, 7097,  540, 6859, 3024, 3618,  903,
       1299,   89, 5277,  818, 7292, 4658, 6316, 2913, 2054, 1237, 4096,
       1347, 2823, 3786, 7835, 6782, 4617, 4761, 4361, 7744, 3466,  908,
       7741, 2581,  516, 4181,  190, 8106, 1733, 7356, 6608, 2797, 2682,
       7954, 7889,  133, 4060, 3967, 3771, 7602, 7476, 3029, 2422,  628,
       3689, 3831, 6589, 1501, 7584, 3164,  360,  963, 4917, 7569, 2987,
       7408, 4388, 7873, 6075, 7092, 4475, 6444, 2722, 8092, 4992, 5316,
       7509, 4422, 6535, 4200, 4090, 1436, 2225, 6385, 7499, 7397, 7371,
       1261,  518,  747, 2316, 6478, 7106, 2340,  665, 6227, 7226,  924,
       6006, 5291, 1193, 2596, 6037, 7038, 5844, 1983, 7107, 1408, 5102,
       5144,   20, 4317,   56, 4937,  403, 6783, 2584, 4912, 3173, 7777,
       7022, 2143, 6228, 6569,  919, 4819, 6092, 2292, 7975, 6583, 4130,
       1123, 1338, 5371, 3101, 6293, 5921, 4725, 5002, 6186, 5993, 5761,
       2561,  374, 2857, 7700, 7956, 1998, 2396, 2930, 5161,  546, 2822,
       4566, 8027, 5182, 6650, 4991, 7408, 7080, 1196, 3466, 6882,  361,
       2631, 3578, 7515, 1713, 7717, 2180, 7291, 4642, 6360, 4411, 2494,
       1069, 3544, 5708, 5836, 2982, 1748, 6532, 7781, 6486, 7477, 2520,
       5298,  501, 2222, 6698, 2808, 5869, 2486, 1319, 2188, 7251, 6860,
       2633, 3021, 7093, 6509, 3669, 4681,  528, 6337, 6975, 7322, 2361,
       5957, 2343, 6464, 4269, 6044, 7735, 1483, 5695,  548, 1028, 7743,
       2693, 3998, 7173, 1074, 7240, 5077,  499, 4868, 2213, 2567, 6336,
       1670, 2598, 2951, 1570,  284, 6050, 5833, 4114,  840,  815, 7041,
       8129, 4584, 2185, 4477, 6180,  471, 2964, 7194, 2516, 7741, 5021,
       8074, 4235, 1855, 6017, 2377, 7091, 6754, 5021,  740, 7649,   65,
       1525, 5283, 7112, 7464, 1038, 1844, 3986, 7745, 2756, 1226, 4716,
       6949,  920, 3000, 1523, 5745, 5216, 7380, 5907, 2092,  985, 3128,
       1389, 4493,  958, 5035, 8078, 7414, 2997, 1072, 5143, 5143, 7048,
       2207, 7032, 6171, 6282, 4502, 4715, 4757, 3905,  735, 1755, 5098,
        131, 7604, 1083, 3740, 3514,  761, 5051, 6623, 1826, 6315, 3694,
        896, 6616, 7900, 5933, 4536, 4994, 5420, 4953, 5400, 3897, 2904,
       3717,   54,  747, 4699, 1589, 6694, 1245, 2874, 6495, 7062, 3652,
        940, 4321, 3980, 5793, 5993, 6452, 2186, 1371, 5154, 4064, 4055,
       4046, 6886, 1454, 3968,   40, 6369, 7034, 6926, 4180, 5421, 6468,
       3848, 4432, 7832, 6217,   53, 6579, 2247, 5504, 6423, 3672, 7765,
        344, 6833, 4007, 6640, 5324, 2005, 1360, 7444, 5193, 2260, 1038,
       7943, 3827, 6641, 6371,  693, 7169, 6782,  554, 7928, 6168, 4594,
       2984, 4115, 5567, 5041, 6057, 3493, 5814, 2980, 1889, 5406,  605,
       3899, 2184, 3886, 3398, 7613, 5289, 2926,  421, 7841, 4920, 6355,
       6030, 2356, 3838, 1076, 2199, 3823,   94, 4536,  227, 5680,  945,
       7181, 3475, 3281, 6096, 7951, 5458, 2344, 1288, 3015, 5905, 4221,
       1107,  169, 2656, 7549, 6021, 7496, 4424, 7740, 6018, 8138, 1388,
       6427, 5264, 6282, 3990, 7957, 1586, 2411, 1797, 5404,  603, 6096,
       5540, 7719, 4243,  746,  381, 2698, 7275, 4007,  885, 5689, 4090,
       2659, 5086,  289, 1047, 5991, 1634, 2147, 7757,  644, 5967, 4164,
        286, 6862,  299, 6975, 7660, 5253, 2025, 6402, 5025, 7738, 2389,
       5324, 2456, 3251, 4313, 2466, 2721, 4561, 8020, 1368, 5838, 6511,
       7940, 1906, 4984, 8139, 7708, 7629, 7845, 6881, 6754, 6292, 1784,
        216, 4342, 5861, 2610, 6938,  763, 6170, 1260, 4205, 4174, 6365,
       1197, 1074, 5490, 7204,  784, 6959, 3468, 6046,  669, 7030, 6973,
       7610, 1460, 4149, 2753, 4568, 3792, 2743, 4800, 1889, 8150, 1130,
       2352, 5996, 8004, 6937, 6514, 1157,  753, 2956, 4281, 5404, 3902,
       1894, 2222, 7282,  152, 4798,    8, 2247, 8053, 1541, 3203, 6967,
       2845, 6753, 5654, 5163, 3456, 1341, 2332, 3552, 5737, 4465,  939,
       7561, 2591, 1386, 7329, 2176, 4150, 3125, 3078, 7189, 2892, 5845,
       5712, 7925, 2305, 6046, 7342, 3658, 4392, 1418, 5835, 6974,  803,
       4755, 3268, 1794, 3402, 5309,  484, 3045, 5859, 6477, 7153, 1321,
       4235, 1950, 7693, 2050, 2292, 2030, 7214,  197, 1959, 3586, 4772,
       6207, 6887, 3235, 4798, 2609, 6707,   59, 4055, 5183, 2896, 7656,
       6317, 7684,  466, 5487, 2906, 7950, 7048, 6855, 4378, 6544, 6927,
       6243,  455, 2636, 6648, 4391,  483, 7943, 7459,  217, 7165, 3437,
       2423, 1468, 6913,  836, 7926, 3613,   52, 6160, 2677, 4821, 6283,
        587, 2009, 7914, 1367, 1361, 7743, 7547, 1760, 1653, 2751, 7557,
        895, 2770, 4574, 2007, 4927, 5870, 5773, 6112, 5871, 2385, 2606,
       1696, 2835, 1440, 1185, 7526, 2066, 2868, 8005, 2840, 5632, 2869,
       2701, 4891, 5560, 4095, 3886, 4982, 3141, 3652,   58, 4770, 2779,
       3807, 3849, 4945, 1346, 5949, 3841, 1077, 8042, 2653, 3639, 1147,
       7406, 2580, 7790, 7373, 1525, 6350, 6859, 1184, 5556, 5000, 5603,
       3675, 7889,  358,  171, 3066, 2944, 2932,  312, 2732, 2395, 5810,
       5011, 8097, 3315, 1359, 2945,  366, 2880, 3953,  348, 4180, 6135,
       5994, 2900, 1477, 4347, 1398, 1998, 6817,  248,  488, 4732, 5712,
       4676, 2684, 4513, 3563, 6881, 2721, 3707, 4776, 7342, 1149,  339,
       7155, 6117, 4259, 3029, 2660, 6660, 6718, 2173, 1176, 5992, 2379,
       4428, 4679, 5410, 4047, 7832, 6703, 5708, 6584,  834, 6617,  614,
        537,  373, 4702, 1631, 7760, 7472,  396, 4581, 2221, 4513, 3897,
       3413, 3615,  769,  882, 2879, 6048, 3890, 6497,  249, 6485, 5303,
       1144, 2359, 4955, 5853, 1728, 5348, 7119,  186, 3776, 5525, 1888,
       5647, 2418, 7616, 4275, 7544, 3936, 6571, 3204, 1417, 2751, 4204,
       4761, 7371, 4006, 1546, 1663, 3544, 1674, 5960, 1979, 2143, 3367,
       4053, 7350, 4160, 6017, 4478, 6641, 8002, 5716, 3989, 4134, 4692,
       2662, 1261, 1312, 2180, 6509, 1294, 2767, 6310, 6985, 2222, 2332,
       3987, 4321,  605, 5361, 6328, 6381, 8062, 1959, 2574, 2322, 1439,
       6134, 6754, 5270, 4502, 4712, 2707, 3389, 5926, 4990,  352, 1923,
        469, 3944, 4552, 4210, 8184, 6646, 7657, 1693, 4801, 6672, 2358,
       6165, 3931, 6794, 7009, 2521, 6474, 5291, 5736, 4048, 2936, 7968,
       1853, 1042, 6467, 1659,  126, 5983, 2590, 6946, 4020, 3194, 6597,
       1762,  900,  459, 2246, 4062, 6373, 1940, 2780, 6119, 6169, 6128,
        926, 5044, 4403, 5197, 2226, 7487, 7126,  692, 7057, 2193,  130,
       4791, 4025, 5248,  646, 5431,  623,  255, 1307, 1623, 4418, 6954,
       6282, 2260, 7179,  502, 7633, 3495, 5101,  748, 1561, 1192, 7916,
       4346, 7559, 5283, 7127, 6579, 5988, 1798, 4807, 4638, 5054, 1894,
       6921, 5580, 5194,  263,  235, 6973, 4577, 1793, 7127, 5391, 1171,
       4939, 1146, 2880, 5542, 3823,  846, 4694, 1099, 5070, 4855, 6563,
       5854, 6789, 8078, 1703, 7171, 1836, 2118, 4816, 6169, 4437, 1360,
        186, 3061, 6821, 5494, 2547, 2210, 3705, 7287, 6659, 2196, 6235,
       6083, 5610, 6600, 1826, 3047, 1669, 6613, 8092, 6966,  351, 7477,
       3324, 4651, 6574, 5692, 3283, 4020, 4578, 4246, 6797, 7086, 3286,
       4703, 4897, 2488, 5351, 3251, 7199, 5256, 4341, 6993, 1843, 3108,
       3466, 3024, 7200, 3184, 4758, 6863, 6693, 2076, 6248, 7277, 5218,
       4714, 3919, 2494, 1075, 3060, 2274, 3510, 3197, 4981, 8036, 5804,
       6834, 2681, 6697, 1410, 6009, 1551, 3188, 2947, 2939, 7496, 4498,
       1156, 7877,  987,  320, 6877, 8014, 3075, 1216, 3258, 4014, 1216,
        928, 5761, 1529, 5493, 3300, 7347, 7519, 8070, 4511, 7954,  488,
       3814, 5183,  169, 1856, 1986, 7844, 6026, 1889, 8007,  501, 6626,
       2071, 3242, 1747, 1909, 5216, 2986, 8130, 8029, 2533, 3972, 5908,
       7382, 3279, 8020,  953,  305, 4019, 2017, 6136, 3928, 7360, 1884,
       8152, 6806, 2807, 1382, 2857, 2893, 2459, 4378, 6014, 7618, 4074,
       1869, 2523, 4140, 1463, 3485, 1410, 2601, 7866, 6866, 3848, 3924,
       5848,  158, 5590, 7047, 1520, 6803,  229, 4536, 4735, 3756, 6240,
       6802, 7415, 5432, 2003, 6661, 3187, 2945, 2756, 2202,  416,  129,
       1720, 2613, 5005, 3372, 4089, 1325, 7929, 2562, 1798, 7052, 7794,
        142, 2615, 5096, 6753, 5963, 6428, 1022, 6146, 5470, 1157, 4162,
       6920, 1757,  850, 5853, 3669, 6082, 5902, 1946,  163, 2806, 1641,
       3819, 3501, 6239, 2530, 3871, 4171, 3014,  884, 6443, 3548, 5957,
       5706, 1584, 5507, 7875, 4252, 8114, 4898, 4147, 7940, 8165, 4633,
       5423, 6002, 4628, 1508, 2175, 3328, 1463, 3727, 1975, 7816, 2832,
       2411, 7027, 7017, 5754, 1713, 2780,  550, 1216,  710, 6399, 5017,
       5577, 4012, 7120, 7749, 3191, 6925, 3308,   73, 2324, 1515, 2048,
       3843, 2702, 7708, 4282, 2455, 6284, 2476,  294, 5690,   16, 4287,
       6566, 5707, 5132, 4037,  299, 6078, 2079, 1262, 6703, 2763, 6446,
       6039, 3673, 6582, 5721, 1563, 5622, 6159, 8049, 7183, 2274, 4367,
       2776, 6092, 6280, 2244, 7090, 1295, 3689, 6395, 6814, 5709,  316,
        932, 1511, 2529, 5355, 5774, 5686, 2226, 5213, 4145, 4446, 6862,
        227, 6871, 3529, 6391, 2691, 5142, 4986, 3801, 5661, 2633, 2613,
       5337, 6264, 4898, 2116,  296, 1767, 6504, 7291, 4072,  465, 5817,
       6948, 3680, 6900,   77, 5751, 5706, 1347, 5274, 7959, 7003,  455,
       5389, 1885, 1131, 3685, 6337, 7575, 7167, 1833, 3028, 4732, 2332,
       2233, 8148, 4730, 6900, 5028,  794, 8184,  636, 1951,  988, 1196,
       3455,  734,  946, 2392,  688, 3960, 2531, 6317, 5870, 6504, 7885,
       2998, 6473, 6341, 2770, 8130, 6644, 7417, 4976,   56, 1885, 3798,
       3164,  685, 7498, 5346, 4210, 8104, 2055, 3540, 2293, 5914, 3930,
       1858, 5876, 6861, 3021, 7322,  647, 6733, 5998, 2495, 6916, 5300,
       7483, 1478,  626,  783, 5862, 7477, 7958, 2954, 7903, 1358, 4957,
        668, 4653, 2163, 2667, 1665, 4212, 3700,   43, 4366, 1244, 6244,
       4648, 6922, 3617, 3250, 4670, 7461, 3194,  615, 2749,  579, 6978,
       2133, 3191, 3268, 1763, 7887, 5400,   76, 1653, 5955, 4131, 6861,
       1511,  603,  802, 5594, 6888, 6640, 4460, 4316, 4960, 5771, 6508,
       1816, 6882,  330, 2635, 2464, 7104, 3705, 4129, 6875, 1394, 7723,
       4720,  556, 5877, 3060, 7590, 3024, 6184, 1913,  276, 6432,  977,
       1894, 6990, 7000, 7624, 6365, 4986, 5911, 6039, 4780, 6554,  559,
       4149, 7525, 3791, 7300, 1730, 1862, 2793, 6862, 6499, 6948, 8155,
       3143, 6941, 4109, 6216, 3337, 5802, 4618, 6692, 3914, 1592, 4902,
       7460, 5709, 3258, 5980, 7331, 5675, 6107, 4876,  822,  271,  505,
       5526, 2668, 2868, 4985,   19, 1045, 2718, 6127, 7654, 4739, 5281,
       5108, 8090, 7809, 2432, 2481, 8171, 6880, 3320,   82, 6400, 2412,
       2119,   19, 4553, 1136, 6974, 7175, 1310, 6755,   46, 7468,  536,
        261, 3363, 7363, 7256,   85, 5026,  206, 1879, 1536, 3366, 6485,
       4007,  714, 6635, 5677, 8050, 5804, 1688, 4615, 3663, 2901, 7280,
       5513, 4915, 4938, 3837, 5562, 1029,  200, 4551, 4842, 5359, 3357,
       4998, 4343, 5737, 6818, 5834, 2854, 5075, 5480, 1523, 4080, 2163,
       1046, 1283, 6929,  570, 7126,  765, 7636, 7774, 5533, 3258, 3697,
       6425, 4192, 6214, 6128, 2068, 7908, 2781, 4882,  626,  517, 1192,
       5315, 7658, 4489, 6724, 5337, 7428, 6698, 7354, 4391, 5006, 3762,
        981,  358, 6707, 5567, 2501, 2025, 4722, 7607, 3300, 2274, 7937,
       4259, 4772,  947, 7000,  731, 4318, 1189, 3884, 4858, 3101, 1533,
       2087, 7551,  851,    6, 7902,  270, 6329, 5213, 6871, 2394, 7006,
        101, 1653, 1405, 1418, 2667, 7800, 7311, 1388, 4898, 1834, 6753,
        140, 5019, 1960,  296, 6390, 3632, 1940, 1167, 7075,  379, 7491,
       5036, 5579, 5572, 2902, 4458, 1741, 5331, 3443, 3651, 1344, 6071,
       7484, 7391, 7238,  482,  411, 1565,  649, 5327,  387, 2031, 5103,
       1726, 3114, 2773, 4540, 5327, 7223, 8017, 3288, 4880, 7905, 4811,
       1216, 6757, 7114, 4552,  129,  243, 3253, 4446, 5808, 1230, 5024,
        838, 7625,  261, 2748, 7484, 4602, 5902,  865, 2797, 7948, 4466,
       1871, 2068, 7073, 2511,  407, 7909,  980, 2029, 4307, 2835, 5863,
       1330, 4811, 4081, 1611, 3088, 5330,  501, 4018,  784, 3171, 7104,
        763, 2248, 6019,  450, 4588, 7993, 8037, 8171, 4548, 1051, 1620,
        951, 2607, 7476, 6371, 3531, 5311, 5256,  538, 8117, 5008, 4119,
       4084, 6840, 7608, 2682,  105, 2592, 6654, 7118, 6042, 7774, 5429,
       2468, 1729, 3613, 2810, 1639, 2556,  915, 7305, 1164, 2671, 2620,
       7135, 5067,  623, 5682, 3014, 4775, 5440, 5331, 5723, 4100, 5698,
       3824, 4123, 4905, 8072, 8070, 4289, 5985, 4501, 6201, 4482,  631,
       3530,  896, 2879,   32, 6430, 6391,   35, 1354, 2003, 1176,  182,
       7742,  763, 7116, 6558, 1420, 8053, 2988, 6452, 5411, 2102, 3950,
       2841, 7579, 4626, 7806, 4683, 7792, 6361, 1766, 5329,  416, 4996,
       3735, 4350, 1346, 3400,   96, 2883, 8019, 3463, 4540, 1383, 3822,
        649,  277, 4463,  158, 6326, 5823,  683, 1620, 4634, 7511, 2132,
       1029, 6463, 6398, 4461, 7878, 7612, 7078, 4391, 2389, 3861, 6698,
       3649, 5653,  664,  924,  914, 7686, 2984, 5059, 6071, 2213, 5628,
       2181, 2063, 7398, 7377, 3892, 4003, 6162, 4288,  664, 1357, 8069,
        637,  278, 7846, 5148, 1741, 5747, 1143, 3686, 7014, 5310,  519,
        200, 5782, 4453, 5318,  671,  728, 7766, 3084, 7517, 6284, 3679,
       3424, 8151, 7589, 2726, 2701, 2469, 6132, 3486, 5696, 3066, 5949,
       6470, 3044], dtype=int16)
%onnx::Add_1, shape: [1, 96, 5, 5], exponents: [-13], 
value: array([ 542, 6259,  936, 6421, 2074,  594, 2851,  477, 5414, 1891, 5295,
        119, 2142, 1778, 3248,  909, 8072, 7775, 3088, 1753,  874, 4376,
       3536, 3415, 5924, 7165, 6729, 6802, 1705, 4782, 7101, 4829, 5174,
       4428, 2318, 2838, 6548, 3777, 2391, 1050, 2412, 6157, 7962, 4124,
       5292, 6781, 1807, 7859, 5885,   81, 5241,  709, 5295, 1168, 5850,
       4101, 5115, 7364,  547, 2543, 2892,  583, 7724, 5143, 5010, 5795,
       2257, 6794,  171, 6877, 5466, 5209, 7545, 8030, 1496, 7802, 1209,
       6112, 5444, 7300, 2471, 7556, 3350,  798, 4346, 7347, 2913, 7390,
       2697, 4117, 7480, 2799, 3538, 1469, 3429, 2557, 7675, 5247, 4614,
       1829, 1285, 2558, 5624, 7511, 6317, 1583, 6653, 7925, 1242, 1159,
       1984, 1980, 7232, 6151, 2005, 4695, 3099, 4254, 6958, 4553, 1969,
       3611, 5311, 5604, 4194, 3868, 1295, 5596, 2532, 3214, 7111, 5801,
       1256,  835, 5023, 2207, 6978, 7588, 4322, 6881, 7137, 2447, 6594,
       5724, 2226, 2644, 8124, 5362, 6387,  124, 5345, 6750, 4947, 8150,
       5149, 2613, 2836, 1301, 4233, 2530, 6812, 6802, 2233, 2033, 4033,
       6691, 6808, 5170, 4250, 6956, 3760, 5578, 2241, 6363, 6779, 7994,
       1811, 5898, 3954,  223, 3402, 4276,   46, 1882, 3536, 4812, 7698,
       4740, 6153,  770, 3944, 2498, 4287, 2164, 8124, 2350, 5245, 2736,
       4672,  658, 7115, 5631, 7431, 2535, 6694, 1531, 4781, 2614, 6694,
       5825, 3249, 5210, 6271, 2981, 3373, 7618, 6374, 6691, 8074,  531,
       2376, 1225, 2965, 1446, 3958, 2360, 2087, 2393, 5054, 1555, 7936,
       6553, 2416, 6497, 6600, 1423,  605, 2154, 4722, 7553, 4009, 4134,
       3498, 2865, 5211, 2641, 6031, 6973, 6855, 4588, 5054, 4339, 2274,
       6271, 3691, 3492, 6851,  395, 5957,  241, 1287, 7251, 7086, 5407,
       7068, 7260, 3287, 1860, 6613, 6826, 1244, 4694, 7306, 7617, 3319,
        417, 5631,  923, 3759, 6955, 6343, 5007, 5684, 3268, 6458, 2043,
       5675, 1552, 2275, 1089, 7310, 7293, 3581, 5844, 5220, 3801, 4947,
       5994, 3595, 7379, 5120,  963, 7810, 7285, 7970, 5566, 6621, 4341,
        632, 4147, 7540, 5969, 8043, 4862, 3787, 6953, 6134, 7129, 5238,
       5363,  407,  974, 5127, 7125, 2315, 3006, 4211, 3040, 4430, 2873,
       8069, 8051, 5950, 7772, 4397, 8117, 4064, 7821, 7496, 5959, 1372,
       8119, 4327, 3839,   33, 1245, 2972,  565,   89, 3404, 3355, 4668,
        150, 1991, 1604, 3020, 2915, 4438, 7896, 3290, 2607, 4544, 1760,
       6352, 2189, 1554, 3272, 6261, 1945, 5854,  229, 6563, 5389, 2454,
       4812, 1635,  608, 7319, 6151, 6689, 7491, 3765, 5504, 3078, 6509,
       5933, 4133, 1668,  684,  709, 8023, 6131, 5593, 3864, 5799,  425,
       2143, 1620, 7376, 7881, 2410,   10, 5892, 1239, 4247, 3650, 5892,
       6465, 7373,   42, 5756, 3180, 5188, 3970, 4748, 2201, 5756, 3069,
       7504, 3801, 3511, 5454, 5481,  303, 3689, 7943, 7121, 7050, 3831,
       7308, 5249, 3527, 3223, 3526, 3379, 3556, 5094, 6350, 4258, 2782,
       3754, 7316, 2172,  236, 8063,  250,  963, 5309, 2928, 3686, 7008,
       5579, 5317, 1338, 6587, 4436, 4477,   88, 7165,  542, 5178, 7861,
       7629, 4581,  976, 5580, 3136, 4498, 2237, 6704, 5465, 7023, 3596,
       4879, 1472, 5866, 3818, 7046, 3742, 4900, 7949, 4111, 6829, 3671,
        866,  212, 7981, 6281, 2039, 5729, 1128, 3234, 6523, 3072, 1788,
       7775, 6573, 5219, 6380,  988, 2663, 8036, 8094, 7760, 1068, 6456,
       1743, 7875, 2708, 4474, 2707, 6098, 1626, 8088, 1664, 2090,  209,
        802, 5853, 1362, 6603, 3992, 1515, 5868, 2931, 3904, 3332, 4869,
       6530, 3219, 6278, 5772, 4467, 2471, 2136,  190, 8156, 2438,  815,
       7764, 4199, 3428, 7743,  663, 3182, 6171, 6088, 6398, 7199,  445,
       2257, 6956, 5124, 2114, 1038, 1286, 5582, 3129,    0, 6704, 3076,
       4935,  616, 3022, 1513, 1656, 7226, 2789, 3159, 6389, 4209, 4069,
        982, 1809, 2043, 7466, 4927, 3555, 3789, 6001, 2599, 3097, 2147,
       6483, 1414,  504,  170, 2423, 5359, 2276, 2363, 3920,  323, 1426,
       3110, 3058, 1810, 5037, 2580, 5639, 5484, 7945, 5116, 5808, 5974,
       2475, 6106, 6510, 7408, 3213, 3004, 1324, 3556, 6737, 1005, 3887,
       5650, 5849, 6095, 7452, 1308, 3828, 6064, 7739, 4515, 2859, 1910,
       3050,  342, 5541,  343, 1062, 3606,  158, 4217, 1962, 6521, 2368,
       4802, 5224, 1712, 2728, 1816, 3767,  483, 2469, 1159, 5916,  720,
       5783, 4693, 2489, 4036, 6564, 4091, 7190, 4778, 2358, 7855, 4589,
       3398, 4374,  283, 7915, 2816,  628, 5911, 6121, 1227, 6507, 6448,
         36, 2565, 4969, 2775, 4831, 5552, 4828, 3469, 6954, 4505, 3254,
       4183, 3745, 1540, 3510, 2861, 3856,  635, 3508, 5786, 1978, 6573,
       4778, 2556,  879, 3676, 6572,  613, 6559, 7381, 6530, 7376, 5803,
        900, 3211, 7617, 1644, 6277, 7223, 1172, 3868, 3936, 6328, 4191,
       4989, 6567, 1748, 4851,    2, 2898,  596, 6332,   92, 7573, 6064,
       6020, 6084, 4533, 1902, 7612, 2413, 3059, 1243, 4715, 2653, 7302,
       6835, 6217, 6058, 3704, 8077,  860, 4964, 6024, 7805, 1035, 3436,
       6044, 5401, 7487, 1381,  849, 4350,  851, 2233, 1657, 6542, 1868,
       2280, 3489, 3144, 3253, 4226, 5114,  131, 7433, 1001, 1152, 7534,
       1061, 1369, 7309, 1128,  610, 5482, 5984, 5275, 2409, 7777, 3919,
       5177, 7426, 3027, 3416, 6683, 6615, 1370, 8168,  517, 3339, 4584,
       4628, 7584, 2425, 1613, 6938, 2792, 5042, 6807, 1297, 4305, 1234,
       8044, 4127, 4747, 1047, 5162, 1253, 3609, 5981, 2818, 7599, 1310,
       1292, 3026, 3417, 2655, 3226, 5847,  409,  827, 2987, 1691, 2986,
       4281, 5187, 4590, 6777, 3057, 7502, 3876, 2225, 6757, 2526, 7736,
       2744, 5979, 1458, 7194, 7770, 6262, 3885,  914, 1268, 5166, 7584,
       3891, 6067, 4217, 2094, 6745, 6544,  454, 3125, 4483, 8045, 1786,
       3892,  275, 2286, 7880, 2963, 7462, 3018, 4030, 2698, 7740, 7310,
       2671, 2516, 6038, 3528, 6737, 4256, 7530, 7322, 2831, 4363, 7749,
       6138, 4001, 5472, 7431, 5981, 7661, 5752, 6966, 3987,   44, 3567,
       1933, 3291, 2017, 4298, 1402, 4529, 1973, 8106, 1006, 8044, 5440,
       3128, 8079, 3135, 1522, 3541, 5537, 6385, 5956,  746, 3687, 7412,
       6982, 4912, 3455, 5969, 3055, 5784, 5275,  291, 6927, 3729, 6530,
       1178, 7044, 5445, 7831, 4804,  325, 5909, 5138, 6030, 4464, 4106,
       1679, 2927, 6198, 6968, 4446, 2993, 1350, 6486, 5298, 5021,  976,
       6102,  255,   45, 5408, 1397, 1004, 8114,  596, 5273, 5716,  837,
       7083, 7057, 7574, 2915, 7469, 4604, 2656,   78, 5120, 1664, 6174,
       3137, 1826, 8074, 1739, 5625, 5222, 3270, 4666,  185, 3344, 1015,
       2016, 6060, 1655, 6233,  157, 6407, 2539,  687, 1304, 6086, 7226,
       6134, 4740, 1964, 4640,   67, 3717, 5639, 7915, 2982, 4082, 1197,
       5740, 4386, 2256, 5154, 7345, 1008, 6802, 4232, 1303, 5427, 1192,
       5435, 1232, 6351, 7822, 6801, 1158, 3738, 1827, 3069, 2466, 2474,
        890, 7245, 6152,  485, 2119, 6604, 2269,  858, 2516,   71, 5968,
       4544, 4972, 6965,  751, 1250,  750, 3975, 1859, 5294, 4847, 1090,
       7321, 6056,  803, 3953, 5684, 2999, 7449, 6363, 5808, 7377, 3314,
       6330, 3106, 3913, 6034, 7336, 3367, 4979, 4171, 5712, 6401, 3729,
       6017, 5434, 7682, 2195, 5701, 2176, 6091, 4504, 8083,  272, 1366,
       5014, 7027, 6539, 7455, 5921, 2053, 3729, 3588, 7313, 4598, 2286,
       6032, 2506, 5488, 2910, 3501, 2061, 7917, 1815, 1543, 7721, 2491,
       2905, 3701, 7455, 6128, 8128, 4713, 4328, 5805, 4860, 2738, 1428,
        234, 7616, 8003, 5014, 5190, 7656, 1250, 3078, 8069, 8104, 6290,
       6778,  328, 5046, 7845, 1932, 7127, 5935, 7787, 5761, 5931, 8122,
       5918, 7863, 5920, 5966, 6139, 2309, 3593, 5678, 1136, 5815,  687,
        499, 1392, 2200, 1067, 1171, 8026, 3277, 8038, 3594, 6835,  936,
       3475, 3767, 1317, 1115, 7252, 4010,  216, 2498, 7893, 4679, 1002,
       2721,  510, 2604, 4874, 2954, 2994,  394, 7701,  716, 5071, 5114,
       7457, 3681, 2203, 3303, 3253, 5388, 6088,  352, 2447, 4184, 1733,
       6416, 6397, 7572, 6671, 5520, 6633, 7671, 5747, 6052, 4640, 6407,
       3334, 4525, 6265, 3635, 1072, 5430, 8092, 7230, 2428, 4268, 6463,
       6135, 4280, 6249, 1582, 2050, 6908, 2136,  108, 1856, 7157, 6912,
       1269, 4978, 2181, 8156, 7887, 7854, 6581, 6165, 4204, 7128, 6257,
       6296, 6826, 5831, 4522, 3488, 2668, 5869, 6831, 3343,  887, 5520,
        460, 4918, 3504, 1494, 4699,  366, 1247, 2861, 6630,  190, 1613,
       3018, 7992, 1274, 4733, 4241, 8089, 5567, 7356, 4565, 2037, 2949,
       7654, 6619, 5106, 1248, 6035, 5949, 2421, 6283, 1347, 1919, 4925,
        226, 7541, 5603, 1318, 2653, 3729, 7955, 6367, 1418, 7823, 7120,
       8055, 6390, 8057, 6677, 5912, 5246,  553, 2271, 3719, 6501, 5317,
       5198, 2032, 4320, 1423, 3002, 1088, 7759, 3630, 3908, 2001, 6083,
       5642, 3272, 1405, 7958, 5603, 4370, 5321,  478, 6161,  743, 2537,
       3665, 2227, 6144, 7538, 5399, 6592,  729, 5338, 6414, 2171, 5813,
       7607, 7212, 2941,  147, 1315, 4584,   65, 1451, 4451, 7529, 7325,
       6912,  115, 2357, 1225, 2887, 7510, 1753, 6363, 2106, 4097, 6037,
       1217, 3683, 5478, 3358, 5397, 4409,  207, 3018, 3092, 4726, 5218,
       3668, 1756, 6033, 4163, 6808, 6139, 4058, 5840, 7191, 4450, 5616,
       7513, 1513, 5486, 1082, 6542, 3668, 7368, 2427, 2020, 6768, 1748,
       4225, 2325, 2416, 3007, 5786, 4164,  916, 1699, 5931, 8095,  997,
       8157, 6038, 7823, 4589, 4544, 5222, 7849, 4301,  431,  623, 7062,
       7672, 6889, 4794, 2131,  250, 3246, 3043, 1327, 3872,  312, 8111,
       7047, 4624, 1690,  690, 5881, 4010, 4775, 4903, 7102, 5239, 6164,
       2694, 1204, 4917, 5102, 3464, 1893, 2181,  626, 4201, 4608, 2618,
       1131, 7383, 7896, 3565, 2928, 4199, 3005, 5410, 5134, 2395, 4721,
       7920, 6824, 3237, 7377, 6474, 5837, 7115, 5601, 4860,  194, 1451,
       5675, 4748, 2035,  400, 1828,  158, 4887, 4677, 3401, 2976, 7091,
       1130, 5827, 6347, 6261, 5852, 3152, 4368, 7721, 6539, 1142, 4460,
        631, 5514, 6260, 6301,  679, 7002, 4115, 6134, 4445, 7223, 3656,
       3929,  888, 6974,  101, 6669, 6497, 4807, 6189, 1126, 4349, 8053,
       4389, 4880, 7590, 6488,  918, 6107, 5866, 5415, 6857, 3908, 3354,
       3094, 5573, 8165, 1909, 5332, 4106, 1907, 3077, 1485, 5966, 5831,
       1020,   55, 1058, 1836, 1601, 5654, 7712,  442, 5839, 4167, 1011,
       5415, 1002, 4061, 1765, 5644, 4058, 7462,  923, 4607, 2257, 7699,
       2540, 2595, 4213,  618, 2042, 5488, 5500, 3229, 5369, 6795, 2391,
       6088,  963, 5155, 3341, 7420,  960, 4044, 2913, 2519,  576, 2800,
       6176, 6770, 3259, 2186, 7647, 5416,  327, 1972,  524, 3447, 4762,
        436, 4022, 3109, 2064, 5457, 5444,  966, 6654, 2657, 6698, 4777,
       3890, 4880, 3714, 6570, 5178, 8137, 4660, 1580, 3002, 3982, 3954,
       6049, 4266, 3163,  478, 4016, 2447, 2891, 6733,   91,  390, 4747,
       5335, 5050, 7783, 3791, 1070, 1292, 3890, 1291, 4987, 2410, 1189,
       1112, 1173, 6635, 5180, 1932, 3462, 8035, 2681, 7180, 8186, 5350,
       2721, 6024, 3312,  805, 2724, 3077, 8184, 5628, 2901, 6424, 3187,
        202, 2683, 3757, 6780, 7993, 6953, 1410, 2047, 4186, 3771, 2435,
       4686, 3624, 5541, 1332, 4144, 7941, 1759, 4423, 6781, 2622, 5086,
        659, 5443, 1183, 8040,   70, 4510, 3659, 5103, 2895, 8096, 5337,
       1212, 6363,  362, 2114, 2967, 4325, 7317,  281, 6357,  160, 8121,
         20, 3279, 6863, 5921, 2288, 1173, 4197,  650, 7802, 2049, 8067,
       3208, 2522,  457, 1400, 4960, 2926, 2308, 4834,  951, 1935, 8165,
       6392, 4324, 2674, 3577, 6474, 5095, 3457, 8090, 6070, 2974, 1887,
       5596, 1461, 4332, 3381,  157, 7234,  991, 7214, 7883, 4867, 3799,
       7430, 4452, 2431, 7940, 5753, 6234, 3774,  980, 2869, 7825, 4500,
       4173, 4243, 6267, 5958, 8073, 2287, 8109, 5222, 1371, 6090, 3257,
       4476, 2232, 8169, 6373, 5114, 2036, 7735, 8061, 6913, 1323, 6662,
       2828, 2874, 4090, 6032, 1363, 1406,  281, 2560, 6650, 4607, 1875,
       7687, 1751, 7225, 2325, 1060, 1119, 2884, 1231, 6862, 1282, 5032,
       2588,  416, 5629, 1184, 5584, 3429, 6565, 2890, 3920, 7411, 1256,
       2444, 4229, 5707,  636, 7923, 7350, 2653, 6678, 1555, 7722, 2791,
       4795, 7442, 3289, 1987, 4763,  165,  146, 4304, 5299, 2739, 3780,
       5649, 5221, 2790, 8094, 1184, 5390, 3389, 3958, 7022, 5523, 3549,
       2151, 4258, 1990, 4603, 2834,   32,  614, 6363,  910, 4939, 7502,
       7299, 3656, 2391, 4823, 2259, 7962, 7923, 2560, 1706, 5212, 7359,
       2284,  845, 7491, 5242, 3378, 7653, 3266, 4638,  154, 6983, 3512,
       5808, 1902, 2759, 5539, 5945, 5002, 7594, 3825,  428, 4894, 6952,
       6354, 7967, 6082, 3892, 5188, 3528, 6804, 4821, 3813, 3664, 7372,
       6370, 3445, 3711, 8182, 6947, 1684, 7900,  594, 7988, 6469, 7182,
       1248,   66, 6385, 7554,  661, 4897, 3425, 6400, 3104, 4016, 6590,
       2395, 2712, 4690, 1219, 6531, 4418,   97, 2857, 5542, 6143, 4096,
       2431, 7366, 1529, 3160, 2259, 5329,  483, 1001,  735, 5269,  892,
       2786, 4656, 5172, 7370, 3584, 5075,   23,  345, 6529, 3308, 5188,
       8099, 4455, 3746, 7913, 3145,  296, 5763, 4483, 4905, 7329, 6814,
        170,  452, 4914, 5330,  615,  722, 2767, 3179, 3797, 4418, 5137,
       7798,  749, 2391, 5756, 1169, 6613,  202, 7268,  465, 7068, 2245,
       2245, 1467, 4379, 6887, 7913, 3454, 7100, 1784, 6999, 5148, 2024,
        939, 4092, 2145, 5744, 6046, 7433, 7754, 2391, 6243, 4642, 1036,
       2326, 6046, 6706, 5368, 1822, 1464, 6912, 1711,  708, 5819, 4372,
       1211,  941, 7370, 1432,  196, 6526, 7418, 3877, 5756, 8187, 4157,
       6104, 8063, 3362, 7588, 6246, 1849, 3942, 3874, 2007, 1114, 5703,
       5331, 4496, 4259, 5945, 7988, 2327, 6310, 7480, 4393, 1046,  181,
       1671, 3381, 2002, 6267, 1812, 7316, 6621, 4072, 6465, 3529,  983,
         13, 4840,  269, 1157, 1938, 4756, 7128, 5555, 4886, 6551, 3887,
       6741, 3283, 3778, 2589, 4114, 6660, 2675, 6340, 6947, 7773, 4323,
       5623, 7873, 3408, 6245,  759, 4070,  604, 2078, 7093, 4427, 6702,
       3059, 5767, 2796, 5308, 3408, 1835, 3164, 2209, 2152, 6277, 5865,
       6067, 5790,  423, 4093,  730, 5355, 5189, 3154, 4179, 8052, 7865,
       6437, 1893, 5222, 6285, 7413,  775, 1014, 6425, 4670,  736, 3286,
       7714,  142, 2019, 2399,  224, 6584, 1143, 3365, 2007, 1254, 1737,
       1209, 4839, 6827, 1959, 4459, 5299, 6279,  566, 2435, 4387, 2979,
       1640, 2589, 3874, 5398,  515, 1282, 1108, 2766, 8170, 1614,  860,
        474,  891, 4347, 1425,   91, 4271, 2332, 6129, 1774, 6739, 7378,
       4627, 2294, 2236, 3371, 4715, 4126, 1368, 4360, 8022, 7520, 1968,
       2393, 2467, 4941, 2676, 5510, 1375, 6491, 7197, 4663,  208, 7191,
       2608,  645, 6026, 2169, 2809, 2373,  526, 6005, 6251, 1389, 4671,
       6040, 3735, 8068, 7487, 4823, 5455, 5377, 1009, 2486, 3838, 1926,
       5906, 4131, 5153, 4112, 4326, 2794, 2304, 6323, 3121, 5026, 1808,
        484, 4632, 1805, 6438, 4698, 2594, 5334, 6536,  212, 2003, 4802,
       1565, 7184, 2081, 5956,  160, 2122, 5621, 5847, 6907, 4833, 5113,
       3979, 5067, 2673, 3666, 7687, 4203, 6437, 1146, 3947, 4708, 4444,
       4434, 5319,  366,  684,  276, 3794, 2234, 5570, 6208, 4815,  968,
       4449, 2320,  567,  403, 4312,  146, 7145, 6402, 3055, 3521, 3589,
       7203, 3020, 5915, 4296, 4887, 5700, 4253, 6752,  504, 4117, 1353,
       5402, 7948, 5866, 1840,  979, 4450, 5176, 2181, 3467, 7761, 2528,
       5186, 3235,  421,  134,  213, 6912, 4157,  234, 7572, 3484, 6133,
       2612,  293, 1871, 2139, 8102,  921, 7963, 2919, 2439, 3007, 6003,
       4968, 2944, 6253, 1751, 2450, 8126, 6465, 1568, 6751, 1527, 7695,
       8044,  498, 1289,  674,  709, 1341, 5382, 5621, 5525, 6774, 6274,
        303, 4181, 2298, 6630, 1437, 6644, 4104, 2695, 1224, 7786, 6187,
        211, 3214, 4095, 8079, 7071, 6876,  865, 2329, 5781, 8094, 6057,
       5437, 3103, 7611, 6074,  495, 6871, 4872, 3352, 2218, 1787,  863,
       3455,   72, 6408, 5300,  707, 1880,  950, 5785, 7366, 2513, 7793,
       7881, 1679, 2301, 4325, 1393, 3557,  231,  314, 4772, 2947, 6336,
       5534, 3577], dtype=int16)


test outputs value:
%2, shape: [1, 96, 5, 5], exponents: [-13], 
value: array([ 2845,  7339,  5400,  6867,  4221,  7799,  6357,   643,  6285,
        8912,  7749,  7810,  9919,  9872,  3332,  3730, 12754, 13833,
        6066,  9679,  8269,  5581,  5777,  6813,  8535, 13406,  8940,
       13863,  2127,  6051,  7843,  8938,  9227,  9073,  7561,  8492,
        6884,  4889,  3372,  6386, 10603,  8673,  9980,  9597,  8359,
        9054,  1929, 11659, 12833,  3986,  9021,  7307,  6988,  3915,
        6117,  6583,  7785, 11633,  6174,  8604,  5631,  5418, 12405,
        9492, 10281, 13787,  3793, 11185,  2162, 12452,  8399, 10247,
        9666,  8218,  6964, 14311,  9248, 11785, 12510,  7598,  7511,
       14533,  4571,  5529,  5026, 14583,  7392, 14875,  3003, 10652,
       14882,  9253,  7756,  8223,  5834,  9503, 13003, 10980,  8115,
        7843,  2287,  4371,  7697,  9383, 13953,  7555, 14548,  8495,
        4473,  4495,  2989,  2507, 11006, 10198,  4974,  5395,  4579,
        4650,  7818, 12512,  8281,  6099,  8972, 13664,  5364, 11879,
        2449, 12421,  9460, 10251, 14085,  8175,  6199,  4341,  8620,
        8771, 10098, 12591,  8457,  9206, 10929,  2754,  8052,  7029,
        3416,  3432,  8467,  6094,  8677,   774,  5477,  8864, 10944,
        8431,  7853,  2921,  2977,  6130,  4381,  4675, 13996, 14441,
        4678,  2440, 11828, 12447, 12268, 11844,  4757, 11031,  7461,
        8979,  3405, 14209,  7219, 13097,  4035, 11014,  9819,  6647,
        9269, 11289,  6210,  9649,  6021, 11862,  8001,  7507,  9312,
        5524,  9402,  6121,  5567,  2671,  8269,  2542, 11532,  3478,
        9681,  1462,  7759,  8459, 14810,  7981,  7160,  9578,  9523,
        4397,  8539, 13676,  8838,  6363,  8622, 10775, 11507, 11017,
       12083, 11591, 15031,  6825, 10213,  5435,  8641,  7514, 12023,
        9267,  4990, 10407,  5300,  8917, 15099,  8477,  5059,  8777,
        8274,  1984,  3276,  4443,  5914, 13942, 10820,  7642,  4931,
        6453,  5367,  9897,  7988, 14500, 13035, 12619,  8623,  6308,
        8224, 14125,  5125, 10095,  8878,   844,  7219,  5912,  1582,
       15141,  9399, 10238, 10432, 12720,  6079,  5015, 12983, 11064,
        9097, 10714, 10742, 13986,  9448,  1810, 10715,  7074,  9313,
        8851, 14450,  6923, 10297,  3784, 14575,  2707, 11573,  7922,
        5762,  6941, 11638, 12290,  7988, 13196,  9863, 10766,  9709,
       11296,  9694, 11561,  8938,  6627,  7950, 13979,  8050, 13563,
       12022,  9267,  2473,  4642,  8403, 10417, 13612, 11861,  8419,
       15022,  9885, 13362, 12905, 12371,  6672,  8981,  9872,  9698,
        2690,  6831, 12018,  9855, 11902,  5174, 16086, 15353, 12642,
       14115,  8254, 13836,  9126, 10475, 11268,  9039,  3867,  8786,
       10010,  6599,  7935,  4619,  6093,  5509,  7641,  4260,  8356,
       11794,  2876,  9006,  4110,  8860,  4093,  8719, 12908,  4703,
        6520, 12035,  7049, 12824,  4387,  8366, 10981, 10963,  8714,
       11229,  7276, 14554, 13019,  6921,  8346,  7314,  2747,  8909,
       12216,  9572, 11821,  5584, 13407,  3783,  9556,  8811, 11855,
        4199,  2514,  5867, 14731,  9150,  8492,  4510, 11301,  7871,
        9139,  3573, 15415, 15257,  2528,  1970, 12726,  2828,  4802,
        6831, 14065,  8036, 14088,  1891, 11562,  5685, 12285,  4510,
       11607,  5225,  9374,  3972,  8803,  3890,  8788,  6272, 12773,
        4961, 10005, 10856,  9175,  8287,  7927,  8655,  8072,  7313,
       11058, 10308,  7996,  8317,  9455, 14094,  7724,  3690, 11495,
        9897,  2688,  4417,  8253,  8356,  2696, 12665,  9536,  6483,
        9690, 13533, 13206,  1471, 10647,  8403,  8248,  7690, 14641,
        3571,  7600,  8489, 11318,  8412,  7565,  7081, 10720,  7662,
        2597,  7667, 10382, 14592,  6583, 12287,  5860, 13739,  9893,
       14138,  8217, 11344, 10671, 12203, 11821,  8987,  8375,  4634,
       14516, 10481,  6129,  7165,  3353,  9619, 14022, 10469,  9159,
        9036,  7091,  5966,  8696,  7466,  9769, 10376,  8759, 13987,
        8294,  7380,  7749, 13166,  3901,  7070,  8744, 13136,  7470,
       10071,  8771,  3498,  5311,  5946,  5873,  5679,  6659,  8929,
        1918, 12651,  5515,  8816,  6505, 12646, 13552,  5362, 12506,
       12341,  5386,  7290,  8228,  2482, 16131,  9021,  4945,  8887,
        5537,  8799, 10844,  6956,  9103, 10896, 11090, 12584, 13192,
        6206,  4818,  7330,  7981,  9814,  8994,  3284,  7978,  6059,
        5161,  7250,  5898,  9501,  8643,  8204,  8163,  6647, 14634,
        9869,  4355,  9855, 11091,  4430,  3613,  5387,  9558,  9179,
       12644,  5735, 11080, 10643,  8959,  7508,  4641,  7552,  4958,
        6212,  6006,  5405,  7107,  8808, 10144, 10406,  7800,  3946,
        8408,  3559,  4032, 11735,  5388, 11508,  7970,  9264,  7304,
       13059, 12834,  5108,  9127, 13603, 13917,  6882,  7685,  1852,
        9893, 13712,  8327,  6248, 11607,  8192, 12559, 11721,  7352,
       11563,  7547, 13434,  5063,  3887,  9653,  5743,  4340, 12714,
        1417,  8302,  8683,   657,  9085,  4175,  9088,  8704,  6472,
        7822,  4663,  4298,  2100,  9817,  6316,  6583,  1999,  6731,
        7761, 13912,  9277,  4674,  8513, 12744,  4562, 10154, 11972,
        4874, 15596,  9610, 11472,  8609,  2138, 13932,  5193,  7719,
       12665, 11142,  1967, 14156,  6513,  1561,  7848, 12081, 10239,
        5869,  7396,  8814, 11214,  9710,  5731,  7970, 11132,  4665,
        4540,  5033,  8606,  9072,  8015,  9415,  7878,  2963,  9701,
        6167,  7049,  1837,  8711, 14650,  8027,  9556,  8453, 11673,
       12519, 12851,  3107, 10243, 13788,  7926, 10779, 11938,  5929,
        7773,  4671,  8083,  9289,  5120, 14171,  2831,  8591,  3516,
        3659,  5647, 12955,  1918, 13888,  9758,  6916, 12700, 12433,
        7835, 12148,  7407,  8479,  6196, 10115,  6550, 10206, 10552,
        6271,  6805,  8403,  9666,  7554,  6209,  8898, 14300,  8097,
        7088,  6984,  9722, 11467,  7174,  6842, 10802,  3037,  3604,
        6811, 10606,  5923,  6326, 10375,  4598,  7221,  4266, 11483,
        7165, 14359,  5181,  6573, 14002,  4909,  5801, 15141,  7345,
         663, 12061,  8231, 10779,  8832, 11449, 11684,  5521, 14259,
        7034, 10056, 12007,  8620,  2730, 15612,  5710,  5599,  5622,
       12571, 11411,  9066,  7984,  7631,  9961, 11824,  7361,  9225,
       10473,  5828, 11028,  8242, 10314,  6088, 11219,  4746,  9423,
        8961,  4707, 13005,  1915,  5191,  5210,  7303,  6053, 10839,
       11136,  3335,  1248, 10828,  6611,  9341, 10311,  7543,  8428,
        7853,  5256, 11325,  3970,  6761,  6984,  8206,  8681,  9925,
        9454,  4739, 13290, 15721, 11720,  6229,  2202,  4283, 11071,
       11805,  4998,  6236,  6873,  9643, 12766, 14040,  4878, 10865,
       10501, 16183,  3174, 10319,  5539,  8568, 11870, 10920,  9048,
        5429,  5827,  8102,  8343, 13406,  8211, 10235, 10281,  4274,
        7118,  6954, 14805, 11329,  3716, 10052, 11839,  8797,  9087,
        5761,  8478, 11972,  9295,  7899, 14723,  4631,  6011,  7731,
        2219, 10153,  2316, 11273,  9062,  9782,  3998, 14508,  6031,
       15782,  7829,  8452, 10535,  6386,  5835,  6007,  8258, 10946,
       13976,  2114,  9525, 13923, 14922,  6818,  8439, 14108, 10763,
       13413, 13120,  7172, 13681, 10021,  8314,  1394, 11386, 11306,
       10441, 11742,  1088, 12079,  6398, 10235,  8638, 10471,  2876,
        4001, 11688, 14172,  5230,  9952,  4818, 12532,  5967, 12051,
        7949, 13712,  1715,  4194,  8161,  5965,  4796, 10857,  5396,
        7162, 13866,  1967,  9435, 13053, 15578,  9852, 13983,  5761,
        3409,  3034,  9401,  7068, 10076,  5031,  4048, 15356,  1891,
       10423,  5230,  5517, 12719,  1726,  6547,  7982,  4861, 12813,
        7309, 11396,  3613,  7748,  4871,  4239,  7041, 10551,  8165,
       13695,  7331,  3350, 11969,  2243,  7867,  8764, 10993, 10171,
        6974,  7042, 11452, 12311,  4561, 11200, 14687,  4666, 11194,
        5650,  7138, 12401,  1995, 10190,  4500,  8145, 11224, 12110,
        1642,  6783,  7686,  9546,  9619,  3795,  5125,  9195, 13845,
        2535,  4411,  8634,  9483,  1055,  4475,  3657, 10740, 10751,
       11859, 10200,  5549,  3859,  7457,  4034,  5914, 10477,  7743,
        8746, 13638, 13740,  1269,  9440,  8590, 10949, 14497, 13218,
       10186, 13921, 10241, 12573,  3561,  6549, 12682, 11727,  3850,
       12922, 11630,  5929, 13566,  7166,  8440,  6902, 14595,  3031,
       13627,  5789,  6143, 10664, 10760,  5093,  7649,  5601,  9036,
       14453,  8822,  7282,  9796, 11276,  5348,  8966,  7349,  9843,
        6927,  5276, 10062,  4917,  8428,  7931, 13690,  7927,  7414,
       10106,  5097,  4601,  6536,  8895,  7313, 15654,  6779,  7196,
       13810,  7700,  8370,  4297,  2935, 12507, 13563,  9109,  9076,
       12638,  4391,  6730,  8127, 12874,  9069, 10585,  4177,  9991,
        9191,  7881, 10968,  7012, 15829,  8414,  9570,  9269, 13324,
       10443, 13710, 13339,  7664,  8659, 10452,  6862,  6692, 10815,
        6290,  4174,  9281,  2558,  1238,  4237, 10970,  6209,  8350,
        6326,  9230,  6746,  8486, 11864,  4632,  2474, 10197,  4376,
        3096,  6451,  8241,  8859,  7137,  8715,  3410,  4081,  9221,
        4352,  4992,  7211,  7949,  1204,  9803, 10826, 12133,  6365,
        6716,  6866, 10134,  8109,  9795,  5128,  9789,  5333,  2072,
       13571, 12514, 11831,  9700,  8180, 13293, 14389,  7920,  7228,
       10632,  8786,  7762,  9204, 11675,  7682,  8904, 12133, 13800,
       13814,  3262, 10885,  7077,  6672,  4653, 10951,  3213,  9810,
       14380,  2532,  4689,  4077, 11670, 10809,  4682,  8593,  2950,
        9038, 10766, 13902, 10471, 12662,  4453, 13613, 11560,  7440,
        9185, 10786, 10375,  5216,  8016, 12988,  7017,  7119,  6412,
        7408,  6107,  7336, 11120,  5769, 12243,  4302,  7818,  6065,
        8047,  2941,  5817,  7779, 15363,  5280,  6279,  5904, 11633,
        7241, 13316,  6544,  4180,  6316, 11707, 13969,  9266,  7265,
       10513, 12590, 10423, 11999,  5336,  6053,  9617,  2888,  8802,
        6915,  3498,  9162,  5023, 10722, 12677,  8403, 10045,  9452,
       12042, 10711,  8662, 12038, 12240, 11627,  8615,  4230,  6293,
        8823,  6756, 11332,  8786,  9590,  5925,  7714,  3795, 11148,
        9556,  8898,  2353,  8006,  6111,  7216,  5957, 12168, 13787,
       11016, 12978,  2171, 10962,  7415,  4895,  9830,  6158, 12938,
       14547,  7920, 13066,  6020, 11074, 10462,  5107, 13781,  9460,
        8254,  9408,  1806,  1441, 10567,  2655,  8397,  8471, 10723,
       13922,  8674,  1015,  2816,  3471,  6949, 13883,  3693,  9143,
        8225, 10266, 12165,  2143,  8727,  9881,  8555,  7623, 11896,
        7333,  3710, 10149,  6919,  5348,  8459,  5781, 11281,  4809,
       12239,  6762,  4313,  7147,  8814,  8868, 12570, 13795,  3773,
       12665,  1584, 14175,  7163, 12469,  3175,  3581,  7960,  9664,
        8571,  9884,  7699, 10134, 12365, 10152,  2714,  6506, 10569,
       13149,  2891, 15078, 11618, 13017,  4852,  4779, 12195, 12426,
        6094,  7558,  6014,  8233, 12611,  8035,  7674,  7673,  4073,
        4092,  7737,  2426,  8942,  5167, 14674, 12901, 11413,  9768,
        2393, 13052,  5846,  6893,  9719, 13271,  9676,  7524,  2880,
        4265, 11738, 10596,  6011,  4103,  5886,  7913, 10860,  6804,
        8853,  7214, 12993, 14496,  5391,  5975,  5868,  9618, 13502,
       12100,  2746, 12198, 11244, 11475,  9811, 13069,  9757,  9857,
       11693,  9847, 11657,  7280,  4737, 10378,  9645,  4523,  5751,
        5079,  7357, 10143,  9018, 10394,  4819, 10199,  4596,  8851,
       13547,  9445, 10610, 10015, 11061,  9797, 12787,  8419,  9678,
        5345,  9433,  8754,  7376,  3739,  9276,  7625,  9331,  9426,
       15259,  9460, 10763,  3569, 13671,  1511, 12678,  8048,  7995,
        9136,  4065, 11845, 12551,  5545, 12757,  8577,  6808,  7795,
       14121,  8941,  6631, 10115,  7922,  4570,  4022, 11334,  9694,
        7402,  8632, 11453,  9426, 11147,  5996, 13920,  6319,  4834,
        5238,  1227,  3692,  3587, 13498, 13738,  2331, 13846,  4668,
        7637,  7486,  4244,  5808,  3674, 10860,  7044, 15592,  8952,
        7140,  6229, 13607,  9922,  5874, 12233,  1571,  2347,  9507,
        7517,  9365,  9297, 14155,  4275, 14240,  7769,  7962,  4723,
       10277,  3853,  6503,  7291,  8533,  8194,  6874,  8045,  9293,
        7399,  3649, 11132,  6826,  2928,  9838,  7390,  7295,  8686,
        6284,  4180,  8699,  9111,  6977, 12247,  1195, 11190,  7392,
       10454, 11017, 10692, 12295,  9146,  8573, 11839, 11324,  7605,
        4336,  5204,  4398,  4083,  7769,  6879,  8168,  3850,  8105,
        3772, 10820,  9295,  1889,  7442, 12541,  5477,  7665, 12879,
       10544,  7033,  7720,  4912,  7437, 10457,  3567,  5351,  8032,
        2930,  7485, 11033,  5601,  9544, 13937,  4627,  7343, 10992,
        6991,  6540,  9525,  9551,  3335,  6595,  7248, 11198,  6512,
        9344,  9972,  9144,  5908,  4267,  9264, 14655, 12245, 15067,
        6308,  6194, 12126, 11936,  7068, 10109,  9626, 10169,  2840,
        6319, 11269,  3222,  8150,  8756, 10438,  7918,  3070, 12470,
        8200, 13794,  1783,  7290,  4209,  6319,  3605, 14495, 10354,
        6789, 10375,  7482,  9863,  6158, 11250, 10625,   354,  8681,
        1675, 10169,  3863,  5981, 14571, 10203,  4743,  7457,  6673,
         944, 13492,  2065, 12354,  9774,  8229,  5589,  5437,  5259,
        9004,  4387,  6096,  7654,  4698, 14611, 12431,  7997,  9256,
        9298,  8037, 10717,  9616, 16139, 13253,  5248,  6254,  8372,
        7553, 10612,  5625,  7247,  8529,  4680, 13609, 14697, 10576,
        4115,  8362,  5963,  4960, 13295, 11527, 11920,  6000,  6193,
        7014, 12271, 11362,  4400, 11114,  9796, 12349, 10764,  7429,
       13095,  9023,  7032,  8723,  5870,  9813,  8496, 13067,  8489,
        5410,  3803, 14239, 15352, 10985,  1788, 12479,  9776,  6554,
       10990,  6109,  7114,  7112,  1628,  7834, 14609, 11610,  2330,
       13076,  3636,  8356,  6010,  7397,  8694, 10051,  3064,  9890,
        6014,  7364,  4821,  8564, 10359,  8084, 10612,  4223, 14749,
        3526,  5871,  8399,  2452,  5899,  4963,  6653,  3028,  8611,
       11310,  5184, 12995,  7425, 14226, 10676,  7793, 13915,  9630,
        4757, 12893,  6809,  7563,  9280,  5355,  4624,  7578,  8813,
        5906, 10288, 13440,  5394, 13494,  5444,  7498,  9315, 11437,
        7479,  4009, 10134,  8851,  7624, 10156,   679,  7347, 12361,
        3405, 11855, 12802, 14782,  5134,  3017,  5606,  8121, 15439,
       15881,  5514,  9609,  6570, 12316,  2952,  5498,  9654,  7909,
        5043, 11865,  6966,  4681,  4520,  8227,  9756, 10456,  8824,
        6376,  8789, 10615, 12463, 10788,  4440,  3177,  5473, 13930,
        8487, 11158,  9350,  5655, 13075,  8928,  6880,  6474,  9768,
        7795, 14233,  7881,  4048,  4513, 13776, 13835,  8324, 12360,
        4910, 12948, 12240, 13690,  3064,  6948,  6715, 10189,  3125,
       12001,  7130, 10529,  9979,  5410, 14313,  7115,  3268, 10567,
        4279, 14121,  7442,  6281,  4770,  5818, 12575,  5073,  4325,
       14356,  8529, 10784,  8624, 10315,  6394,  7040,  5515, 11823,
        1451,  6935, 12181,  8963, 14670,  5314,  6937,  2816,  7207,
       13028, 10256, 13343, 11242, 11396,  7855, 14129,  6482,  6098,
       10381, 11175,  8819,  8921, 11716,  7630,  6161,  8172, 11310,
        7946,  6397,  8874,  8055,  4619,  4689,  5642, 13324,  3417,
        5259, 10741,  1188,  7658,  2920, 13395,  8119, 11807,  7526,
        7353,  9557, 12188,  9319, 10394, 11625, 13980,  5104,  7081,
       11548,  4436,  3058,  4111,  6698,  6880, 13020, 14608,  9064,
        9146,  6289, 12110,  1572,  2587,  9409, 14069, 12624,  1907,
        6490,  7118,  3590,  2244,  9185, 10857,  5218,  1655, 14005,
        7109,  8246, 12330,  9106,  8492,  9419, 11088, 11437, 11617,
       12978,  8300, 11425, 11808,  2878,  4142,  8425,  6849,  6473,
        9060, 10329,  8839,  9996, 12763, 13822,  5181, 11385, 12960,
        5916,  5126,  2344,  2717,  4664,  8931,  6837,  8938,  8081,
       14257, 11846, 11998,  6787,  4680,  6438,  9032,  6483,  7285,
        4006, 12664,  9909, 10437,  5512,  7068,  5079, 12056, 10941,
        8267,  9313,  9451, 14088,  9373, 13694, 11338, 12779,  8085,
        6604,  8231, 10115, 11812,  3260,  6095,  5326,  9685, 10393,
        6701, 14639,  7318, 10539,  3743, 12308,  4139,  6153,  4353,
        6093,  7010,  9378,  7398,  8154, 13341,  1274,  4099,  8632,
        5625, 11518,  8367, 11050, 10446, 14871,  6538,  3546,  6627,
        7703, 10080,  8575,  8325,  7813,  9568,  2570, 10039,  7854,
        5161,  3979,  2695,  6614, 10216,  3083,  4532,  9082,  1633,
        9228,  6245, 10418, 12399,  4861,  8917,  7040, 11610,  4009,
        6086,  5731,  9050,  9124,  9980, 11112,  5880,   926,  2847,
        1757,  8093,  8557,  3645,  5963,  2200,  4005,  7120,  5965,
        5418, 11494, 10349,  9417,  6654, 14644, 12189,  5843,  9051,
        9350,  7923,  4844,  4369,  4621,  8806, 13830,  8750,  6992,
        3231, 10092,  5202,  5424, 12994,  5977, 12393,  8062,  7460,
        8156, 11657,  4479,  2713, 13099,  4680,  3216, 10282,  1506,
        8034, 10558,  4224, 10534,  7370,  8546, 12149,  9098,  7911,
       10785,  5878,  5027,  3270,  7009,  9030,  6669,  6379, 11172,
        4562,  8914, 10787, 10341, 14494,  7669,  6077,  3428,  1435,
        7239,  9281, 12809,  8229,  7905, 10590,  7074,  8329,  7011,
        8921,  5649, 14024,  9689,  8638,   265,  4714, 12275, 12965,
       12949, 12607, 10542,  6447,  6796,  6286,  6476,  9326,  6759,
