graph main_graph (
  %onnx::Add_0[INT16, 1x96x5x49], exponents: [-12]
  %onnx::Add_1[INT16, 1x96x5x1], exponents: [-12]
) {
  %2 = Add[quant_type = 'S16'](%onnx::Add_0, %onnx::Add_1)
  return %2
}


initializers value:



values info:
%onnx::Add_0[INT16, 1x96x5x49], exponents: [-12]
%onnx::Add_1[INT16, 1x96x5x1], exponents: [-12]
%2[INT16, 1x96x5x49], exponents: [-12]


test inputs value:
%onnx::Add_0, shape: [1, 96, 5, 49], exponents: [-12], 
value: array([1409, 1030,  156, 2814, 2463, 1969, 1645,  533, 1308,  514, 1744,
       3632, 3920, 2452,  343,  743, 1927, 3861, 1609, 3293, 1650, 1757,
       3438, 1319,  552, 1622, 2488, 2118, 2802, 3855, 3471, 2844, 3082,
        258, 3502, 2358, 3100,   94, 3339, 1734, 2038, 3376, 3192,   90,
       1610, 3461, 3520, 3569,  549, 3386, 2692, 2927,   24, 2392, 3064,
       2052,  516, 1521, 3952, 1621,  381, 1260, 3778, 2502, 3994, 3963,
       2263, 1059, 1656,  762, 3998, 3049,  995, 1067,  488, 2801, 1805,
       1476, 2452,   94, 4046,  181, 3870, 1140, 1583,  553, 1675, 2837,
       3021, 1764, 2636, 1288, 3678, 1563,  850, 1788, 1220,  449, 1018,
       4037,  956,   63, 1555,  533, 3127, 3997, 3062,  275,  197, 1696,
        273,  190, 3467, 3440, 1268,  548, 2925, 2968, 2318, 2208,  239,
       3184, 2054,  929,  738,  898, 3862, 2339, 3851,  563, 1387, 2083,
        234, 3513, 1947, 1294,  512,  149, 2693,  837, 3359, 3039, 1790,
       2578, 3476,   55,  232, 2745, 3195, 2910, 2970,  760, 2536, 2657,
       3304, 3174,   26, 1220, 1093, 2764, 3385, 3914,  918,  343, 3241,
       2039, 1698, 1802, 4088, 2469,   59,  843, 2715, 2649, 1522,  257,
       2944,  800,  694, 1737,   51, 2254, 3954, 3800, 3829, 2055,  175,
       3496, 3501, 2932,  608, 3816, 3817, 2794, 1434, 3909,  772, 4033,
       3213, 1806, 3230, 1047, 2131,  984, 3456, 3667, 1640, 2635, 3550,
        930,  619,   13, 1236, 2613, 1651, 1330,  321, 3635, 2525, 1026,
       2125, 2960, 3779, 3539, 3816, 3237, 2991, 2423, 1436, 2187, 1687,
       3464, 2013, 3965,  821,  872, 2837,  805, 3476, 1910, 2226, 2554,
       2217, 3825, 2667, 4023,   23, 1564, 3081, 3269, 3996, 1947,  807,
       1324,  439,   56, 1857, 2890, 1833, 2673, 2504, 1970, 2658, 3959,
       2463, 2893, 3083, 2461, 3761, 3953,  285, 2399,  398, 2173,  632,
        924, 1176, 2652, 2077, 1169, 1893,  140, 2339, 1355, 3193, 1368,
        610,  657, 3300,  497, 1223, 2355, 2402,  504, 2495, 3391, 2816,
        884, 3381, 3130, 3787, 1283, 1687, 1035, 3031, 2413, 2974, 3440,
       4066, 4052, 1724, 3568, 3385, 2655, 2344, 3781, 2817,  448, 2442,
        123, 2061, 2953, 1260, 2415, 3955, 1879, 1807, 1553, 2103, 2459,
       1811, 2822,  472, 1195,  602, 2686, 3766, 4037, 3492, 1265, 2329,
       2628, 2386,  722, 2281, 2761, 1634, 3934, 2443, 1139, 3348, 3853,
       3919, 2260, 1992,   90,  994,  115, 3969, 1966, 3272, 3545, 3823,
       3275, 1599, 3565, 3763, 2612, 2161, 3583, 3030, 1565, 1458, 2445,
       1826, 1928,  277, 2513, 1905,  142, 3830, 3930,  554, 2372, 1761,
       2939, 2503, 3525, 2876, 3022, 2775, 1545, 2891, 3463, 1053, 1623,
       1554, 2268, 2097,  893, 1564, 1368, 1974, 1733, 2662, 1820, 3128,
       1944, 3172, 1134,  289, 2564, 2159, 3863, 4009, 1323,  549, 1801,
       1379,  659,   84, 1523, 3594, 3415, 1829, 1727, 1630, 2266, 2844,
       3479, 1329,  678, 2453, 3861,  464,  454, 3232, 3905, 2471,  497,
        705, 2521, 2585, 1105, 2053, 2705, 1607, 4035, 1508, 1016, 3184,
       1770, 3647, 1661,  331,  291,   94, 1604,  349, 1640, 3337, 2562,
       1073, 1002, 1367,  414,  262, 3495,  394, 2769, 2145, 3824, 2920,
       1492,  403, 2123, 3049, 2940, 2456,   60, 3874, 2907, 1327, 3663,
        474, 1617, 3874, 1382, 4008, 2547, 3873, 3173, 2298, 2841, 1260,
       3110, 4067,  853, 1857, 3773, 1983, 1502, 3136, 3553, 2449, 3208,
       1753,  553, 2864, 3090, 2570,  691, 3427,  807, 1248, 1496,  933,
       3621, 2861,   49, 1344, 2574,   43, 4092, 1683, 1802, 2337, 2790,
       1430,  439, 1337, 3514, 3487,  144, 2073, 4048,  702, 1354, 1525,
       3551, 1163, 1437,  300,  440, 4041, 2143,  576,  661, 3362, 1139,
       3014,  209, 3516, 1339, 1336, 1094, 1046, 3494, 2150, 1631, 1676,
       2278, 3934, 3775, 2064, 3957, 3442, 2855, 1773, 1558,  127, 3856,
       1276, 2785, 1331, 3491, 2319, 2010, 2621,  285, 1180,  717, 1527,
       3264,  804, 2928, 2241, 1661,  844,  885, 1292, 3859, 2327, 3188,
       1617, 3250, 4054,    6, 2225, 1763, 1505, 1473, 2002, 2726,  952,
       2755, 3063, 1021,  698, 2694, 3068,  373, 1701, 1920, 1872, 3124,
       1840,  924,  680, 2132, 3935,  197, 2061, 2858, 1462, 2542, 2035,
        572, 3598, 2411, 3690, 3632, 1297, 1118,  243, 2673, 3027, 3295,
       2425, 2838, 1139,  566, 2595, 3442, 1394, 3869, 1257, 3029, 2772,
       3585, 3428, 3147, 2923, 1099,  300, 4096, 1819, 3790, 1747, 2630,
        449, 2113, 1921, 2568, 1349,  898, 1162, 4027, 1652, 1827, 1591,
        714, 3280, 2646,  352, 1613, 3731,  562, 2681, 2069,   69,  972,
       3377, 3027,  231, 3637, 1060, 2668, 3580, 2630, 3859, 1345,  307,
        572, 3757, 2834, 1655, 3870, 2437, 2489, 2576, 1781, 3676,  410,
        857, 3787, 2183, 2680,  896, 1940,  727, 2599, 1565, 1025, 3723,
       2890, 2768, 2273, 2612,  902,  834, 2725, 2088, 3980, 1161, 1985,
       2434, 3615,  284, 2042, 3819, 1801, 3907, 4015, 1650, 1778, 2443,
       3057,  296, 3007, 2436, 3603, 3381,    7, 1909, 1453, 2875, 3536,
       1143, 1453, 1898, 3975,  767, 3335, 3935, 2091, 1343, 2676, 1242,
       3141, 2676, 3064,  443, 2251, 3978,  682, 2628, 3330, 1325,  621,
       2294, 2879, 3178, 2423, 3287, 3240, 1292,  942, 1435, 2123, 2882,
       1842, 3182,  302,  308, 2243, 1931, 1096, 1558, 1618, 1016, 4061,
       1674, 2643,  305, 2104,  547, 1373,  974,  689, 2437, 1308, 2454,
       2746, 3283, 2209,  807,  153, 3340, 3599, 2539, 1596, 2648,  300,
       2103, 3309, 2911,  887, 2223, 1710, 2670, 1148, 3379, 1251, 2277,
        677, 2145, 2861,  443,  624, 3995, 1424, 3274, 2508, 3488,  541,
        547,  403, 3906, 1850,  508, 4090, 3155, 1089, 3334,  380, 1957,
        754,  145, 3747, 3870, 1602, 2170,   66, 3479, 1361, 4040, 1230,
       1309, 1843, 2127, 2254, 3166, 2479, 2057, 2989,  856, 1998, 2673,
        114, 3446,  628,  602, 3495,  483, 3759, 2607, 1834,    2, 2431,
        268, 2740,  532, 2757, 1820,  400,  871,  580, 2115, 1174, 2394,
        777, 1773, 2060,  380, 2290, 1755,  225,  992, 1245, 3524,  796,
       2198, 1632, 1332, 2056, 1008,  336, 3609, 3941,  142,  830, 2899,
        359,  744, 1509, 2534, 2207,  837, 2313, 3120, 1141, 1865,   46,
       3683, 2537, 2272, 2587, 2088, 1858,  153, 3462,  813,  290, 2193,
       1901, 2840, 1680, 3526, 3372, 1350, 3392, 2017, 1666, 3522, 2593,
       2153,  649, 1341, 1141, 3349, 2910,  640, 2348, 3864,  906,  815,
       1106, 1291, 1158,  796,  105, 2706, 1201, 2155, 3267, 3317,  118,
       4018,  559, 2140, 3540, 3716, 2753, 1785,  717, 2099, 2744, 1067,
        496, 3407,  538,  925, 3282, 3447,  726,  561, 2607, 1109, 4033,
       1629,  412, 1917, 3491,   44,  770, 1847,  237,  149, 3586, 1315,
       1407, 2023, 2699, 2199, 2641, 3697,  598, 1684, 3426,  558, 1902,
         76, 3890, 1725, 3355,  375,  190, 2100, 3162, 2073, 2586, 3695,
       3479, 1995,  734, 3280, 3845, 2930, 1370,  712, 3923, 3000, 3524,
       3872, 2493, 1694,  993, 3403, 2402, 1698,  222,  529, 3602, 3078,
       1609, 4031, 2111, 2336, 2932, 3775, 2673,  242, 3332, 2713, 2090,
        822, 1730,  800, 1018, 1039, 2018, 1974, 1745, 3194, 3521, 1259,
       1268, 3944, 1421, 1436, 3276, 2471, 1226,  734,  862, 1784,  650,
       2482,  362, 2734, 1525, 2375, 2966, 1857, 1961, 3615, 3509,  604,
       2567, 4065, 4070, 4082, 1148, 2631, 3312, 3123,  662, 1086,  851,
        833, 1919, 1505, 2804, 2582, 3623, 3916, 2067, 2204, 2048, 2420,
       1394, 2946, 2373, 1656, 1025, 2341, 2116, 3317, 1529,  173, 1663,
        667, 2516, 3323,  633, 1961, 3486, 2948,  820, 3001, 3801, 1831,
       2123,  994, 2232, 1319, 3412,  413, 2667,  940,  963, 2866, 2096,
       1488, 3518,  773, 2075,  560, 3254, 2219,  544,  219, 1426, 1204,
        384,  540, 1657, 1635, 3595, 2331, 3798, 1444,  898, 3684,  818,
       3806,  196, 2273, 2188, 1275, 3937,  331,  486, 1222, 3873, 2180,
       3507,  942,  832,  758, 1820, 2583,  490,  691,  629, 2499, 3885,
        771, 2472, 2868, 2471, 1486, 4087, 3031, 1957, 2346,  583,  369,
       1740, 2935, 3441, 1421, 3368, 2381,  963, 1227,  489, 1162, 2035,
       3960,  372, 1071,  938, 4020, 1635,  105,   91, 3938, 2604, 2188,
        870,  857, 2186, 2357, 3319,  583, 1416,  422, 3534, 3247, 2589,
        771, 2411, 3170, 3927,  991, 2480,   16, 1811,  870, 2333,  179,
       2689, 1279, 2793,  815, 3961,  483, 1497, 2615, 3153, 2645, 1701,
        902, 1944,  577, 1308,  470,  429, 3621,  857,  731, 2427, 3034,
       3131, 3289, 2794, 3815, 3210, 1318, 3406, 1108,  110, 2399, 1362,
       1117, 1588, 3327, 2474, 2261, 3223, 3829, 1383, 2088, 3192,  534,
       3771, 2609, 1809, 3611, 3245, 2315, 2973, 1853, 2354, 2150,  140,
        518,  637, 3087, 2575,  356, 1371,  399, 1619, 3648, 1800, 1450,
       2312, 1954,   25, 2878,  445, 3464, 4086, 2972, 3503, 3295,  906,
       3361,  576, 1028, 1977,  403, 3346, 1829,  149, 1024,  759, 2205,
       3379, 2155, 2346, 1141, 1106, 2815, 2950,  838, 1820, 3504, 2187,
       2285,  878, 3797, 3147, 1230,   71, 2900, 2396, 1644, 2113, 2688,
       1862, 2321, 1424,  577,  739,  570, 2510, 2105,  525, 1026, 3426,
       3714, 1505,  969,  627, 3367, 1044, 3980, 1658, 2457, 2914, 3332,
       3030,  876,  294, 1300, 1632, 1124,  470, 2069, 1557, 3721, 3085,
       1442,   47, 3145,  192, 1742, 2843,   22, 3538, 3159, 3898, 1975,
       2946,  907, 2552, 3664, 1539, 2650,  304, 2382, 3829,  179, 3675,
       1876, 2263, 1424, 3506, 3914, 1160, 3946, 4059, 2294, 1703, 1997,
        143,  948, 1536, 3681, 1435,  140, 2498, 1032, 2523,  181, 3801,
       3200, 1777, 1677, 2782, 3450, 3691, 3937,   38, 2963, 1222, 2023,
       2554, 3591, 1303, 3022, 3502,  928, 2053, 2609, 2485, 1263,  871,
       2801,  565, 1088, 1236,  840, 1325, 2209, 1443, 1489,  417,  852,
       1936, 1814, 1864, 1777, 3084, 1706, 3869, 2632, 1810, 1418, 2781,
       2643, 1414, 3855, 2336,  202, 3368, 3042, 1809, 3614, 3518, 2656,
       2842, 1219, 2088,  882, 1928, 2721, 2066, 1101,  436, 2504,  392,
       1019, 3013, 2437,  440,  504, 3537, 1357,  857, 2636, 3102,   53,
       2328,  143, 3121, 2369, 1680, 1510, 3105, 1154, 1348, 3632, 1325,
       2525,  328, 3273, 1862, 2539, 2495, 2017, 2986, 4078, 3321, 2358,
        288,  358, 1668, 1963, 2700, 3706,  540,  777,  683,  640, 2115,
       3526, 3825,  927, 1653, 2230,  539,  811, 3875, 2244, 1001, 2408,
       4049,  418,   56, 1032, 1026, 3342,  176, 2363,  385, 1200, 1788,
        261, 2054,  106, 3091, 1948, 1091, 2906,  445, 3748, 1780,  751,
       3029, 3326, 3349, 1445, 1360,  553, 2333, 2062, 1137, 1820,  286,
       3233,  299, 1573, 1297, 2818, 3533, 3661, 1005, 1656,  851,  908,
       1364,  197, 1417, 2748, 3123, 2296,  164, 1365,   13, 3477, 1692,
       1975, 3130, 2428, 2044, 2161, 4036, 1140,  823, 1020,   14, 2543,
       1205,  539, 1197, 3269, 1632, 2327,  974,  278, 2676, 2305, 2823,
        258,  267,  494, 3420, 1060,  471,  666, 1178, 1724, 2537, 2655,
       3202, 3760,  771,  846,   96, 1528,   21, 3579,   55, 3946, 2885,
       1628, 2674, 3880, 3370,  113, 1131, 3606,  687, 2016, 3471, 1711,
        356, 2779, 1766, 3484, 2432, 1187,  512,  944, 2062, 1205, 1948,
       2097, 2201, 3403, 3316, 3491, 1251, 3581, 3126, 2209,   35, 1447,
        634, 2577, 3223, 3461, 2236, 2967, 2385, 2095,  526, 2551, 1387,
        695,    3,  878,  789, 1016, 1146, 2651,   12, 2476,  119, 1683,
       4051, 3393, 3277, 2324, 1674, 3193, 3398, 1013, 2162, 2489, 3138,
       2851,  617, 1357, 2960, 2651, 2331, 1372,  738,  756, 3638, 3326,
       1833, 2884, 4014,  386,  666, 3898,  166, 2122, 3407,  390, 1800,
       3170, 2652, 1885, 2094, 1022, 3205,  921, 3763, 1009, 1794, 2002,
       2249, 2139, 3251, 3314, 1461, 3770, 2756,  761, 1228, 2621, 2499,
        526, 3479, 2465, 3844, 1938, 2627, 2741,  489,  397,  160, 2664,
       1280, 2258, 1994, 3199, 1467,   85,  731, 3336, 4085, 3643,  319,
       1215, 4096, 3075, 1183, 1690, 3435, 2432, 2221, 4086,  790, 3269,
       3331, 2203,  400,   74, 2495, 3297,  922,  828, 1878, 2745, 3627,
       1060, 2579,  360, 3376, 3118, 2375, 2954, 1520, 3043, 3663, 1099,
       1307,  868, 2732, 3888, 1026, 1558, 2655, 2436, 3877, 2107, 1802,
        537, 3686, 1714, 2561, 2099, 3011, 2930, 1582, 2135,  358,  717,
       2631, 2720, 3180, 2626, 1752,  607, 1759, 2228, 2923, 1858, 1362,
       2815, 2796, 3960, 3613, 3759,  149, 2608,  295, 1667,  802, 2719,
       3083, 1421, 3637, 3121, 2501, 2397, 1777, 3878,  477, 3424, 4046,
       3495,  714, 3487,  362,  137, 2588, 1830, 2052, 3346, 1149, 3099,
        540, 2326, 3929,  647, 1309, 1436, 1057, 3397,  563, 2652, 2786,
       3138,  800, 2095, 1036, 3011, 1620,   85, 2699, 3561, 3169, 3857,
       1917, 3096, 2089, 1778, 3648, 1077, 1487, 3823, 3638, 2483, 3823,
       1562, 1804, 2132,  240, 2397,  521,  729, 1538, 2052,  515, 1921,
        833, 3313, 1925,  935, 1321,  301, 2273,  125, 1607, 4038, 3275,
        662, 1925, 1844, 1072,    1,   47, 3727, 3820, 1666,  402, 2865,
       3927,  218,  224, 2119, 2548,  557,  628,  616,  488, 2500, 2890,
        896, 3489, 3507, 3067, 3192, 1051, 1828, 1704, 2833,  988, 3453,
       3073, 1277, 3482, 2859, 3669, 3557, 1902,  200, 1558, 1084, 3306,
        612, 1586,  423,  700, 2644, 1705, 1882,  294, 2408, 1988,  240,
       1465, 2567, 2120, 2567,  776, 2412, 1865, 2889, 4055, 3236, 1188,
       2112,  256, 3887,  162, 2299, 2202, 1640, 2293, 3318, 2425, 1748,
       1348, 1658, 3203, 3190, 1147,  936, 1781, 1137, 3469, 2195, 3679,
       3280, 1416,  469, 3891,  635, 4051, 1060, 1027, 3129, 2575, 4007,
       3020,    3,  197, 1382,  410, 1098, 3834, 2895, 3505, 2250, 2111,
       3254, 1250,  910, 1134, 2390, 3291, 2111, 2446, 1023, 3379,  444,
       2713, 4001, 4086, 1491, 3646, 2921,  503,  336,  431, 2763,  657,
       1448, 3175, 1892, 3939,  313, 1410, 3763, 3893,  671, 3453, 2653,
        885, 1501, 3513, 1913, 1897, 1074,  739,  373, 1540, 1760,   10,
       1385, 3142,  227, 3016, 1203, 1563, 1878,  392,  230,  113, 3611,
       1367, 2041, 3225, 1392, 3522,  969, 1674,   35, 3018, 2366, 3914,
       3430, 3556,  276,  389, 3454, 3522, 2382,  347,  757, 1674, 3294,
       1495,  649, 2304, 2575, 4032, 1815, 3225,  314,  802, 2713, 1880,
        331, 1604, 3493, 1537, 3023, 3595, 1118, 1030,  135,  415,  400,
        138,  947, 2869, 1763,  622, 3088, 2685,  584, 1496, 2171, 4040,
       1408, 3700,  420, 1330,  205, 1959,  967, 2110, 3712, 3240,  181,
       1438,  590, 4005,  560, 2733,  933, 1585,  147, 1862,   84, 3403,
       3664,  203, 3385, 2664, 1640, 2807,  642, 1628, 3250, 1813, 1439,
       2990, 1602,  754, 1445, 2940, 2847,  332, 2598, 3035, 3661,  161,
        148,  881, 3202, 2814,  388,  853,  611, 2394,  150, 3627, 1515,
        677,  905, 2195, 1541, 3886, 3087, 1869, 2356, 1508, 3236, 3243,
       1859,  846,  483,   43,  228, 1374,  229, 3571,  726,  640, 1618,
       3664, 4013, 2483, 1074, 2624,  759, 2125, 3443, 3042, 3947,  997,
        626, 1503, 2731, 2130,  583,  622, 2440, 1195, 2093, 1054, 2661,
       1675, 2069,  925, 2686, 3716,  311, 3343, 3969, 3429, 2090, 2208,
       3305, 3179, 1091, 3535,  898,  246, 1293, 4030, 3101, 3006, 2708,
        425, 2655, 3060, 2844, 3989, 2760, 3372,  815, 3137, 3035, 1951,
        804, 3199,  551, 1215,  733, 2332, 2097, 1137, 2574,  115, 3091,
       2643, 3590, 1837, 3795, 3119, 3210, 2306, 1899, 2998,  325, 3811,
        713, 1818,  578, 2531, 1843,  138, 3651, 1743, 3503,  658, 3048,
        675, 2744,  321,  916, 3171, 2948, 2295, 1316, 4010, 1492, 1210,
       2124,  275, 3311, 2489,  581, 3323, 1907,  473, 4059,  900, 3233,
        482, 1139,  748,  677, 3764,  633, 3419, 3595, 1186,  286,  349,
       2781, 1409, 3066,   26, 1973, 2154, 4059, 3939, 2619, 2294, 3050,
       2624,  153, 3812, 3205, 2929, 1364, 2868,  509, 1821, 2249, 1418,
       3096, 2846, 2813, 4034,  385, 2050, 1299,  977, 3657, 1391,  236,
        676, 1953, 3097, 1384, 2814,  400, 2195, 3250, 3897, 2350, 2332,
       3429,  439, 3417,  458, 3707, 3244, 3541, 1108, 3665, 3284, 3163,
       1457, 1463, 4053, 2478, 1451, 2209,  189, 3592, 2526, 3245,  638,
       3842, 3053,  534, 1761, 2029, 3766, 1356, 1859, 3538, 1755, 3708,
        267, 1785,  276, 1384, 2799, 1329, 3923,  590, 1066,   17, 2914,
       1492, 2244,  756, 3159,  535,  238,  394, 2398, 1608, 1938, 1072,
        935, 2808, 3887,   22, 3486, 3830, 3859,  548, 2126, 1379,  507,
       3097, 3370, 1826, 1924, 2485, 3129, 3669,  182,  558, 2999,  892,
        111, 2876, 3900, 1197, 3263,  210, 3112, 2985,  357, 1955, 3071,
        997, 2028,  173, 1321, 1395, 1108, 1966, 1223,  576,  104, 2583,
       2584, 3744, 2500, 1446, 3271, 1137,   76, 1822, 1756,  741, 3461,
       2294, 2662, 2280, 2066, 1069,  918,  929, 2124, 1095, 4086, 1721,
        969, 1038, 1783, 1237, 3483, 3737, 1588, 2971,  710, 4033,  313,
       3452, 3028, 2664, 2491, 3782,  577, 3747, 1896, 1532, 1076, 3800,
       1138, 1657, 1244, 3868, 1125, 2944, 1345, 3403, 1338, 3071, 1440,
       2324, 2987, 1581, 3659, 2224,  531, 1616, 1423, 1498, 3131,  596,
       4055, 1629,  262, 1992,  977, 2575, 1447, 1425, 1715, 2392, 1086,
       3317, 1843,  266, 3140, 3674, 1526,  422, 2350, 3292,  412, 1002,
       4002, 1333, 2601, 1224, 3946,  665, 3391, 1864, 1940,  484, 2097,
       4073, 2295, 2080, 3265, 2081, 1312, 2313, 2731, 3944, 3211,  684,
       2701, 2608, 2198,  100, 3984, 1583, 1464, 3791, 3740, 1853, 3600,
       3790, 1477,  177, 3543, 3960, 1065, 2868, 3806, 3136, 2749, 3052,
       3934, 2663,  875, 1465, 2018, 2896, 3257, 2545, 2563, 1245, 1040,
        687, 1559, 2735,  871, 1064,  117, 2376, 2365,   47, 2163, 1871,
       2067, 2001, 3121, 2951, 1501, 3247, 1774, 2216, 3899, 2695, 2354,
       4002, 1955,  917, 1753,  925, 3428, 3227, 3815,  207, 2476,  607,
        884, 4075, 1220,  769, 3849,  670, 3323, 1003, 4016, 2155,  269,
       1929, 2610, 2541, 1509,  859,  715, 1715, 2208, 1076,  298, 3964,
        839,  795, 2321, 1987, 2078, 2469, 2162, 1974, 3285, 1474,   11,
        927, 2521, 1800, 3715, 3824, 4047, 1265, 2338, 2537, 2651,  808,
       1885, 2200, 3760, 1676,  439, 1114,  509, 3086, 1680, 3981, 1438,
       2337, 2247, 2441, 3945, 3713,  204,  217,  579, 2783, 3642, 4063,
        535, 3549,  199, 1884, 2673, 1522, 3981, 1836, 1499, 3119, 2735,
        761, 2019, 3745,  794, 2938, 1773, 3589, 3656,   70,  791, 2448,
       3836, 4038, 2922, 4020, 2031, 4045, 1552, 4052,  786,  920,  422,
       3692, 1245, 2789, 2712, 2958,  577,  170, 1336, 3450, 1920, 1834,
       3088, 3832,  394,  996, 2616, 1010, 1554, 1398,   31,  277, 1414,
       2751,  674, 3825, 3686, 2505, 2797,  896, 2642, 3893,  187,  707,
        278, 2038, 4080, 1468,  391, 3102,  226, 3877,  915, 2731, 1449,
        178, 3622,  947, 3507, 1533, 1557, 1672,  762, 3638, 2836, 2516,
       1277, 2791, 3392, 1149, 1063, 2589, 3407, 4005, 1863,  377, 3549,
       3491, 1943,  696,   20, 3283, 2197, 2105, 1524, 1723, 1927, 1103,
       1040,    3, 4083,  289, 3934,  866, 2017, 1971, 2405, 1127, 3970,
       2994, 2077, 2649,  665, 2793, 1549, 2710, 3397, 3482, 2981, 1548,
       3307, 1798, 1601, 2619, 3318, 3236, 2760, 3516,  204,  991, 1154,
       3399, 3810, 2376, 2228,  571, 1515, 1038, 2797, 1364, 1592,  104,
       2569,  892, 2157, 2028, 3484,  120, 1428, 2492, 3537, 1288,  722,
       3318, 2008, 2449, 2697, 3854,  611, 2074,   56, 3489, 1792, 3226,
       3172, 2676, 1879, 2917, 3172, 3919,  479,  866,    1, 1978, 3506,
         52, 2623,   50, 3056, 1082, 2201, 2056, 1975, 3636, 2457, 3798,
       3000,  429, 3730, 3751, 1627, 4085, 2979, 2327,  504, 1588, 1589,
        242, 4043, 3528,  159,  119, 3905, 1553, 3244,  145, 3617,  970,
       3906, 2638, 3524,  162,  778, 1219, 2020, 2351, 4090, 1492, 3279,
       1002, 1118, 1872, 2319, 3916,  728, 3409,  591,  348, 1954, 1950,
        477, 2322, 2664, 4072, 1144,  838, 1377, 2134,  636,  771,  490,
       3393, 2339, 1684, 2788, 1488, 2902, 2379, 1965,  567, 2896,  973,
        723, 2283,  214, 2951,  913, 1759, 3703, 1615, 2059,  333, 1962,
         76, 3227, 2874, 4019, 2374, 1044, 3981, 1817, 2096, 3926, 3009,
       1434, 2926, 2503, 2776, 2431,  171, 3567,  747, 2846, 1436, 3496,
        342, 2955, 3165, 2903, 2140, 3192, 1053, 3919, 1661, 1992,  354,
       1752, 3620,  144, 3589, 3877, 4079, 1819, 1152, 3048, 1032,  631,
       1024, 1336, 1911, 1397, 2288, 1509, 3724,  766,  122, 3061, 1582,
       1938, 2780, 2041,  600, 3040, 1354, 3208, 3410, 3185, 1941, 1196,
       2071, 1128, 2473,  843,  778,  998, 1177, 1290,  974,  135, 3071,
       3593, 1300, 3802, 2296, 2982, 3412, 2834,  516, 1999, 1387,  215,
       3499, 2239,  171, 1948, 2879,  215,  459, 1153, 3293, 2435, 3188,
       1207, 3028, 3188,  405, 3665, 2319, 1732, 1104, 2329, 3493,  258,
       1549, 2939, 2079, 3662, 1592, 2789, 2631, 3133, 3825, 2024, 2582,
        700, 1571,  377, 2624, 1098, 3470, 1222, 3071, 1367, 1540, 3942,
       1326, 1676,  281,  326, 1300, 3316, 2684, 2262, 1110, 3486, 1207,
       3392, 2430, 1055, 2945,  516,  914,  920,  873, 3484, 3481, 3571,
        918, 1386, 2926, 3842,  292, 1684, 1109, 3622,  429, 1101, 2568,
       2603,  164, 1926, 3536,   71, 3443, 3956,  790, 2717, 3416, 3637,
       2396, 1288, 1276,  281, 2416,  489,  933, 3875,  626, 1661,   83,
       3270,  960, 3030, 3358, 3645, 1185,  363, 1642,   98, 1492,  499,
       3147, 2056, 3029, 3782,  583, 3759, 2572,  847, 1502, 2615, 3174,
         47, 3064, 1281, 1276, 2295, 1271, 1257, 1053, 2370,  347, 3759,
       2663,  623, 2579, 1548, 1916, 4012,  681,  138, 1541, 1697, 3313,
       2043,  687,  451, 2716, 3440, 3018, 3519, 3263, 2170, 3380, 2465,
        634, 1145,  375, 1483, 3368,  702, 2185, 2067, 2556,  507,  855,
       3927,  817,  982, 2110, 3081, 2538, 1225, 2493, 3859, 1465, 1982,
       2319, 1985, 3126, 3668, 1307, 3126, 2681,  243,  380,   49, 1843,
       3548, 3687, 3460, 1913, 3214, 1255, 3186, 3101, 3935, 2177,  802,
        337, 3792,  135, 1964, 2956, 3075, 2045, 3631, 1301, 1018, 1147,
        615,  647,  536, 1011, 1765, 3656, 2833, 1536, 1206, 2259, 2396,
       4010, 3517,  482, 1741, 1477, 1582, 3022, 1927, 2975, 2715, 1557,
       2127, 1256, 1271,  807, 2779,  143,  341, 1013,  639, 2179, 3086,
       3356, 3129, 3034, 1147, 2685, 3488, 1171, 2131,  115,  352,  979,
       3455,  914,  312,  327, 2800, 3602, 3730, 2502, 3062, 3914,    4,
       2375,   89, 2978, 2460, 1489, 1405, 1051, 1590, 2758, 3166,  675,
       1018, 3490, 1050, 2361,  184,  885, 2094,  485, 1006, 3956, 3738,
       1773, 2200, 2354,   37,  255,  570, 1702, 2466, 2447, 2952, 1418,
       2718, 3346, 2243, 1264,  838, 2827, 1496, 2062,  867, 2275, 1284,
       2583, 3940, 1146, 3346, 4056,    3,   20, 2287, 3118, 3887, 3895,
       3420, 1599, 1102, 1495, 2010, 3560, 3602,   23, 2270, 1646, 3086,
       2747, 2357,  179, 2463,  828, 2470, 2191, 1489,  552, 3859,   42,
       2435, 3003, 3531,  117, 1264, 3732, 3700, 1060, 3475, 3403, 1219,
       2903,   42, 1032, 3263, 2289, 3369, 3620, 1326, 3910, 1119, 2512,
       1582, 2900,   89,  393,  638, 1531,  679, 3267, 2452,  207, 2865,
       3511,  708, 2492, 3340, 3200, 2388, 4004, 2565, 3372,  563,  343,
       2555, 2382,  215, 1233, 2448, 2855, 2333, 2599, 1960,  759, 1471,
       1816, 2834, 1022, 3171, 2366, 1301, 1653, 2880, 1229,  178, 1571,
       2832, 1657, 4046, 2262, 1495,  602, 1864,  775, 2848, 3464, 2004,
       1841, 1492, 1785, 3207, 3170,  453, 3970, 2071, 2193, 2758, 3904,
       2978,  724,  586, 1812, 2085, 1453, 2502,  257, 1074, 3127, 2990,
       4003, 3105, 2614, 3590, 1591, 1522, 1002,  504,   68,  650, 1355,
       3541,  501,  153,   96, 4051,   79, 4029,   46, 1941, 2192, 2179,
        979, 3999, 1819, 2213, 1024,  998, 1934,  104,  134, 3633, 1943,
       1652, 2941, 1755, 1652,  622, 1974, 2337,  993, 3151, 3445, 2458,
       2701, 1808,  313, 1582, 2162, 1047, 2511, 2414, 4036, 2372, 2565,
       3605, 3227,  843, 3966, 2845, 3227, 2365, 2692, 2016, 2154, 3445,
       1962, 1588,  752, 3903,  987, 3438, 2591, 2025, 2288, 1107,  422,
       4069, 2423,  708, 3018,  251, 4068, 2914, 1167, 1044, 2686,  905,
       3664, 1688, 1340, 2775, 1020,  827, 2284, 2252, 1541,  253, 3620,
       3205, 1730,  887, 3464, 3715, 3570,  992, 2621, 2120,  106,  448,
       2922, 1331, 3034, 1857, 1705,  372, 3807, 1044,   52, 2401,  666,
       3090, 1441,  537, 3682, 3803, 1366,  860, 1580, 3513, 3774, 2498,
        769, 2248, 1845, 3717, 3549, 4094, 2743, 1886, 1070, 1804, 3117,
        306, 3768, 3024,  249, 1858, 1397,  784, 1447, 2118, 3778, 3906,
       1182,  435, 3615, 1472, 1936, 2006, 2048, 1476, 2000,  579, 3929,
       1986, 3048,   43, 1450, 2958, 2058, 2524,  969, 1490,  920, 3493,
       2537,  596, 3541, 2955,  435, 2271, 4045, 2159, 2048, 1276,  169,
       2578, 2664, 2120, 1038, 2066, 2380,  483, 3566, 3467, 1376,  241,
        892, 2864, 3884, 3647, 3696, 1728,  322, 2074, 3730, 2145, 2737,
        549, 2543, 3697, 2523, 3302, 3859, 3958, 2767, 3168,  522,  699,
       3238,  147, 3369, 3124, 3961, 1125,  608, 3099, 1002, 3088, 2248,
       3148, 1225, 2657, 2630, 2477, 1371, 3469, 3728,  126, 1697, 4074,
       1667,  873,   32, 1741, 2455, 2411, 1468, 2985, 3933, 3502, 2967,
       3667, 1320, 1332,  537, 2852, 1631, 2657, 3277, 1893, 3133, 2546,
       1325, 1799,  516,  133, 2233,  381, 1998, 1778, 2456, 1628, 3052,
       1842, 3691,  846, 2387, 2371, 1022,  258,  646, 2936, 1084, 2333,
        330, 2912, 2619, 4080,  871, 2342,  929,  404, 3882,  806,  129,
        796, 1202, 1489, 2854, 2595, 3901, 3435, 2576,  735, 1367, 1579,
       3323, 1360, 3965, 1022, 4027, 1426, 3767, 2285,  750, 4072, 3378,
       2614, 2899, 1784, 3021,    4, 3883, 1232, 4078, 3929, 3857, 2955,
       3395, 3608,  676, 2197,  391, 4059,  532, 2856, 2558,  637,  438,
        126, 3303,  721, 1022, 3453, 2932, 2267, 2290, 3431,  674,  435,
       1084,   50, 3052,  790, 2403,  681, 2099, 3901, 2923, 2629, 2525,
        966, 3640,  772,  777, 1878, 3368, 2837, 2849, 1931, 1709,  816,
       2086, 2835,   81, 3755, 1255, 4000, 2080, 2167,  461, 2821,  889,
       2962, 1642, 1333,  527, 2789, 2459, 3049, 1652,  104, 3093,  994,
       1149, 3221, 4079, 2268, 3344,  368, 3019, 1154, 3174, 2345, 1015,
       1156, 1336, 2035, 3501,  664,  791, 3359, 3521,  829, 2103, 3209,
       3486, 3961, 2678, 3597, 3078, 1101, 4086, 1808, 2602, 3045, 1166,
       1563, 2615,  521, 3236,  870, 3969,  884,   59,  650, 1191, 3026,
       1589,  263,  887, 2733, 1328, 3274, 3322, 1374, 1060, 2030, 2669,
       2712, 3354,   94, 2533, 3208, 1370, 2969, 3331, 1084,  520,   44,
       1574, 2643, 1431, 2897, 3671, 2234, 2895, 1127, 1186,  884, 2765,
       2655, 2466,  687, 1593, 2763,  670, 2252, 1246, 3226, 3803,  760,
       1082, 1198,  441, 3516, 1190, 1819, 2090, 2883, 4052, 2866, 1982,
       3016, 4080, 2901, 2333, 1203,  346,  181,  781,   26, 3856, 3771,
       1749, 3018, 3018, 1634, 3340, 3969,   67,  765,  682, 1823, 3743,
       1705,  283, 3695, 3971, 1472, 3058, 3444, 1823, 3143, 3277, 2328,
       3611, 3529, 3516, 2435, 1099, 1646, 3339, 3259,  482, 2240, 1444,
        844, 2818, 3727,   71, 2357,  979, 1725,  656, 2132,  253, 3533,
       1984, 2852, 1373, 2238,   97, 1481, 1050,  451, 4075, 2965, 3102,
         71, 2839, 1784, 3944, 3954, 2156, 1841, 3021,   52,  647, 3285,
        360, 2269, 1789, 2151, 1789, 3032, 1084,  496, 4066, 3088, 1064,
       1225, 1172, 2789, 1599, 2163,   23, 3668, 1146, 3188, 1920, 3311,
       3441, 3353, 2775, 1762, 1432, 2918, 3718, 1554, 3528, 2393, 1163,
       1439, 1031, 1789, 3488, 4033, 2527, 3403, 3011,   33, 1579,  830,
       3880, 2650, 1414, 4008, 2753, 3307, 3001, 1997, 2409, 3521, 3921,
        932, 2297,   84, 3424, 2419, 3780, 1749, 1056, 1748, 1151,  870,
       1050, 2119, 1367, 2325, 3477,  445, 3009, 1160, 2755,  628,  186,
        310, 1172, 1951, 2378, 1075, 1978, 1961,  975, 4028,  819, 2482,
       3424, 2848, 2647, 3289,  567, 3501,  965, 2669,  480, 2224, 1892,
        338, 2383, 3332,  598, 3115,  181,  588, 2423, 2085, 2543, 3132,
       2241,  867, 4050, 3296, 1249, 1288, 1037, 4045, 1702,  932, 1470,
       1797,  108, 3655,  661, 1001, 1152, 2488, 2326,  301, 3368, 3052,
       2239, 2771, 2850, 1877,  393, 4021, 2938, 1670,   92,  826,  362,
       3261, 1829, 2456, 3023, 2198, 1066, 3470, 3581, 3578, 1057,  556,
       1835,  418, 2624, 1177, 3707, 2279, 1023, 2845, 3392, 2581, 1488,
       1079, 2142, 2742, 4070, 1956, 3329, 3594,  723,  228, 1615, 2480,
       2997,  994, 3377, 2259, 3666,  590, 3852, 1537, 1472,  467, 4044,
        724, 2547, 1619, 3551, 2431, 3413, 2576, 2207, 2752, 1314, 2049,
       3475, 3754, 3582, 3327, 3358,  119, 3819, 4085,   46,  395,  844,
       3459,  329, 2057,  638, 2096, 1875, 2699,  620, 1746, 1144,  200,
       1817, 4053, 1944, 2932,  160, 2377,  846, 3242,  220, 1031, 3137,
       1748,   28, 2261,  260, 2661, 3897, 3679, 2260, 3794, 1864,  140,
        842, 3859, 2497,  716, 1596, 4073, 1717, 2898, 1679, 3862,  601,
        857,  218, 3462, 2309, 3710, 3063, 3830, 3408, 2006,  707,  464,
       3717, 2414,  299, 2937,  485,  294,  101, 4094,  221,   38, 2613,
       1432, 2652, 1746, 1875, 2628, 1354,  711, 1030,  625, 2380, 1002,
       2609, 3558,  485, 1618, 2751,  330,  678, 3831, 2600, 1717, 2293,
       1182, 2739,  928, 1575, 2208, 2915,  995, 2933,  557, 3408, 2782,
       1871, 2241, 1447, 2085, 1399,  130, 2215, 2046,  209, 2903, 1251,
        634,   16, 3142, 3317, 4094, 1668, 3467, 3499,  279, 3245,  272,
        105, 3338, 3247, 2472, 2299, 2362, 3282, 1502, 2368,  596, 1100,
        705,  195,  420,  412, 3362, 2806, 1456,  788, 3402, 1820, 4096,
        803,  428, 3858,    0, 2489, 3321, 1495,  867, 1918,  916, 2749,
       3712, 1823, 1481, 3088, 2982, 1808, 3044, 2704, 3601,  788, 1678,
         93,  540, 1062,  186, 1854,  443,   60, 1996, 2049,  414, 1822,
       2869, 2756, 3637, 2455,  825,  831,  913, 3112, 1904, 2039, 3056,
       1254, 2771, 1955, 2913, 2399,  533, 2459, 3176, 3681, 4060, 1903,
       1887, 1665, 3992, 3089, 2101,  424, 2245, 1069, 3010, 3087, 3641,
       1591, 1443, 1372, 2645, 1376, 2443, 2463, 1261, 3577,  105, 2507,
        692, 1899, 4021, 2196, 3474,  906,  970, 2166, 1913, 1683, 2335,
       2849, 1624,   47, 1284,  787, 3819, 3476, 3940, 3460, 1748, 1617,
       1190,  519, 2695, 1948, 3949,  147, 1606, 3421, 2775, 3905,  783,
        531, 1059, 2915,   52, 2912, 3281, 2156, 3038, 1844, 2367, 2144,
       3457,  123,  607, 2069,  223, 1928, 2001,   99,  332, 2183, 1500,
       2317, 1572, 1755, 2615, 1920, 1191,  462,  350, 2267, 1512, 2393,
        453, 2835, 1236,  533, 4022, 2539, 3642, 3548,   84, 1167, 1157,
       1600, 1179, 2316, 4076, 2835, 3975, 2740, 3611, 1993,  864, 3887,
       2747,  258,  842, 1906, 1573, 3742, 2026, 2488, 2805, 2359, 2223,
       3646, 2212, 3306, 4066, 2007, 1851, 1435, 2323, 1733, 1472, 3159,
       3439, 1817, 3038,  791, 2693, 1758, 1052,  706,  867,  789,  912,
       1516,  996, 1868, 3478, 3741, 3313,  844,   59, 2302, 1424, 1926,
       1856,  214, 3311, 1975, 1729,  851, 2880, 2079, 1487, 1618, 2236,
       3951, 2361, 1390, 2306, 1425, 1101,  530,  815,  543, 1568,  267,
        478, 2941, 1648, 3944, 3860, 2312, 3002, 1541, 1663, 3830, 2780,
       2842, 3982, 3098, 3943,  395,  820, 2736,  482, 1158,  629, 1649,
       4089, 1650, 1890, 2657, 1445, 3471,  604, 1613, 3591, 1410,  282,
        686, 3250, 1815, 2670, 1983, 1983,  108,  205, 1695,  953, 2011,
        351, 2567, 3810,  299, 1475, 2519, 2982, 1425, 2141, 1816,  114,
        413, 3475, 1631,  893, 3918, 3998, 2055, 1343, 3366, 2496, 3839,
       3647, 3036,  972,   64,  261, 2149, 1674, 1838, 1109, 3795,  421,
       1197, 2031, 2036, 1734, 3852, 1449, 3897, 3103, 3953, 2698, 3906,
       1244,  157, 1594, 1006,  645, 1901, 3560, 1246, 2595, 2027, 2698,
       2221, 2153, 2347, 2001, 1892,  686, 1821, 1474,  874,  228, 3751,
        410,  584, 1760, 2931, 2447, 3215, 1750,  569,  711, 1160, 3295,
       2668, 2909,  228, 1478, 3759, 3644, 3075, 1098, 1348, 1357, 3691,
       2074, 2640, 2264,  225,  525, 1434, 2951, 2965,  623, 2800, 1688,
       2105,  375, 2051,  432, 2498,  421, 2437, 3512, 3229,  148,  317,
       2306, 2755, 4022, 3541, 1485, 1378, 3318, 3190, 2284, 3062, 1343,
        731, 2469, 1144,   98, 3417, 2307,  516,  756, 2236, 1396, 3042,
       3552,  804, 1867, 1395, 3397, 3507, 4082, 2651,  714,  743, 2980,
       3369, 3991, 1294,  200, 2322, 3805,  647,  930, 1371, 3985, 3154,
       2667, 1398, 1394, 3442, 2585,  132, 3615,  230,  317, 2622, 3874,
        479,  139,  811,  659, 3966, 4072, 1707, 1487, 1309,  925, 1007,
       2282, 1827, 2474, 3643,  521, 3588, 2087, 2473,  608,  242, 2433,
       3566,  759, 2939, 2875,  455, 1957, 2998, 2136, 2108, 3051, 3820,
       1771, 3982, 3960,  101,   74,  412,  134, 3632,  633, 2709, 1889,
       2113, 2043, 3365, 2219, 3978,   65, 3432, 2987, 2744, 2655, 3405,
       1939,  925, 2557,  176, 3900, 2542, 1400, 2216, 1122, 3043, 2956,
         47, 1842, 2377, 3616, 3690, 2039,  837, 2867,  956, 3215, 2463,
        948, 2042, 1853, 1814,  241, 3070,  923, 2740, 3976, 3563, 3042,
       1536, 3846, 1796, 2522, 3576, 3251,  141, 1452, 2499, 3464, 2298,
        380,  856, 1965,  277, 2317, 3927, 3499, 2874, 2198, 2342, 2634,
        428, 3355, 2137,  123, 2127,  139, 2939,  336, 1977, 2225, 3819,
        107, 3593, 1670, 2510,  510, 1273,  926, 1587, 1345, 3343,  382,
       3254, 1766, 4017, 1720,   58, 3695,  282, 2599, 3911,  961, 2385,
        230, 3064, 3830, 3825, 1197, 2582, 2363, 2453,  409, 2783, 2798,
       1770, 3786, 3662, 3484, 3418,  876, 1174, 3078, 3508, 1821, 3898,
       2711, 3113,  472, 3842, 3025, 3559, 3451, 1353,  162,  612, 2930,
       1691, 1471, 1882, 1305, 1935, 3366, 1384, 1824,  137, 2272, 1646,
       3114,  263, 2473, 3714, 4012, 1416, 2855, 3973,   37, 3792,  299,
       1946, 3779, 2251, 2801, 2794, 1242, 1580,  960, 4084, 3532, 2162,
        705, 2998, 2488, 1929,  433, 2107, 2739, 2717,  609, 1615, 2547,
        334,  937, 3052, 2001, 1619,  227,  875,  829, 1727, 1372,  891,
        176, 3019, 3693,  560,   52, 3358, 2775, 1254, 3908, 3267, 3424,
       3671, 3462, 1888,  118, 2810,  299,  379, 2217, 1966, 2960, 2104,
        790, 3492, 3194, 3023, 3789, 2777, 3704, 2707,  414, 2238, 3622,
       2743, 2064, 1121, 2258, 2851, 1545, 1203, 4026, 1928, 1727, 2305,
       3938, 2520, 1793,  387,  943,  278, 3522, 3311, 3111, 2619, 1167,
       2271, 2052,  598, 3327, 2652, 4016, 3540, 1122, 3736, 1705, 2449,
        572, 1537, 3399, 1818, 3178, 2494, 3261, 3807, 2661, 1983, 1444,
        984, 1918,  763, 2206,  645, 3651, 3113, 1847, 1333, 2039,  575,
       1787, 2174, 1281,  692, 1415, 3156,  151, 3494, 1567, 1213, 3722,
       2797, 2064, 3470, 1090, 2555, 2109, 3567,  933,  270, 2950, 3486,
       1723,  305, 1025, 1044,  160, 3023, 1280, 1792, 1464, 1918, 2964,
        293, 2019, 3735, 3147, 1927, 3624, 3031, 2478, 1836, 1588, 3580,
       1786, 1561, 3063, 1667, 1768,  961,  925, 2343,  267,    4, 2673,
       3658,   97, 2390, 3103, 3420, 3497, 2715, 1101, 1743, 3149, 2767,
        723, 2942, 1531,  198, 3646, 4069, 3123,  394, 3765, 3486, 3047,
       3301, 2333, 3916, 2060,  721, 1031, 3893,  882, 1896, 3003, 2644,
       1423, 2164, 3754, 1036, 2704,  273, 3219, 1929, 3927, 3467,  202,
       3133, 2633, 3180, 1944,  818,  542, 3787, 1961, 3218, 1970,  527,
       2988, 1441, 1177, 3016, 2797, 3376, 2091,  677,  295, 3079, 2119,
       3521, 2988, 1600, 2477, 2237, 2357, 2170,  636, 3653, 1823,  958,
        359, 1019, 2466, 3157, 2167, 2168, 3114, 3190, 2567, 1602,  970,
       1990, 1196, 3812, 3313,  111, 1362, 1731, 2065,  623, 2951, 3027,
       2013, 3577,  318, 2818, 4085, 3082,  449, 2139, 3879, 1361,  886,
       3421, 1628, 1454, 2466, 3724, 3167, 2482, 1927, 1555, 2749, 3350,
       1037,  416,  605, 2925, 3831, 1897, 2800, 1764, 3465, 1007,  118,
       1931,  637, 2246, 1028, 3636, 3211, 4058, 3707,  123, 3576, 2883,
       1785,  549, 2228, 2492, 3769, 4062, 3293,  791, 3169, 3067,  252,
       4011, 3730, 2591, 3724,  258,  426, 3460,  122, 1163, 3065, 3673,
       3042,  624, 1992, 2314, 3856, 2652, 2789,  346, 3139,  739, 3215,
        274, 2104, 3088, 1752, 3945,  330, 1637, 2897, 3949, 2761, 2192,
       2995, 3547, 2430, 3594, 2107, 3682,   49, 1097, 4079,  806, 2079,
        896, 1165, 1483, 1568, 3989,  636,  249, 1213, 3055, 2614, 2739,
       3518, 2351, 4090, 1408, 3870,  591, 3565, 2277, 3973, 1102,  793,
        597, 2897, 3154, 2951, 3459, 2198, 2200, 3352,  462, 3140, 3592,
       3489, 1104, 3140, 2316,  602, 3377, 3155,  762, 2313,  348,  104,
        413, 3056, 3294, 3306, 2834,  174, 3494, 1966, 3060, 3603, 2046,
       2198, 3502, 2070, 4016, 2852, 3053,  682,  264, 2228, 2646, 2531,
       3263,  114,  487, 4021, 1905, 3631, 1110, 2113, 2754, 3200, 3707,
       2020, 4021, 3351, 3684, 3160, 2200, 1323,  534, 3315, 3851, 1351,
        539,  721, 1436, 3710, 3075, 3412,  400, 1603, 3383, 3749, 1922,
       2417, 3009, 3791, 2389, 1434, 1841, 2851, 1017, 2608,  516, 3098,
       1326, 1659,   52, 3620, 2756, 2228,  617, 3736,  841, 2915, 1297,
       1621, 4090, 2138, 2896, 1659, 1257, 1132, 3361, 3458,  509, 3799,
       3080, 2380,  631, 2124, 1139,  541, 2420, 3699, 2775, 1562,  541,
       1233,  557, 4077, 1492, 1938,   94, 2930, 3727, 1720, 1507, 2300,
       3319, 1705, 4050, 1032,  473, 2913, 3708,  913,  806, 2714, 1879,
       3995, 2553,  806, 2995, 2059, 3774, 1628,  994, 2377,  136, 3160,
       1759, 2534, 1501,  337,   83, 1248,  263, 3418, 2806,  247, 1713,
       1045, 2463, 2862,  927, 4000,  382, 3733, 2853, 3108, 3012,  652,
        971, 3820, 1669,  552, 3872,  339, 2170,  434, 3491, 1292, 1310,
       3107, 1761, 4060, 2301,  780, 3996, 1202, 1767,  430, 3374,  605,
       3998, 2299, 3354, 2781, 2749,  108,  220, 3454, 3507, 2938, 1861,
       2064,   28, 3362, 2626, 3458, 2777, 3185, 3063, 1716, 1027,  424,
       1807, 1917, 4043, 2875, 3976, 4034,  478, 2542, 2098, 1269, 1696,
       3909, 3911,  912, 1383, 3994,  435,  707, 2719, 3533,  599,  698,
       4034, 2288, 1581,  898, 1767, 1258, 1290, 1208, 1507, 3913,  830,
        532, 3457,  439, 3749, 1065, 1115,  436, 2279, 2243, 3712, 1051,
        362, 3667,  169, 2028,  151, 2506, 1045, 1827, 3176, 2493, 3124,
       3231,  844, 2096, 2054, 3549, 1475, 2125, 3313,  227, 2239,  182,
       4076, 2276, 2389, 3353,  284, 2879, 4061,  135, 3450, 3335,  348,
        322, 1913, 2353, 1403, 2720, 1328, 1722, 3355, 2012,  936, 2044,
       1196, 3899,  170, 1843, 3729,   44, 2322,  629,  179, 3343, 2937,
        130, 2369, 2770,   59, 1011, 2949, 2096,  356,   33, 3444, 3529,
        633, 2458, 1874, 2907,  284, 1224, 2346, 1730, 1968, 1622, 1310,
       1907, 1865, 3210, 1443, 1203, 1818, 2950, 3757, 1325, 3808, 3506,
       3336, 2141, 2054,  741, 1004, 1065,  520, 2937, 1407,   25, 1336,
       3327, 3432,  528,  990,  512, 2808, 2113, 2765, 3957, 1603,  155,
       1875, 2646, 3264, 3085,  680, 3378, 1875, 1516, 3504, 1031,  184,
       3803,  351, 3825, 2486, 2410, 3318,  952, 1417, 3833,  770, 3532,
        544, 3762, 1646,  751, 2605,  547, 2296, 3213, 2044, 3988,  642,
       2353, 1635, 2200, 3673,  909, 3716, 1250, 1238, 1363, 1679, 3959,
       3814, 2402, 2949, 1610, 1977, 2046, 1668,  214, 3530, 1681,  366,
       3222, 3410, 1094, 3780, 1298, 3933, 2487, 1577,  849, 3869,  911,
       3602, 1435, 3172, 2818, 3472, 2405, 1453,  674,  258, 2354, 2100,
       2708, 2402, 3914, 2645, 1932, 1411, 1934, 1423,  303,  389, 2307,
       3216,  636, 2248, 1709, 2222,    2, 1581,  351, 3868, 1121, 2682,
       3739, 2202, 3259,  607, 3194, 2545,  355, 3164,  148, 3521, 3872,
        681,  310, 2793, 1541, 4071, 3276, 2015,  351,  190, 1297, 2570,
        516, 2754, 1803, 3057, 4031, 2958,  283, 1311, 3482, 2292,  749,
       1119, 3427, 1537, 3795,  186,  204, 3706, 1559, 1997, 2586,  836,
       1683, 2646,  489, 3416,   13, 2113, 3059, 1469, 2614, 2560,  290,
       2162, 1727, 3266,  121, 1811, 3342, 1242, 1045,  765, 3782, 1087,
       2975,  792, 1781, 1395, 1359, 3756, 3805, 2775, 2271, 2950, 3716,
        457, 3425,  904, 4020,  995, 2394, 3810, 1445, 1975,  410, 3256,
       1143, 1692, 3343, 2221, 1950, 3899,  672, 2128, 1345, 3502, 2429,
       3496,  500,   85, 2208, 2953,  498, 2899,   32, 2714, 1026, 3507,
       1874, 3218,  575, 3246,   14,  798,  763, 3532, 2928, 2145, 2183,
       3740, 1453,  177, 3800,  154, 2977,  790, 1060, 2981, 3092, 3927,
       1442,  611,  162, 1006, 1645, 1779, 2520,  253, 1407, 4027, 3623,
       3299, 2139, 2265, 1135,  746, 3527, 1684,  471, 4089, 3590,  795,
        341,  534,  425, 1557, 3969, 3650, 3171, 2053, 1028, 3275, 2840,
         46, 3435, 3971, 2439, 1138, 1450, 2515, 1005, 1804,  881, 1864,
       2472, 2496,  125, 2010, 2628, 1223, 1029, 2025, 3344, 1366, 2253,
        544, 2618, 2354, 3061, 2211,   95, 4085, 1610, 2365, 1662, 1986,
       1863,  292, 1751, 1606, 2570, 1118, 2714, 3440, 2695, 1056, 3495,
       2195, 3394, 3269, 2801,   33, 2203, 1535, 2977,  153,  686, 3258,
       1354,   44,  439, 1539,  367, 1300, 1014, 3779, 2137,  649,  286,
       1126, 3606,  148, 2630, 1878,  392, 1156, 1959, 2573, 2408,  959,
        240, 1344, 3165, 3091, 2117, 1358, 3762, 3082, 2761,  739, 1656,
       1651, 1502, 2791,   94,  191, 3526, 1612, 3922, 2924, 1892,  487,
       2420, 1291, 1878, 1725, 2404, 2657,  355, 4014, 3650, 3956, 1217,
       2096, 2784, 3833, 1607, 2370, 2161, 1443, 3633, 1453, 2156, 1239,
        702, 2667,  126, 2328,  937, 3052, 2382,  723, 2353,  718, 4068,
       2876, 3847, 1141, 2010,  342, 3363,  455, 2119, 3299, 1596, 3548,
        181, 1204, 3046, 3628, 1156,  574,  732, 1441,  504,  939, 3244,
       3059, 2426, 2324, 1338, 1131, 2856,  975,  755, 2244,  463, 2454,
        768, 1299, 4089, 3363, 2536, 3828, 3145,  407,  891, 3884, 3680,
       2878, 1094, 1625, 1851, 3254, 1134, 3966,  430,  490, 1559, 1710,
       2554, 1131, 1391, 3118, 3919, 2719, 3838, 3957, 3986, 2145, 1822,
        363, 2577, 3239, 2328, 2631, 2915, 1789, 3158,  373, 3990, 3214,
        241, 3994, 3169, 1365, 2686, 3103, 2482,  577, 2094, 3132,  403,
       2729, 1082, 1871,  498,   55, 2011, 2433, 2931, 4006, 2724, 3722,
       2764,  878, 1161, 1844,  627, 1544,  525, 1902, 3434,  472, 2553,
       1974, 1826, 2873, 2903, 1199, 2600,  741, 1318, 3155, 2264,  765,
       3002, 1535, 3810, 1760, 3044, 2304, 2368, 1696, 1091, 2035, 3544,
       1895, 2215, 4078, 2365,  994,  693, 1671, 2766, 3901, 2591, 2735,
        748,  823, 2516, 1610,  195, 1763, 1730, 1778, 2102, 2041, 1962,
       3488, 3492,  785, 1779, 2268, 1721,  637, 3746, 3691, 3696,  228,
         73, 1371, 2109, 2045,  194, 3944, 1797,  819,  934, 4024, 3047,
        932,  698, 3942, 3794, 1518,  744, 1104,  369, 1391,  552, 2788,
       3152, 3118, 3664, 2813, 1925, 3796, 2427, 3581, 2239, 3284, 1850,
        970, 3947,  197, 1761, 3962,  525, 2355, 3303, 1705, 3019,  306,
        915, 2390, 1641,  788, 1881, 3851, 1791,  853, 2101, 1070, 2417,
       1304, 3654, 2679,  218, 2699, 2404, 1584, 2417,  662,  859, 3693,
       3634, 1340, 1166, 1712,  263, 3279, 1590,  595, 1482,   98, 3292,
       3652, 4001, 1668,  596, 4058, 2165, 1806, 4056, 3083, 1197, 1196,
       3844, 2988, 1265, 2945, 2504, 2932,  483, 3704, 1555, 3958, 1546,
       4039, 3138, 3328, 2010, 3103, 2956, 2774, 2413, 1277, 3308, 1173,
       1184,  952, 3498,  262, 1414, 3654, 2546, 1986, 3649, 2143,  131,
       1656, 1325, 3997, 2057, 1558, 3590,  917, 3491, 2004, 3676, 1050,
       2926, 3679, 1192, 2846,  122, 3018, 3685, 1820, 2498, 2236, 1033,
       2378,  762, 2555, 1791,  712, 3628, 1593,  932, 3749,  553, 1671,
       1696, 2376,  181, 3494,  422,  780, 3444, 4095,  757, 3856,  579,
       3177, 2366, 3016, 2307, 2449, 1344, 3624, 3127, 3309, 2273, 3708,
       3406,  713,  605, 3678, 3313, 1582, 3202, 2096, 1148,  916, 3453,
       3477, 3951,  359, 3807,  559, 2687, 1421, 2458,  830, 2730, 1475,
       2838, 3931, 1162, 3674, 1218, 2073, 3488, 3949, 2153, 1994, 1583,
        891, 1725,  979,  818, 3263,  803, 3014, 2304, 1611, 1605,  793,
       1920, 1060, 1767,  450,  613, 4011, 1613,   37, 3125, 1149, 1355,
       3016, 1952, 3356, 3561, 3904, 1336, 2696, 2004, 2094,  468, 1971,
       2083, 1673,  741,  161,  407, 2436, 2544, 3986, 2524, 1645, 1670,
       1676, 1776,  506,   80, 3961,  338,  915,  225, 2898, 2868, 2647,
       2100, 2043, 3235, 3312, 2181, 3961, 1589, 3850, 3276, 1246, 1295,
        378, 2653,  517,  444, 3018, 1827, 2212,  269, 2002, 1332,  723,
       1565, 1536,  948, 2920, 2392,   51,  287,  778, 1465,  229, 3671,
       1607, 2276, 1583, 2187, 3178, 1056, 2570, 1931, 4034, 3313, 2615,
       2487, 4056,  260, 3893, 1898, 2660,  739, 1292,  220, 2730, 1848,
        268, 1784, 3815, 1117,  652,  196,  106, 3251, 2728, 1629, 2198,
       2805,  462, 1814, 2087, 3447, 1820, 2724, 2207, 1005, 2213,  383,
        974,  585, 3583, 2256, 2817,  422, 3560, 2305, 1370, 2569, 2587,
       3374, 4058, 3854, 2122, 3454, 1640, 2634,  882, 3090, 3203,  576,
       3166, 3025, 3741, 1231, 1583, 1519,  460, 3216, 2859,  350,  442,
        524, 3900, 2772, 4044,  469, 1701,  846, 1959, 2540, 3856, 1193,
        442, 1783,  705, 2205, 1987, 2782, 1376,   23,  829, 2061, 2627,
        139, 3480, 1510, 1873, 1446, 2458,  271,  914, 1071, 1365, 1960,
       2818, 1509, 1090, 1374, 1344, 3442,  934,  853, 1883,  103, 1947,
       3037, 1744, 3111, 4091, 1904, 1910,  407,  680, 2235, 2733, 1602,
        456, 3106, 2848,  240,  308, 1901, 3376, 3622,  263, 1746, 2573,
       1331, 2457, 1635, 1076, 3706, 3054,  305,  397, 2389, 3264,  840,
       3017, 3559, 3583, 3417, 3021, 3914, 2456,  119, 1939, 3167, 1151,
        932, 3645, 1795, 4026, 2236,  981, 3031,  377, 1354, 1168,  902,
       4036, 1824, 1868, 3763, 2672, 2928, 2478, 2562, 2101, 3644, 2360,
         78, 1915, 1357,    5, 3190, 4082, 3764, 3263, 1189, 2645, 1489,
       2220,  256, 3411, 1878, 1671,  672, 3352, 3982, 1053, 2072,    7,
        997, 3928, 3107,  988, 2380, 3159, 2611,  647, 1322,  233, 2741,
       3624, 4087, 2464,  881, 3562, 1289, 3481, 4043, 2429,  297, 1319,
        332, 3917, 1632, 3374, 1505, 2842, 2815, 1738, 2534,  334,  769,
        292,  240, 3077,  858, 2537, 3714, 3881, 3690, 2405, 1725, 1283,
       1318, 1361, 1635, 2514, 3370, 3917,  323,  731,  105, 2058, 1337,
       2063, 3570, 3003, 1649, 1622, 3186, 2259, 3123,  596, 3287, 1173,
        742,  618,  875, 2141,  199, 3433, 4069, 1270, 3048,  946,  665,
       1491, 1707, 3103,  484, 3488, 2720, 1059, 1353, 2815,  265, 3204,
       1296, 2509, 1582, 1384,  185,  346, 3428, 3735, 1405, 4067, 2499,
        897, 1573, 3048, 2344, 3778, 3952, 3442,  515, 2144, 3201, 2966,
       3432, 3885, 1708, 2173,  502, 1217, 3781,  545, 3263, 3055, 2195,
        336, 2428,   32, 3691, 2890, 2253, 2198, 3626, 2467, 1215, 3210,
       3790, 3673, 3756,  483, 3511,  265, 2265, 2793, 2008, 4070, 3504,
       3413, 1337, 1103, 1226,  490, 3565, 3341,  469, 2973, 1669, 1763,
       3686,  259,  516, 2481, 1241, 3041, 3025, 2742, 2246,  767, 2225,
       1467, 1618,  787,  744,  119, 3939, 3291, 1957,   55, 2894, 1247,
       3676, 3379, 1697, 3124, 3946, 1002,  130, 2501,  117, 3911,  519,
       1502, 3491,  879, 2792,  333,  878, 3210, 1838, 3732, 1711, 1628,
        901, 2369, 2908,  307, 1072, 3709, 1850, 1764, 2751,   82, 3272,
        881, 2775, 2332, 2410, 1486, 1500, 3871, 1385, 2130, 3421, 1781,
       3584, 2084, 3622,  446,  377, 1015,  427, 3606, 2839, 2178,  708,
       3740, 3095, 2635, 2742,  510, 3737,  120, 1102, 2326, 3917, 2777,
        679, 2449, 2237,  400, 1691, 4082, 3978, 2142, 3166, 1541, 2583,
       3934,  889, 3214, 1236, 2303, 3587, 2240,  849, 2471, 1677, 1945,
       2268, 3054, 3823, 2938, 1408, 2992,  296, 1824, 1231, 2233, 2177,
       3159, 3878, 1943, 3639, 1000,  564,  798, 3716, 1517, 2793, 3616,
        168, 2498,  786, 1133,  214, 3101, 3476, 1709, 3491, 4085, 2122,
       3385,  361,   99, 3851,  579,  741, 1577, 1155, 3708, 3441, 1635,
       3108, 1085, 1030, 3573,  429,  888, 1264, 3896, 1769, 1581,  745,
       2420, 2389,  382, 3593,  760, 3383, 2326, 1291, 1535,  262, 3315,
       1805, 3015, 1574, 2996, 1657, 2102, 1980, 3624,  591, 3288, 2531,
       2423, 2765, 3010,  873,  972, 3232, 2666, 1699, 1489,  478, 3588,
         29, 1870, 1183,  622,  781, 2664,  264, 1423,  257, 3510, 2734,
       3062, 3655, 3742, 1472, 3587, 2571, 1600,  103,  225, 1961, 3607,
       2053, 2923,  823, 2072,  964, 3887, 3776,  382,  557, 2158, 2013,
       3010, 3872,   83,  442, 2718, 1321, 2526, 2758, 4010, 2749, 3675,
       2042, 3773,  831, 3358, 3818, 3266,  956, 2489, 1656, 2649, 1831,
       3253, 1663,  408, 3056, 3662, 1596,  990, 1309, 1144, 2486, 1764,
       3827,  926, 1177, 2341, 3974, 3832, 1731, 1698,  847, 3912, 1801,
       3362,  690,  280, 3292,  392, 1520,  219,  429, 3886, 1154, 2024,
        350,  718, 2701, 1128, 1519, 2508, 3064,   25,  510, 3233,  562,
       3167,  416, 1322, 3277,  365, 3803,  859,  870, 2914, 1139, 1985,
       1763,  629, 2205,  800,  256, 3829,   98, 3263, 3797, 4037, 2114,
       2802, 3070, 2024, 1521, 2171, 2481,  119, 1937, 3525, 3683, 3717,
       4026,  864, 2670, 3884, 2757, 1475, 3503, 3110,  612,  807, 1199,
       2108, 1334,  423, 2419, 2485, 2653, 2620, 3852, 1642, 3720,   72,
       3942, 1453, 3622, 4026,  866, 1026, 1229, 3113, 3887, 3124,   22,
