graph main_graph (
  %onnx::Add_0[INT8, 5], exponents: [-8]
  %onnx::Add_1[INT8, 1], exponents: [-8]
) {
  %2 = Add[quant_type = 'S8'](%onnx::Add_0, %onnx::Add_1)
  return %2
}


initializers value:



values info:
%2[INT8, 5], exponents: [-8]
%onnx::Add_0[INT8, 5], exponents: [-8]
%onnx::Add_1[INT8, 1], exponents: [-8]


test inputs value:
%onnx::Add_0, shape: [5], exponents: [-8], 
value: array([127, 127,  46,   3,  51], dtype=int8)
%onnx::Add_1, shape: [1], exponents: [-8], 
value: array([127], dtype=int8)


test outputs value:
%2, shape: [5], exponents: [-8], 
value: array([127, 127, 127, 127, 127], dtype=int8)