graph main_graph (
  %onnx::Add_0[INT8, 2x3x4x5], exponents: [-5]
  %onnx::Add_1[INT8, 1x1x1x5], exponents: [-5]
) {
  %2 = Add[quant_type = 'S8'](%onnx::Add_0, %onnx::Add_1)
  return %2
}


initializers value:



values info:
%2[INT8, 2x3x4x5], exponents: [-5]
%onnx::Add_0[INT8, 2x3x4x5], exponents: [-5]
%onnx::Add_1[INT8, 1x1x1x5], exponents: [-5]


test inputs value:
%onnx::Add_0, shape: [2, 3, 4, 5], exponents: [-5], 
value: array([22, 16,  9,  9, 12,  8, 23, 23, 26, 25,  8,  2, 25, 30, 29, 30,  0,
        4,  7, 21, 18, 25, 29, 12, 31,  1,  6, 20, 26, 20, 14,  4,  8, 18,
       32, 10, 14, 17, 27, 12, 20,  6,  6,  6,  4, 20, 19, 25, 28, 16, 25,
       20, 26, 11, 11,  7,  2,  4, 18, 10, 17, 17,  0,  2, 24, 14, 10, 25,
        0, 31, 16,  5, 15,  2,  9, 31, 30,  5,  2, 28, 29, 21, 11, 18,  9,
       22, 13,  0, 20, 22,  3, 30, 31,  6, 15,  1,  2,  9, 16, 27, 11, 26,
       26,  3, 29,  6, 22, 24, 30, 15,  8, 30, 25,  8, 24, 24,  3, 10,  8,
       29], dtype=int8)
%onnx::Add_1, shape: [1, 1, 1, 5], exponents: [-5], 
value: array([26, 18, 28, 25,  1], dtype=int8)


test outputs value:
%2, shape: [2, 3, 4, 5], exponents: [-5], 
value: array([48, 34, 37, 34, 13, 34, 41, 51, 51, 26, 34, 20, 53, 55, 30, 56, 18,
       32, 32, 22, 44, 43, 57, 37, 32, 27, 24, 48, 51, 21, 40, 22, 36, 43,
       33, 36, 32, 45, 52, 13, 46, 24, 34, 31,  5, 46, 37, 53, 53, 17, 51,
       38, 54, 36, 12, 33, 20, 32, 43, 11, 43, 35, 28, 27, 25, 40, 28, 53,
       25, 32, 42, 23, 43, 27, 10, 57, 48, 33, 27, 29, 55, 39, 39, 43, 10,
       48, 31, 28, 45, 23, 29, 48, 59, 31, 16, 27, 20, 37, 41, 28, 37, 44,
       54, 28, 30, 32, 40, 52, 55, 16, 34, 48, 53, 33, 25, 50, 21, 38, 33,
       30], dtype=int8)