graph main_graph (
  %onnx::Add_0[INT8, 1x1x4x5], exponents: [-6]
  %onnx::Add_1[INT8, 2x3x1x1], exponents: [-6]
) {
  %2 = Add[quant_type = 'S8'](%onnx::Add_0, %onnx::Add_1)
  return %2
}


initializers value:



values info:
%2[INT8, 2x3x4x5], exponents: [-6]
%onnx::Add_0[INT8, 1x1x4x5], exponents: [-6]
%onnx::Add_1[INT8, 2x3x1x1], exponents: [-6]


test inputs value:
%onnx::Add_0, shape: [1, 1, 4, 5], exponents: [-6], 
value: array([49, 13, 28, 55, 52, 51, 29, 46, 52, 29, 15, 10, 27, 20, 28, 33,  8,
       26, 23, 22], dtype=int8)
%onnx::Add_1, shape: [2, 3, 1, 1], exponents: [-6], 
value: array([31, 57, 62, 53, 27, 42], dtype=int8)


test outputs value:
%2, shape: [2, 3, 4, 5], exponents: [-6], 
value: array([ 80,  44,  59,  86,  83,  82,  60,  77,  83,  60,  46,  41,  58,
        51,  59,  64,  39,  57,  54,  53, 106,  70,  85, 112, 109, 108,
        86, 103, 109,  86,  72,  67,  84,  77,  85,  90,  65,  83,  80,
        79, 111,  75,  90, 117, 114, 113,  91, 108, 114,  91,  77,  72,
        89,  82,  90,  95,  70,  88,  85,  84, 102,  66,  81, 108, 105,
       104,  82,  99, 105,  82,  68,  63,  80,  73,  81,  86,  61,  79,
        76,  75,  76,  40,  55,  82,  79,  78,  56,  73,  79,  56,  42,
        37,  54,  47,  55,  60,  35,  53,  50,  49,  91,  55,  70,  97,
        94,  93,  71,  88,  94,  71,  57,  52,  69,  62,  70,  75,  50,
        68,  65,  64], dtype=int8)