graph main_graph (
  %onnx::Add_0[INT8, 48], exponents: [-9]
  %onnx::Add_1[INT8, 1], exponents: [-9]
) {
  %2 = Add[quant_type = 'S8'](%onnx::Add_0, %onnx::Add_1)
  return %2
}


initializers value:



values info:
%2[INT8, 48], exponents: [-9]
%onnx::Add_0[INT8, 48], exponents: [-9]
%onnx::Add_1[INT8, 1], exponents: [-9]


test inputs value:
%onnx::Add_0, shape: [48], exponents: [-9], 
value: array([127, 115, 127,  76,  32, 127, 104,  94, 127, 127, 127, 127, 101,
        42, 106, 127,  17, 127, 127, 127, 127, 123, 127,  21, 127, 127,
       127, 127, 127, 127, 127, 127,  32, 127,  92,  84,  94, 127,  58,
       127, 127, 127, 127, 127, 127, 127, 127, 127], dtype=int8)
%onnx::Add_1, shape: [1], exponents: [-9], 
value: array([29], dtype=int8)


test outputs value:
%2, shape: [48], exponents: [-9], 
value: array([127, 127, 127, 105,  61, 127, 127, 123, 127, 127, 127, 127, 127,
        71, 127, 127,  46, 127, 127, 127, 127, 127, 127,  50, 127, 127,
       127, 127, 127, 127, 127, 127,  61, 127, 121, 113, 123, 127,  87,
       127, 127, 127, 127, 127, 127, 127, 127, 127], dtype=int8)