graph main_graph (
  %onnx::Add_0[INT16, 8x2x5], exponents: [-14]
  %onnx::Add_1[INT16, 1], exponents: [-14]
) {
  %2 = Add[quant_type = 'S16'](%onnx::Add_0, %onnx::Add_1)
  return %2
}


initializers value:



values info:
%onnx::Add_0[INT16, 8x2x5], exponents: [-14]
%onnx::Add_1[INT16, 1], exponents: [-14]
%2[INT16, 8x2x5], exponents: [-14]


test inputs value:
%onnx::Add_0, shape: [8, 2, 5], exponents: [-14], 
value: array([ 2677, 11078, 14073, 15292,  5470,  1191,  7383,  3469,  5570,
         909, 11576, 15003,  1748, 14246,  5646, 13468,  7120,  6282,
        1209, 15249, 13661,  5009,  9858, 13280, 10263,  3782,  1680,
        6159, 12676, 13814,  9369, 14727,  7437,  6980,  6068,  8783,
       13369,  3391, 10823,  6774,  7326,  9734, 10373,  7075,  1913,
       16080,  9421, 12576,  3056, 10911,  2179,  8922,  6866,  5059,
       13297,  3122,  6592,  6278, 11926, 10554, 10994,  5522,  5885,
        4642, 15568,  7521, 10714,   306,  2167, 10994,  3327,  3886,
        4975,   445,  1739,  5071,  1714, 13969,  1839, 13419],
      dtype=int16)
%onnx::Add_1, shape: [1], exponents: [-14], 
value: array([7390], dtype=int16)


test outputs value:
%2, shape: [8, 2, 5], exponents: [-14], 
value: array([10067, 18468, 21463, 22682, 12860,  8581, 14773, 10859, 12960,
        8299, 18966, 22393,  9138, 21636, 13036, 20858, 14510, 13672,
        8599, 22639, 21051, 12399, 17248, 20670, 17653, 11172,  9070,
       13549, 20066, 21204, 16759, 22117, 14827, 14370, 13458, 16173,
       20759, 10781, 18213, 14164, 14716, 17124, 17763, 14465,  9303,
       23470, 16811, 19966, 10446, 18301,  9569, 16312, 14256, 12449,
       20687, 10512, 13982, 13668, 19316, 17944, 18384, 12912, 13275,
       12032, 22958, 14911, 18104,  7696,  9557, 18384, 10717, 11276,
       12365,  7835,  9129, 12461,  9104, 21359,  9229, 20809],
      dtype=int16)