graph main_graph (
  %onnx::Add_0[INT8, 1x96x5x5], exponents: [-5]
  %onnx::Add_1[INT8, 1x96x5x5], exponents: [-5]
) {
  %2 = Add[quant_type = 'S8'](%onnx::Add_0, %onnx::Add_1)
  return %2
}


initializers value:



values info:
%2[INT8, 1x96x5x5], exponents: [-5]
%onnx::Add_0[INT8, 1x96x5x5], exponents: [-5]
%onnx::Add_1[INT8, 1x96x5x5], exponents: [-5]


test inputs value:
%onnx::Add_0, shape: [1, 96, 5, 5], exponents: [-5], 
value: array([25, 12, 26, 20, 13, 24,  6,  8, 10, 22, 15,  5, 22,  1, 24, 29,  9,
        3, 18, 22, 22, 10, 29,  3,  3, 19, 13, 19,  6, 12,  7, 22, 28, 16,
       15, 13, 15,  3, 24, 19, 10,  7,  1, 28, 19, 11, 27, 30, 24, 18, 29,
       23, 18, 19,  5,  2,  0, 31,  8, 18,  7, 18, 19, 11,  2, 18,  2, 26,
        2,  7,  5, 16,  6, 20, 17, 29, 19,  7, 29, 10, 17,  1, 27,  8, 23,
       23, 25,  2,  6,  4, 14, 30,  9, 27, 13, 23, 32, 17,  7, 23,  6, 21,
       20,  9,  9, 22, 23,  0, 22,  2, 29, 21,  9,  0,  1,  9, 12, 15,  5,
       31, 25, 21, 24, 12,  9,  3, 25, 20,  6,  9, 19,  8, 10, 27, 10,  5,
       12, 29, 20,  9, 11,  1, 19, 24,  6, 14,  6, 23, 13, 12, 15, 10, 12,
       22, 13, 17,  8, 24, 19, 20, 28, 23,  1, 13,  8, 13,  2,  5, 15, 30,
        8, 29, 23,  2, 31, 20, 20, 21, 27,  6, 16,  6,  5, 24,  8, 26, 20,
       16, 31, 27,  2, 25, 22, 29, 23, 16, 18, 21, 13,  7, 10, 13, 29, 23,
       23, 18, 30,  4, 10, 18, 21, 32,  5, 30,  9, 25,  6,  9,  7, 30, 21,
       17,  6, 11, 15, 17,  1, 27, 15, 19, 19,  3, 11, 32,  9, 10, 31, 23,
       15, 31, 14, 28,  6,  0, 11, 12, 28, 30, 19, 29,  6, 29, 32, 18,  8,
       17,  2, 26,  8, 14,  3, 15,  7, 14, 12, 13, 27,  0, 32, 29, 13, 30,
       15, 25, 11,  7, 17,  7,  8, 28,  6, 15,  1, 14, 10,  7,  8, 15,  7,
       21,  6, 23, 28, 12,  9, 29,  1, 14,  5,  0, 21,  9,  9,  7,  5, 31,
        7,  4, 15, 11, 17, 29, 14, 18, 28,  5, 13, 17,  5, 20, 31, 25, 25,
        8, 11, 16,  4, 23,  5, 29, 13, 21, 16, 22, 15, 31, 18, 30, 14,  6,
        6, 13,  4, 16, 25,  7, 20, 22, 24,  9, 15,  6,  9, 11, 19, 24, 14,
        2, 17, 22, 14, 28,  8, 13, 17,  5, 21,  9, 18, 27, 27, 29, 12, 21,
       20, 22,  8, 18,  9, 21, 27,  3, 31, 13, 20, 26, 28, 10,  1, 26, 16,
       19,  9, 14,  9, 30, 16, 10, 29, 29, 14, 28, 23, 32, 11, 15, 25,  2,
        3, 18,  0, 30, 21,  8, 27, 25, 27,  7, 20, 28, 22, 12, 29, 31,  1,
       29, 19, 20,  9, 28, 17,  4, 14, 23, 29, 29,  9,  6, 23,  4, 17, 30,
        7,  8,  6, 25, 30, 25, 31,  6,  8, 12, 13,  4,  7, 10,  3,  9,  3,
       32, 30, 23, 26, 25, 13,  7,  7,  7, 23, 32,  7, 30,  9, 17, 27,  5,
       19, 25, 15, 10, 24,  6, 29, 31, 15, 30, 13, 17, 21, 17,  5, 26,  7,
        1, 19, 26,  8, 29,  5, 17,  2, 16, 21, 15, 16, 29, 31,  5, 32, 18,
       17, 21, 19, 17, 10, 25, 20, 27,  3, 19, 22, 20, 29,  0, 19, 10,  1,
        7,  5, 21,  3,  1, 14,  7, 24, 17, 28,  8, 24, 10, 26, 16, 29,  9,
        7,  2, 23, 12, 30, 29,  2, 18, 12, 25,  0,  4, 25, 24, 10, 27, 29,
       18, 31, 11, 28,  2, 10,  2, 28,  4, 19, 32,  3, 25, 12, 25, 16, 21,
        2, 31,  5, 14, 30, 17, 22, 21, 25, 29, 31,  4, 13, 26, 30,  8,  0,
       23, 29,  6, 31,  3, 16, 13, 24, 24,  9, 13, 13, 23, 18,  5, 31, 25,
       25,  0, 14, 21,  4,  2,  3,  9, 19, 28, 24, 29, 31,  4,  5, 14, 10,
       27, 11, 22, 13, 27, 17, 13, 30, 24,  0, 15, 31, 15, 24, 30,  6, 20,
       19,  3, 13, 23, 22, 12,  4, 19,  8, 24, 16, 24, 21,  7, 14, 13, 26,
       22, 19, 17,  2, 31, 15, 29,  7, 27,  6, 30,  6, 10, 16, 27,  6,  3,
        1, 13, 24,  8, 23,  4,  0,  5,  5, 22, 13,  3,  2,  6, 26, 13, 10,
       19, 10,  8, 19,  7, 29,  8,  6, 22,  0,  0, 30, 11, 12, 16, 24, 13,
       12, 27,  1, 17, 10,  5, 29,  8, 23,  6,  5,  8, 10, 19, 13, 12, 26,
       32, 23,  2, 12, 20, 20, 22, 21, 13,  0, 14, 28,  3, 31,  0, 18, 13,
       22, 14, 22, 15,  4, 30,  3,  9,  8, 26,  9,  0, 20, 29, 16,  7,  1,
       21,  2, 17, 30, 27,  5, 11, 12, 23, 10,  5, 27,  5, 26, 23,  5, 23,
        6, 29, 11, 17,  4, 13, 26, 11, 29,  1, 23, 13,  5, 18, 17,  6,  9,
       15, 32, 23, 30, 13, 27, 16, 16, 10,  3, 10,  9, 12, 23,  5,  6, 10,
        9,  8, 25, 26, 12, 24, 18,  3,  2, 15,  7, 25, 10, 13, 11,  5, 11,
       23, 28, 19, 14,  5,  7, 27,  5, 12, 12, 18, 30, 26, 18, 11, 32, 32,
       19,  8,  6, 19, 18,  4, 31, 14, 10, 11, 26, 23, 20, 11, 32,  2, 21,
        0, 23, 19, 26, 11, 24, 13, 20,  1, 26,  4, 21, 11, 27, 12, 23, 19,
       27, 32, 18, 21,  5, 31, 27, 32, 20, 27, 20,  7, 24, 14, 27, 29, 24,
       19, 25,  3,  2, 12, 18, 22,  4, 22, 31,  5, 29, 19,  3, 29, 21,  0,
        9,  7,  4,  7, 17,  4, 30, 28, 21, 31, 15, 27, 16,  8, 21, 13,  9,
       12, 19, 13, 16, 14, 12,  5, 10, 25, 15, 12, 11,  5,  1, 24,  3,  4,
        3, 14, 25, 16, 13, 21, 15, 23,  7,  8, 17, 31, 21, 30, 19, 14, 27,
       17, 20,  3, 20,  1, 30, 29, 22,  2, 17, 31,  3,  0,  8, 15, 21, 26,
        9, 23,  2, 28, 19,  8, 12, 26, 32,  0, 13, 26, 12,  3, 17,  2, 14,
       13, 13,  0,  6, 15, 13, 32, 26, 28, 15, 28,  1,  8,  6,  9, 25, 17,
       22, 18, 13, 17,  1, 17, 17, 28, 20, 14, 16, 30, 27,  1,  7, 13,  5,
       27,  1,  7,  0, 27,  2, 31, 23, 28, 24, 11, 28, 26, 22, 21, 25,  6,
       28,  5, 32, 27,  9, 31, 27,  3,  1, 21, 23,  8, 22,  4, 29, 19, 24,
       10,  5, 30, 22,  4,  2, 29, 23, 10, 14, 15,  8, 11, 32, 14, 12, 29,
        3,  1,  3, 31, 17, 21, 29,  1,  7, 18, 21, 27, 26, 14, 29, 12, 26,
       31, 27, 27, 11, 28, 28, 10, 29,  9, 11, 22, 32,  3, 28, 19, 20, 22,
        0, 23,  4, 17,  3, 11,  7,  9, 26, 29,  7, 14, 22, 22, 28, 18, 20,
       18,  2, 16, 10, 11, 25, 17, 30, 20, 25, 28, 12,  4, 22,  6, 30,  5,
        8,  7, 18,  6, 26, 32, 32, 14,  8,  5, 14,  8, 22,  5, 21,  9, 11,
       27, 27, 22, 16,  3,  5, 25, 18, 11, 26, 24, 25, 10, 29, 23,  2,  6,
       11, 14,  2, 16, 18, 16, 13, 14, 30, 11, 11,  9,  2, 12, 31,  8, 32,
       15, 28, 29,  1, 23, 29,  5,  8, 17, 19, 11,  3, 23, 29, 29, 24, 20,
       24, 22, 19,  8, 13,  0,  1, 24, 11,  6,  6, 21, 29,  0,  4,  4, 14,
        7, 32, 10,  4, 15, 19, 27, 15, 16, 18,  8, 10, 10, 19, 18, 17,  7,
        5, 22,  5, 15, 14,  8, 29, 27, 32, 25,  1, 27,  3,  6, 10, 29, 12,
       11, 24, 16,  1, 17, 28, 21, 24, 15, 31, 20,  0,  1,  6, 26, 23,  6,
        3, 14, 16, 16, 25, 22, 27, 21, 25,  5, 28,  4, 31, 20, 13, 29, 32,
       18, 25, 24,  3, 20,  4, 21, 20, 24, 21, 12, 21,  7,  1, 11, 18, 28,
        2,  3, 12,  3, 25, 19, 16, 11,  5,  3, 18, 16,  3,  7, 14,  1, 22,
       14, 29, 20, 14,  5, 23, 16,  6,  9,  3, 19, 26,  4,  9,  4, 16, 11,
        4, 20,  7,  2, 27, 25, 10, 30, 14, 20,  0, 31, 14,  2, 10,  3, 11,
       15,  4, 10, 29, 29, 23,  9, 18, 11, 16, 23,  1, 28, 29,  6, 15,  8,
       27, 10,  2, 27, 31, 10,  5, 27, 22,  8, 22, 15,  1, 14, 12,  1,  3,
       11,  1, 24, 12,  2, 28,  8, 20,  6,  4,  0, 25, 15, 15,  4, 22, 10,
        3, 25, 32,  1, 14,  7, 15,  8, 30, 22, 22,  9, 30, 19, 30, 11, 25,
       15,  5, 18, 26, 17,  5,  8, 24,  2,  4, 29, 14,  9, 11, 25,  1, 23,
        1, 12,  8, 16, 21,  4, 16,  6, 32,  0, 28, 16, 31, 20, 25,  0, 30,
        5, 15, 20, 16, 22, 26, 23,  4, 20, 12, 29,  7, 22,  6, 19,  9,  2,
        3, 20, 24,  7, 16, 17,  3, 12, 15, 21, 32, 27, 24, 20,  3,  7, 32,
       22, 12, 25,  1, 26, 10, 32, 32, 29,  7, 21,  3, 13, 22,  8, 18,  1,
       30,  2, 18,  6, 11, 18, 20, 16,  3, 28, 30, 10,  2, 19, 26, 16, 32,
        5, 27, 30, 24, 13, 25,  3, 12,  6,  4, 28, 23, 10,  9, 26, 28,  1,
       20, 15, 20, 20, 13, 23,  1,  2,  3,  9, 18, 11, 11,  6,  4, 28, 30,
       24, 18, 29, 25, 23, 20,  4, 18, 11, 30, 31, 11, 20, 11, 17, 14, 26,
        4, 24, 20, 17, 32, 15, 21, 13, 24, 23,  8, 15, 22, 13,  1,  9,  4,
       20, 23, 17, 19, 22,  2,  8, 21, 19, 22, 18, 16,  0, 22, 27, 28,  8,
       15,  2, 24, 28, 13, 10,  9,  1, 18,  5, 23, 26, 15, 19, 14, 18, 23,
       29, 19, 30,  4, 25,  6,  8,  7,  2,  5, 26, 19,  9,  4, 22, 14, 22,
       16, 11, 20,  7, 26,  7, 30, 28,  1,  5,  7, 27, 21, 26,  4,  3, 14,
       26,  7, 27, 15, 10, 26, 30, 10, 17, 17, 29, 23, 21, 28, 19, 24,  1,
       14, 22,  4, 29, 30, 22,  6, 31,  9, 24, 13, 16,  6, 16, 13, 28, 29,
        7, 18, 24, 25, 21, 18,  9, 18, 27,  6, 23,  2, 24,  2, 11, 19, 20,
       17,  2, 26, 11,  2, 27,  6, 23, 23, 11, 16, 29, 22, 19,  3, 15, 31,
       24, 22, 19,  2, 18,  0, 15, 27, 17, 23,  4, 18, 22, 26, 21, 16, 21,
        8, 31,  1, 21,  6, 31, 20,  7, 24, 11, 26, 23, 30, 14,  6, 13, 29,
        7, 16, 20, 11, 19, 16, 11, 32, 30,  3, 19, 17, 22, 30, 12,  2,  7,
       30, 12, 24, 18, 14,  2, 12, 31, 26, 11, 20,  5, 15,  0,  3, 28,  3,
        3,  9,  2,  6, 14, 26, 18, 10, 17, 12, 21, 26,  7, 31,  4, 19,  2,
       13, 14, 13,  6,  8, 25, 26, 12, 17, 17, 14, 23, 22, 22,  7,  8, 29,
       18, 16, 15, 30, 32, 25, 31, 17, 20, 24, 26, 12, 24,  1,  4,  9, 18,
       30,  2, 24, 16,  3, 22,  1,  6, 24,  4, 22,  4, 17, 15,  8,  1, 17,
        7, 15, 19, 19, 20,  8,  1,  3,  6, 22, 23, 15,  1, 23, 27,  7, 28,
       21, 31, 14, 14,  9, 29, 26, 14, 31, 23, 29, 31, 17,  5,  4, 29, 18,
       21,  2, 12, 19, 21, 26, 32, 30,  1,  3,  7, 18, 13,  3,  8, 30, 30,
       31, 20,  3, 24,  1, 19, 15, 14,  6, 27, 10,  2, 22, 24, 15, 23, 14,
       10,  8, 11,  8,  1, 22, 16, 29, 17,  2, 31, 30, 15, 23, 26, 12, 30,
       25, 20, 24,  9, 17,  3, 16,  3, 30, 22,  6,  6, 23, 29, 29, 21, 13,
       11, 15, 14, 13,  3, 17, 15, 25,  1, 12, 15,  7,  2, 11, 24, 21, 30,
       25, 11,  4, 29, 16, 30, 22, 25, 16, 23, 16, 14,  6, 23, 26, 12,  8,
       18, 20, 20,  1,  3,  4, 21, 30, 30,  9, 30, 27, 19, 27, 21, 15, 10,
        5, 28, 22,  7, 15, 12, 29, 10, 24, 27, 30,  9, 12, 29, 12, 23, 28,
        7,  1, 10, 22, 24, 25, 22,  8, 27, 21,  3, 19, 12, 20,  4, 14, 15,
       12, 22,  2,  7, 13,  7, 16, 30, 16, 28, 16,  0,  8, 24, 18, 14,  2,
       30,  5, 24, 24,  6, 11, 18,  8, 10, 13, 10, 28, 22, 27,  5, 19, 18,
        5, 16,  7, 17, 30, 17, 11, 17,  5,  5, 13, 12, 19,  7, 10,  1, 24,
       13,  6,  8, 25,  8,  9, 28,  4, 19, 16, 29,  9, 25, 28, 20, 29,  3,
       24,  6, 11, 15, 20,  8, 16, 13,  1, 11,  0,  0, 10, 10, 32, 15,  5,
       29, 25, 22, 20, 21, 15, 13, 18,  5, 28,  1,  6, 21,  8, 11, 22, 22,
       11,  6,  3, 14, 13,  4, 10,  4,  7, 24, 23,  2,  9,  1,  1,  9, 25,
       14,  4, 12,  7,  2, 30, 24, 19, 26, 30,  7, 13, 15,  8, 22, 25, 22,
       21,  5,  9, 29, 14, 31,  6, 16, 13, 12, 11, 22,  0, 27, 29, 28, 15,
       10, 19, 12, 28,  9,  8, 31,  6, 15, 30, 12, 16, 31,  6, 18,  1, 29,
        5, 15, 32, 16, 20, 26,  9, 15,  3, 29,  8,  1, 21, 11, 12, 28, 22,
        6,  2, 20,  3,  3,  2, 28, 24,  3, 14,  5, 12, 28, 11,  6, 16, 17,
       15,  4,  7, 27,  8, 11, 10, 31,  1,  0, 11,  4, 11, 25, 18, 18, 18,
       19, 32, 16, 28, 19, 25, 15,  2, 10, 25, 27,  8,  7,  3, 17, 28, 19,
       21, 10,  0,  3,  7,  8,  5, 28, 19, 14, 18, 16, 24, 29, 16, 18, 28,
       32,  7, 10, 27,  7, 23, 15, 11,  8, 32,  1, 16, 27, 31, 20, 17,  6,
       26, 30, 14,  3, 10, 19, 28,  6, 14, 31, 12, 20,  1, 17,  1, 22, 29,
       12,  1,  5, 18,  7, 17, 16, 24, 12, 28,  6, 26, 17,  4, 25,  3,  4,
       32,  2, 15, 30, 27,  9, 20, 10, 11, 27, 29, 15, 26, 30, 25,  3, 28,
       32, 26, 19], dtype=int8)
%onnx::Add_1, shape: [1, 96, 5, 5], exponents: [-5], 
value: array([ 4, 21, 18, 23, 29, 25, 21, 28,  8,  3,  1,  3, 19, 19, 12, 30, 28,
       23,  6, 32, 27,  8,  5, 10, 27,  6, 32, 30, 10, 29, 10,  6, 18, 26,
       15, 31, 14, 11, 19, 10,  6, 11,  5, 20, 30, 21, 25, 14, 23, 17, 14,
       21, 21, 12, 24, 15, 14,  6, 15,  9, 21,  7, 15,  8, 29, 25, 28, 16,
       32, 15,  2,  5, 27,  4, 30, 23, 11,  8,  7, 28, 26,  8,  3, 10, 26,
       20, 30, 15, 16,  1,  9, 11, 13, 11, 11, 13,  3, 29,  0, 23, 24, 10,
       12, 12,  9, 22, 23,  8, 13, 29,  3,  2, 23, 29, 30, 17, 23, 20, 27,
       22, 15,  4, 17, 18, 30,  4,  1, 29, 18, 31,  7, 12, 18, 14, 14, 21,
        8, 31,  8, 14,  6, 29, 29, 10, 20,  9,  7,  4,  7, 13, 31, 27,  3,
       15, 10,  2, 28, 15, 10, 14,  1, 27, 24,  8,  3, 30,  8,  3, 19, 21,
        5,  8, 11, 17, 11, 28, 12, 19, 25,  5, 32, 16, 21, 28, 28, 27, 16,
        8, 18,  1, 21, 11, 17,  3, 13, 24, 18, 28,  3, 22,  9, 14, 12, 20,
       12,  8, 10, 20, 31,  2, 18,  6, 12,  2,  6, 25, 10, 11, 17,  7, 31,
        8, 30,  5, 23,  1,  7,  5, 32, 29,  3, 19,  7, 28,  5, 17, 20, 17,
       24, 27, 22,  0, 29, 10, 20,  5,  4, 28,  4, 18, 32,  3,  2, 24, 17,
       19,  3, 13,  9, 12, 27,  8, 15,  9,  3, 32, 16, 10, 24,  3,  5, 20,
       18, 23, 20, 13,  3, 25,  6,  7,  2,  5, 15,  8, 32, 10,  7, 14, 30,
       15, 26,  5, 17, 16,  8,  2,  7,  5, 26, 13, 31, 25, 24, 15,  6, 24,
       21,  9,  5,  1,  4, 16, 21,  8, 27,  4,  2, 25, 25, 22,  8, 14, 21,
       12, 19, 25, 23,  7,  2,  4, 22, 11,  6,  6, 27, 22, 12, 23,  2, 25,
        2,  5, 25, 21,  1, 17,  2,  3, 31,  5, 32, 31, 11,  4, 29, 20, 21,
        1,  2, 26, 22,  6, 29, 22,  8,  3, 15, 22,  1,  9, 24, 20, 32, 19,
       16, 21, 23,  4, 28, 32,  5, 30, 30, 28, 32,  4, 27, 15, 19, 28, 10,
       30, 30,  5,  2, 25, 23, 28, 12,  2, 32, 17, 13,  2, 22,  2, 26, 23,
       21,  0, 21, 31, 12, 23, 18,  9, 26,  2,  8, 30,  9, 21, 25, 24, 23,
        8,  5, 14, 23, 24,  3, 19,  3, 14, 16, 15, 13,  5, 13, 21, 28,  3,
        6,  4, 16,  6,  8, 10, 29, 24, 13, 22, 17, 12,  3, 30,  4, 29,  8,
       27, 27, 24, 31,  8,  3, 17, 17,  3, 15, 19, 24,  8, 31, 30,  4,  5,
       30, 21, 11, 19, 30, 13,  5,  1, 32, 14, 25, 16,  3,  8, 27,  4, 10,
       12, 11,  7, 23, 25,  9,  8, 19, 25, 28, 24, 17, 25, 24, 22, 19,  7,
        4, 17, 27, 31, 21, 17, 20,  3, 18,  7,  9,  9, 10, 18, 11, 15, 14,
        1, 18, 19,  6,  9, 11, 15, 12, 20,  2,  3, 12, 19,  3, 25, 12, 15,
       15, 24, 10, 25, 20,  2,  0, 14, 20,  6,  1,  0, 12, 14, 15,  8,  6,
        7,  4, 25, 16, 15,  5,  8, 18, 27,  1, 22, 20, 21, 24, 26,  3, 21,
       29, 14, 12,  1, 18, 20,  7,  5, 17, 32, 11, 29, 10,  2, 23, 22, 29,
       14,  5, 17, 26, 31,  5,  1, 29,  8, 29, 14, 12, 24, 30, 30, 14,  3,
       11, 22, 32, 10,  3, 15,  6, 19, 26,  1, 31, 12, 17, 29, 12, 14, 18,
       30,  4, 21,  3, 17,  6, 16, 23, 17, 27, 24, 18, 25,  0, 16,  9, 11,
       22, 32, 15, 30, 21, 26, 15, 32, 11, 18, 12,  8,  8,  0, 13,  9,  6,
        5, 17, 15, 26,  1,  3, 13, 32, 15, 21, 27, 26, 12, 21, 30,  8,  6,
       14, 28, 16, 26, 25,  0, 16,  6, 17, 10, 27,  7, 26,  6, 22, 30,  7,
        4, 12, 30, 23,  5,  0,  2,  5,  8, 13,  7,  3, 18,  3, 23, 27, 15,
       13, 26, 31, 12, 12, 10,  2,  8,  4, 19, 28, 27, 22, 23, 22, 25, 26,
       29, 20, 25, 23, 10, 11, 18, 12, 29,  4, 23, 18,  8,  7,  9,  2,  1,
        5, 25, 13, 31,  6, 16,  3, 15,  4, 31, 15, 19, 26, 12, 18, 16,  2,
       21,  4, 31, 18, 32,  6, 26,  7,  8, 27, 23, 26,  4, 14, 24, 20,  1,
       31,  2, 17, 24, 28, 17,  9, 23,  3,  9, 18,  2,  7,  8, 25, 26, 13,
       25, 19, 12, 20,  4, 31, 11,  9, 20, 27, 13, 22,  9,  2, 20, 10, 27,
        5, 21, 23, 23, 13, 10, 12,  2, 16,  9,  6, 29, 25, 30, 27, 28,  9,
        7,  0, 26, 10, 18,  5,  1, 17, 14, 22, 16, 20,  3, 11, 14, 28, 24,
       21, 11,  7, 13,  0, 18, 14, 20, 27, 24, 26,  7, 19,  7, 21, 21,  3,
        1, 26, 19, 16,  9, 12, 30, 32, 17,  2, 20, 21, 25, 21,  8, 17, 29,
       30,  1,  9, 30,  3, 11,  9, 17, 28, 18,  1, 11, 32, 28, 29, 12, 21,
       32, 20, 19, 12, 10,  8, 13, 17,  8, 30, 24,  4, 21, 26, 14,  9,  1,
       15, 30, 11, 18, 14, 20,  9, 14, 15,  0, 31, 12, 13, 24, 22, 28, 12,
       13,  7, 15,  9, 20, 18, 25, 25,  2, 24, 16, 22, 22,  5, 31, 27, 22,
        6, 12, 16, 26, 22, 22, 21, 19, 22, 21, 10, 21, 28, 29, 22, 27, 24,
       14,  1, 25, 20, 20, 11, 21,  0,  4, 18, 13,  1,  6, 13, 20, 11,  2,
        6, 27, 32, 19,  0, 14, 15, 12,  7, 22, 14, 28, 31, 26, 10,  6, 24,
       19, 17,  2, 16, 13, 17, 17, 30,  9, 19, 22, 23, 31, 12, 30, 30,  7,
        3, 27,  3, 18,  6, 22,  6, 27, 20, 16,  4, 12, 18, 13,  9, 31,  4,
       19, 13, 21, 29,  9,  9, 27, 24, 28, 21, 27, 11,  2,  1, 28,  7, 10,
       14, 19, 15,  4,  1, 31, 18, 21, 28, 14, 30, 22, 18, 25, 18,  0, 29,
        1, 23, 22,  7, 10, 18, 16,  6,  2, 12, 11, 10,  4, 25, 25,  2,  9,
        3, 27, 27,  1,  9, 15,  9,  1, 26, 12, 18, 12, 18, 17,  2, 29, 15,
        2, 27, 12,  8, 16, 11,  2, 13, 24, 13, 26, 31, 16, 11,  3,  3, 31,
        4, 19, 15,  9, 16, 26, 32, 20, 14,  7,  3, 10, 16, 29, 24,  6,  2,
       20, 23, 29, 24, 18, 25,  8, 10,  8,  6,  5,  3, 23,  8, 27, 15, 25,
       18, 22, 11, 10, 16,  8,  6, 32, 15, 11, 27,  4, 22,  2, 29, 12, 18,
       22,  3, 20, 13,  1, 11,  5, 27, 15, 13, 11, 22, 30,  4,  3,  7, 21,
        0, 23, 21, 17, 24, 16,  5, 10, 16,  2, 21, 10, 31,  3, 11,  1,  0,
        0, 21, 24, 24,  6,  7, 28, 31, 22,  0, 29,  6, 10, 27,  9, 23, 20,
       13, 16, 14, 18, 16, 14,  7,  4,  7,  7,  2,  6, 26, 21, 24,  1, 22,
        0,  5,  1, 27, 21,  8, 31, 19,  8, 18,  9, 31,  0, 14, 22, 11, 27,
       32,  9, 22, 30, 23, 22,  3, 28, 29, 27,  6, 18,  7,  2,  9, 11, 21,
       15, 29,  6,  2, 16, 15, 19,  6, 10, 24, 25, 19,  8, 29, 30, 16,  5,
       14,  7, 23,  9, 29, 14,  6, 11, 10, 15, 30, 12, 13, 26, 22,  0,  3,
       26, 24,  4,  5, 32,  1,  7,  7, 29,  7, 15, 26, 19, 15, 30,  7, 12,
       20, 16, 18,  9, 24,  7,  1,  4, 10, 21, 28, 14, 16, 23, 14,  8, 17,
        3,  2, 18,  4,  7, 13, 31, 24, 22, 16, 21,  9, 30, 17, 25, 24, 19,
       22,  2, 30, 30,  8, 15, 30,  2,  9, 18,  4, 12,  4, 22,  6, 20,  9,
       20, 29, 11, 13, 14, 10,  7, 24, 24, 29,  4, 25, 23, 25, 14, 21, 24,
        4,  2,  9, 16,  9,  2, 19, 25, 29, 30, 31,  1, 18, 29, 14, 10,  3,
        9, 24, 29, 19,  9, 13, 13,  9,  5, 17, 20, 25, 16, 22, 30, 29, 25,
        5, 28, 27, 18,  1, 13, 26,  9,  3,  5, 25,  8, 24, 26, 28, 23, 12,
       10, 15, 29, 24, 18,  6, 23,  1, 30, 15, 26,  1, 20,  3,  4,  1, 30,
       10,  8, 19, 22, 23,  1, 29,  3, 14, 14,  3,  9,  0,  1, 26, 24,  0,
        9,  9, 28, 20, 27, 32,  2, 17,  4,  6, 29,  5, 16, 14, 14,  3, 17,
       18, 26,  5, 19, 22,  7, 28, 17,  4, 26, 13, 20, 14, 16, 24, 14, 30,
       10, 13, 21, 26, 27, 11, 23, 19,  5,  2, 30, 17, 15, 12, 31, 22, 25,
       22, 10, 11, 12, 10, 11, 28, 29, 17, 26,  7, 13,  2,  4, 29, 31,  1,
       12,  1, 18,  5,  7,  7, 30, 28, 29,  5, 13, 27, 17, 13, 25, 25, 20,
        3,  2, 18,  3,  2, 13,  6, 19, 32, 25, 22, 24, 12,  3, 28, 17, 32,
        4, 27, 20, 25, 25, 25,  8, 21, 15, 14, 12,  6,  2, 22,  0, 20, 25,
       23, 16, 25, 14, 12, 10, 30,  0,  5, 14, 26, 13,  9, 12, 13, 12,  8,
       24, 31, 24,  6, 25, 14,  8,  4,  2, 13, 25, 21,  5, 27, 19, 16, 28,
       14, 22, 31, 19,  6, 18, 25, 24, 23,  4, 18,  1, 15, 11, 29,  0, 18,
        1, 23,  2,  5, 21, 17, 16,  8,  7, 14, 24,  9, 16,  4, 31, 31, 18,
       31,  2, 22, 14, 11, 29, 13,  1, 24, 23, 13,  5, 27,  2, 16, 16,  8,
       16, 24,  6,  2,  6, 31, 23, 14, 20, 25,  4, 28, 23, 27, 13,  5, 23,
       17, 13,  4,  7, 14, 10,  4, 17, 11, 26,  6, 15, 23,  9,  2, 25,  2,
        4, 16, 12,  9,  6, 18, 25,  4, 19, 20,  4,  3,  7, 28, 24, 15,  3,
        5, 19,  3,  9,  1, 24, 20, 27, 20, 24, 13, 23, 18, 16, 20, 25, 29,
       11, 27, 31, 15,  2, 20, 10,  8, 10, 31, 16,  4, 12, 10,  1,  6,  7,
        5, 24,  7, 20, 20, 30, 29,  1,  4, 28, 29,  9, 14,  1,  7, 17, 25,
       12, 13,  8,  1, 21, 32, 18, 21,  0,  2, 22, 14, 28, 23, 23,  8, 32,
       21,  1, 27, 25, 22, 12, 17, 17, 10, 15, 24, 12, 24, 30, 29, 13, 31,
       28, 17, 23,  8, 17, 28, 14,  5, 24, 20, 32, 15, 23, 13, 25, 12, 31,
       18,  8,  2, 20, 13, 16,  8,  5,  8,  8,  3, 22,  7, 18, 15, 16, 26,
        9, 26, 25,  7,  0, 13,  1,  3,  4, 11,  1,  9, 25,  4,  3, 20, 29,
       13, 26,  3, 28, 30, 25, 13, 11, 28, 15, 18, 11,  7, 29,  1, 16, 30,
        9,  7, 23, 28,  9,  4,  6,  3, 15, 27, 32,  8, 23,  2, 12, 13, 12,
       19, 22, 25,  4,  1,  2, 10,  2, 28,  3, 20, 29, 31, 20, 14, 16,  3,
        4, 19, 21, 19, 28, 18, 20, 19, 28, 32,  2,  8, 28, 14, 13, 18, 26,
        3,  3, 25, 29,  6,  6,  0, 24, 17,  1,  1,  4, 15, 31,  0, 11,  2,
        8, 16, 26, 24, 22, 14, 16,  8, 23,  2,  7, 27, 20, 28, 32,  2,  8,
       15, 13,  4, 24,  8,  1, 17,  3, 14, 19, 18, 14, 28,  9, 11, 16, 16,
       20, 16,  2, 14, 11, 20,  4, 12, 26, 13,  6,  3, 19, 23, 21, 14, 26,
        7,  8, 29, 26,  4,  4, 11,  5,  6, 13,  3,  7, 26,  8, 29,  8,  9,
       24,  9, 31,  7,  1, 21, 28,  3, 24, 22,  8, 25, 22, 18, 14,  7, 14,
       13, 15, 10,  2,  1, 29, 21, 21, 27, 11, 29, 14, 13, 23, 21, 19,  2,
       18, 26, 14,  2,  6,  6, 12, 11, 30, 30, 30, 17, 14,  0, 31, 18,  8,
        1, 30,  4, 30, 31, 30, 31, 16, 12, 10,  6, 24, 31,  4,  8,  1, 26,
        1, 21, 22, 15,  5,  1, 21, 20, 11,  6,  5, 31, 30, 16, 22, 10,  9,
        8, 11, 15,  7, 14,  1, 19, 29,  4, 16, 13, 31, 22,  7, 20, 26, 22,
       20, 27, 19,  1, 20,  4,  6,  1, 12, 27, 16, 17, 10,  8, 12, 28,  2,
        7, 10, 29, 16, 11, 32, 20,  4,  7, 25,  4, 28,  3, 27, 13,  5, 24,
       16, 17, 20, 22,  3, 31, 22, 16, 14,  3, 23,  4, 18, 13, 23,  3,  6,
       20,  9,  1, 28, 14,  9,  3,  9, 28,  4,  0, 10,  8, 16,  0, 14, 22,
       22,  3, 16, 23, 28,  3, 10,  3, 14, 16,  3,  0, 29, 24, 24, 15,  5,
       11, 24,  3, 12, 17, 25, 29,  7, 12, 14,  8, 30, 20, 22, 30, 13, 10,
        1,  3, 11,  7, 14, 29, 25,  7,  8, 14,  1,  4,  2,  0, 21, 22, 18,
        1, 10, 23, 28, 28, 30, 21,  9,  8, 16, 30, 15, 25, 22,  7, 24, 30,
       27,  4, 12, 10, 25, 10, 21, 27,  1, 12, 25, 21, 25,  3,  5, 22, 30,
        6, 10, 14,  6, 17, 19, 25, 16, 29,  7,  3, 24,  9, 20, 24,  9, 19,
       19,  7, 11, 30, 19,  0, 22,  3, 28, 21, 27,  7, 14, 28, 28, 13, 29,
       22, 32, 21, 21, 11, 29, 10, 16, 29, 12, 19, 16, 27,  4, 12, 25,  8,
       29, 24, 13, 30, 30, 27,  8,  6, 18,  5, 17, 20,  1, 22,  5,  1, 19,
        8, 18,  7, 20, 27, 10, 26, 11, 16,  8, 11, 32,  8, 23,  3, 28, 17,
       29, 12,  7, 25,  0, 30,  8, 28, 15, 17, 26,  5, 20, 20, 21,  9, 21,
       14,  1, 25,  3, 13, 29,  6, 26, 18, 17, 29, 27, 17, 20, 32, 25, 24,
       29, 30, 29], dtype=int8)


test outputs value:
%2, shape: [1, 96, 5, 5], exponents: [-5], 
value: array([29, 33, 44, 43, 42, 49, 27, 36, 18, 25, 16,  8, 41, 20, 36, 59, 37,
       26, 24, 54, 49, 18, 34, 13, 30, 25, 45, 49, 16, 41, 17, 28, 46, 42,
       30, 44, 29, 14, 43, 29, 16, 18,  6, 48, 49, 32, 52, 44, 47, 35, 43,
       44, 39, 31, 29, 17, 14, 37, 23, 27, 28, 25, 34, 19, 31, 43, 30, 42,
       34, 22,  7, 21, 33, 24, 47, 52, 30, 15, 36, 38, 43,  9, 30, 18, 49,
       43, 55, 17, 22,  5, 23, 41, 22, 38, 24, 36, 35, 46,  7, 46, 30, 31,
       32, 21, 18, 44, 46,  8, 35, 31, 32, 23, 32, 29, 31, 26, 35, 35, 32,
       53, 40, 25, 41, 30, 39,  7, 26, 49, 24, 40, 26, 20, 28, 41, 24, 26,
       20, 60, 28, 23, 17, 30, 48, 34, 26, 23, 13, 27, 20, 25, 46, 37, 15,
       37, 23, 19, 36, 39, 29, 34, 29, 50, 25, 21, 11, 43, 10,  8, 34, 51,
       13, 37, 34, 19, 42, 48, 32, 40, 52, 11, 48, 22, 26, 52, 36, 53, 36,
       24, 49, 28, 23, 36, 39, 32, 36, 40, 36, 49, 16, 29, 19, 27, 41, 43,
       35, 26, 40, 24, 41, 20, 39, 38, 17, 32, 15, 50, 16, 20, 24, 37, 52,
       25, 36, 16, 38, 18,  8, 32, 47, 48, 22, 22, 18, 60, 14, 27, 51, 40,
       39, 58, 36, 28, 35, 10, 31, 17, 32, 58, 23, 47, 38, 32, 34, 42, 25,
       36,  5, 39, 17, 26, 30, 23, 22, 23, 15, 45, 43, 10, 56, 32, 18, 50,
       33, 48, 31, 20, 20, 32, 14, 35,  8, 20, 16, 22, 42, 17, 15, 29, 37,
       36, 32, 28, 45, 28, 17, 31,  8, 19, 31, 13, 52, 34, 33, 22, 11, 55,
       28, 13, 20, 12, 21, 45, 35, 26, 55,  9, 15, 42, 30, 42, 39, 39, 46,
       20, 30, 41, 27, 30,  7, 33, 35, 32, 22, 28, 42, 53, 30, 53, 16, 31,
        8, 18, 29, 37, 26, 24, 22, 25, 55, 14, 47, 37, 20, 15, 48, 44, 35,
        3, 19, 48, 36, 34, 37, 35, 25,  8, 36, 31, 19, 36, 51, 49, 44, 40,
       36, 43, 31, 22, 37, 53, 32, 33, 61, 41, 52, 30, 55, 25, 20, 54, 26,
       49, 39, 19, 11, 55, 39, 38, 41, 31, 46, 45, 36, 34, 33, 17, 51, 25,
       24, 18, 21, 61, 33, 31, 45, 34, 53,  9, 28, 58, 31, 33, 54, 55, 24,
       37, 24, 34, 32, 52, 20, 23, 17, 37, 45, 44, 22, 11, 36, 25, 45, 33,
       13, 12, 22, 31, 38, 35, 60, 30, 21, 34, 30, 16, 10, 40,  7, 38, 11,
       59, 57, 47, 57, 33, 16, 24, 24, 10, 38, 51, 31, 38, 40, 47, 31, 10,
       49, 46, 26, 29, 54, 19, 34, 32, 47, 44, 38, 33, 24, 25, 32, 30, 17,
       13, 30, 33, 31, 54, 14, 25, 21, 41, 49, 39, 33, 54, 55, 27, 51, 25,
       21, 38, 46, 48, 31, 42, 40, 30, 21, 26, 31, 29, 39, 18, 30, 25, 15,
        8, 23, 40,  9, 10, 25, 22, 36, 37, 30, 11, 36, 29, 29, 41, 41, 24,
       22, 26, 33, 37, 50, 31,  2, 32, 32, 31,  1,  4, 37, 38, 25, 35, 35,
       25, 35, 36, 44, 17, 15, 10, 46, 31, 20, 54, 23, 46, 36, 51, 19, 42,
       31, 45, 17, 15, 48, 37, 29, 26, 42, 61, 42, 33, 23, 28, 53, 30, 29,
       37, 34, 23, 57, 34, 21, 14, 53, 32, 38, 27, 25, 47, 48, 35, 45, 28,
       36, 22, 46, 31,  7, 17,  9, 28, 45, 29, 55, 41, 48, 33, 17, 28, 28,
       57, 15, 43, 16, 44, 23, 29, 53, 41, 27, 39, 49, 40, 24, 46, 15, 31,
       41, 35, 28, 53, 43, 38, 19, 51, 19, 42, 28, 32, 29,  7, 27, 22, 32,
       27, 36, 32, 28, 32, 18, 42, 39, 42, 27, 57, 32, 22, 37, 57, 14,  9,
       15, 41, 40, 34, 48,  4, 16, 11, 22, 32, 40, 10, 28, 12, 48, 43, 17,
       23, 22, 38, 42, 12, 29, 10, 11, 30, 13,  7, 33, 29, 15, 39, 51, 28,
       25, 53, 32, 29, 22, 15, 31, 16, 27, 25, 33, 35, 32, 42, 35, 37, 52,
       61, 43, 27, 35, 30, 31, 40, 33, 42,  4, 37, 46, 11, 38,  9, 20, 14,
       27, 39, 35, 46, 10, 46,  6, 24, 12, 57, 24, 19, 46, 41, 34, 23,  3,
       42,  6, 48, 48, 59, 11, 37, 19, 31, 37, 28, 53,  9, 40, 47, 25, 24,
       37, 31, 28, 41, 32, 30, 35, 34, 32, 10, 41, 15, 12, 26, 42, 32, 22,
       40, 51, 35, 50, 17, 58, 27, 25, 30, 30, 23, 31, 21, 25, 25, 16, 37,
       14, 29, 48, 49, 25, 34, 30,  5, 18, 24, 13, 54, 35, 43, 38, 33, 20,
       30, 28, 45, 24, 23, 12, 28, 22, 26, 34, 34, 50, 29, 29, 25, 60, 56,
       40, 19, 13, 32, 18, 22, 45, 34, 37, 35, 52, 30, 39, 18, 53, 23, 24,
        1, 49, 38, 42, 20, 36, 43, 52, 18, 28, 24, 42, 36, 48, 20, 40, 48,
       57, 33, 27, 51,  8, 42, 36, 49, 48, 45, 21, 18, 56, 42, 56, 41, 45,
       51, 45, 22, 14, 22, 26, 35, 21, 30, 61, 29, 33, 40, 29, 43, 30,  1,
       24, 37, 15, 25, 31, 24, 39, 42, 36, 31, 46, 39, 29, 32, 43, 41, 21,
       25, 26, 28, 25, 34, 30, 30, 35, 27, 39, 28, 33, 27,  6, 55, 30, 26,
        9, 26, 41, 42, 35, 43, 36, 42, 29, 29, 27, 52, 49, 59, 41, 41, 51,
       31, 21, 28, 40, 21, 41, 50, 22,  6, 35, 44,  4,  6, 21, 35, 32, 28,
       15, 50, 34, 47, 19, 22, 27, 38, 39, 22, 27, 54, 43, 29, 27,  8, 38,
       32, 30,  2, 22, 28, 30, 49, 56, 37, 34, 50, 24, 39, 18, 39, 55, 24,
       25, 45, 16, 35,  7, 39, 23, 55, 40, 30, 20, 42, 45, 14, 16, 44,  9,
       46, 14, 28, 29, 36, 11, 58, 47, 56, 45, 38, 39, 28, 23, 49, 32, 16,
       42, 24, 47, 31, 10, 62, 45, 24, 29, 35, 53, 30, 40, 29, 47, 19, 53,
       11, 28, 52, 29, 14, 20, 45, 29, 12, 26, 26, 18, 15, 57, 39, 14, 38,
        6, 28, 30, 32, 26, 36, 38,  2, 33, 30, 39, 39, 44, 31, 31, 41, 41,
       33, 54, 39, 19, 44, 39, 12, 42, 33, 24, 48, 63, 19, 39, 22, 23, 53,
        4, 42, 19, 26, 19, 37, 39, 29, 40, 36, 10, 24, 38, 51, 52, 24, 22,
       38, 25, 45, 34, 29, 50, 25, 40, 28, 31, 33, 15, 27, 30, 33, 45, 30,
       26, 29, 29, 16, 42, 40, 38, 46, 23, 16, 41, 12, 44,  7, 50, 21, 29,
       49, 30, 42, 29,  4, 16, 30, 45, 26, 39, 35, 47, 40, 33, 26,  9, 27,
       11, 37, 23, 33, 42, 32, 18, 24, 46, 13, 32, 19, 33, 15, 42,  9, 32,
       15, 49, 53, 25, 29, 36, 33, 39, 39, 19, 40,  9, 33, 56, 38, 47, 40,
       37, 38, 33, 26, 29, 14,  8, 28, 18, 13,  8, 27, 55, 21, 28,  5, 36,
        7, 37, 11, 31, 36, 27, 58, 34, 24, 36, 17, 41, 10, 33, 40, 28, 34,
       37, 31, 27, 45, 37, 30, 32, 55, 61, 52,  7, 45, 10,  8, 19, 40, 33,
       26, 53, 22,  3, 33, 43, 40, 30, 25, 55, 45, 19,  9, 35, 56, 39, 11,
       17, 21, 39, 25, 54, 36, 33, 32, 35, 20, 58, 16, 44, 46, 35, 29, 35,
       44, 49, 28,  8, 52,  5, 28, 27, 53, 28, 27, 47, 26, 16, 41, 25, 40,
       22, 19, 30, 12, 49, 26, 17, 15, 15, 24, 46, 30, 19, 30, 28,  9, 39,
       17, 31, 38, 18, 12, 36, 47, 30, 31, 19, 40, 35, 34, 26, 29, 40, 30,
       26, 22, 37, 32, 35, 40, 40, 32, 23, 38,  4, 43, 18, 24, 16, 23, 20,
       35, 33, 21, 42, 43, 33, 16, 42, 35, 45, 27, 26, 51, 54, 20, 36, 32,
       31, 12, 11, 43, 40, 12, 24, 52, 51, 38, 53, 16, 19, 43, 26, 11,  6,
       20, 25, 53, 31, 11, 41, 21, 29, 11, 21, 20, 50, 31, 37, 34, 51, 35,
        8, 53, 59, 19, 15, 20, 41, 17, 33, 27, 47, 17, 54, 45, 58, 34, 37,
       25, 20, 47, 50, 35, 11, 31, 25, 32, 19, 55, 15, 29, 14, 29,  2, 53,
       11, 20, 27, 38, 44,  5, 45,  9, 46, 14, 31, 25, 31, 21, 51, 24, 30,
       14, 24, 48, 36, 49, 58, 25, 21, 24, 18, 58, 12, 38, 20, 33, 12, 19,
       21, 46, 29, 26, 38, 24, 31, 29, 19, 47, 45, 47, 38, 36, 27, 21, 62,
       32, 25, 46, 27, 53, 21, 55, 51, 34,  9, 51, 20, 28, 34, 39, 40, 26,
       52, 12, 29, 18, 21, 29, 48, 45, 20, 54, 37, 23,  4, 23, 55, 47, 33,
       17, 28, 48, 29, 20, 32, 33, 40, 35,  9, 41, 50, 27, 22, 51, 53, 21,
       23, 17, 38, 23, 15, 36,  7, 21, 35, 34, 40, 35, 23,  9, 32, 45, 62,
       28, 45, 49, 50, 48, 45, 12, 39, 26, 44, 43, 17, 22, 33, 17, 34, 51,
       27, 40, 45, 31, 44, 25, 51, 13, 29, 37, 34, 28, 31, 25, 14, 21, 12,
       44, 54, 41, 25, 47, 16, 16, 25, 21, 35, 43, 37,  5, 49, 46, 44, 36,
       29, 24, 55, 47, 19, 28, 34, 25, 41,  9, 41, 27, 30, 30, 43, 18, 41,
       30, 42, 32,  9, 46, 23, 24, 15,  9, 19, 50, 28, 25,  8, 53, 45, 40,
       47, 13, 42, 21, 37, 36, 43, 29, 25, 28, 20, 32, 48, 28, 20, 19, 22,
       42, 31, 33, 17, 16, 57, 53, 24, 37, 42, 33, 51, 44, 55, 32, 29, 24,
       31, 35,  8, 36, 44, 32, 10, 48, 20, 50, 19, 31, 29, 25, 15, 53, 31,
       11, 34, 36, 34, 27, 36, 34, 22, 46, 26, 27,  5, 31, 30, 35, 34, 23,
       22, 21, 29, 20,  3, 51, 26, 50, 43, 35, 29, 52, 40, 35, 23, 40, 60,
       35, 49, 50, 17, 20, 20, 25, 35, 27, 54, 20, 22, 34, 36, 22, 22, 28,
       13, 55,  8, 41, 26, 61, 49,  8, 28, 39, 55, 32, 44, 15, 13, 30, 54,
       19, 29, 28, 12, 40, 48, 29, 53, 30,  5, 41, 31, 50, 53, 35, 10, 39,
       51, 13, 51, 43, 36, 14, 29, 48, 36, 26, 44, 17, 39, 30, 32, 41, 34,
       31, 26, 25, 14, 31, 54, 32, 15, 41, 32, 53, 41, 30, 44, 29, 31, 33,
       31, 22, 15, 26, 21, 41, 34, 17, 25, 25, 17, 45, 29, 40, 22, 24, 55,
       27, 42, 40, 37, 32, 38, 32, 20, 24, 35, 27, 21, 49,  5,  7, 29, 47,
       43, 28, 27, 44, 33, 47, 14, 17, 52, 19, 40, 15, 24, 44,  9, 17, 47,
       16, 22, 42, 47, 29, 12,  7,  6, 21, 49, 55, 23, 24, 25, 39, 20, 40,
       40, 53, 39, 18, 10, 31, 36, 16, 59, 26, 49, 60, 48, 25, 18, 45, 21,
       25, 21, 33, 38, 49, 44, 52, 49, 29, 35,  9, 26, 41, 17, 21, 48, 56,
       34, 23, 28, 53,  7, 25, 15, 38, 23, 28, 11,  6, 37, 55, 15, 34, 16,
       18, 24, 37, 32, 23, 36, 32, 37, 40,  4, 38, 57, 35, 51, 58, 14, 38,
       40, 33, 28, 33, 25,  4, 33,  6, 44, 41, 24, 20, 51, 38, 40, 37, 29,
       31, 31, 16, 27, 14, 37, 19, 37, 27, 25, 21, 10, 21, 34, 45, 35, 56,
       32, 19, 33, 55, 20, 34, 33, 30, 22, 36, 19, 21, 32, 31, 55, 20, 17,
       42, 29, 51,  8,  4, 25, 49, 33, 54, 31, 38, 52, 41, 45, 35, 22, 24,
       18, 43, 32,  9, 16, 41, 50, 31, 51, 38, 59, 23, 25, 52, 33, 42, 30,
       25, 27, 24, 24, 30, 31, 34, 19, 57, 51, 33, 36, 26, 20, 35, 32, 23,
       13, 52,  6, 37, 44, 37, 47, 46, 28, 38, 22, 24, 39, 28, 26, 15, 28,
       31, 26, 46, 39, 11, 12, 39, 28, 21, 19, 15, 59, 52, 43, 27, 29, 27,
       13, 27, 22, 24, 44, 18, 30, 46,  9, 21, 26, 43, 41, 14, 30, 27, 46,
       33, 33, 27, 26, 28, 13, 34,  5, 31, 43, 45, 26, 35, 36, 32, 57,  5,
       31, 16, 40, 31, 31, 40, 36, 17,  8, 36,  4, 28, 13, 37, 45, 20, 29,
       45, 42, 42, 42, 24, 46, 35, 34, 19, 31, 24, 10, 39, 21, 34, 25, 28,
       31, 15,  4, 42, 27, 13, 13, 13, 35, 28, 23, 12, 17, 17,  1, 23, 47,
       36,  7, 28, 30, 30, 33, 34, 22, 40, 46, 10, 13, 44, 32, 46, 40, 27,
       32, 29, 12, 41, 31, 56, 35, 23, 25, 26, 19, 52, 20, 49, 59, 41, 25,
       11, 22, 23, 35, 23, 37, 56, 13, 23, 44, 13, 20, 33,  6, 39, 23, 47,
        6, 25, 55, 44, 48, 56, 30, 24, 11, 45, 38, 16, 46, 33, 19, 52, 52,
       33,  6, 32, 13, 28, 12, 49, 51,  4, 26, 30, 33, 53, 14, 11, 38, 47,
       21, 14, 21, 33, 25, 30, 35, 47, 30,  7, 14, 28, 20, 45, 42, 27, 37,
       38, 39, 27, 58, 38, 25, 37,  5, 38, 46, 54, 15, 21, 31, 45, 41, 48,
       43, 42, 21, 24, 18, 37, 15, 44, 48, 26, 37, 32, 51, 33, 28, 43, 36,
       61, 31, 23, 57, 37, 50, 23, 17, 26, 37, 18, 36, 28, 53, 25, 18, 25,
       34, 48, 21, 23, 37, 29, 54, 17, 30, 39, 23, 52,  9, 40,  4, 50, 46,
       41, 13, 12, 43,  7, 47, 24, 52, 27, 45, 32, 31, 37, 24, 46, 12, 25,
       46,  3, 40, 33, 40, 38, 26, 36, 29, 44, 58, 42, 43, 50, 57, 28, 52,
       61, 56, 48], dtype=int8)