graph main_graph (
  %onnx::Add_0[INT8, 1x1x4x5], exponents: [-6]
  %onnx::Add_1[INT8, 2x3x4x5], exponents: [-6]
) {
  %2 = Add[quant_type = 'S8'](%onnx::Add_0, %onnx::Add_1)
  return %2
}


initializers value:



values info:
%2[INT8, 2x3x4x5], exponents: [-6]
%onnx::Add_0[INT8, 1x1x4x5], exponents: [-6]
%onnx::Add_1[INT8, 2x3x4x5], exponents: [-6]


test inputs value:
%onnx::Add_0, shape: [1, 1, 4, 5], exponents: [-6], 
value: array([42, 14, 50, 35, 30, 19, 60, 53, 45, 57, 54, 60, 52, 29, 13, 49, 32,
       48,  9, 42], dtype=int8)
%onnx::Add_1, shape: [2, 3, 4, 5], exponents: [-6], 
value: array([30, 26,  7, 57, 62, 21, 35, 12, 20, 18, 25, 51, 56, 29, 62,  9, 22,
       57, 62, 45, 61, 28,  9, 25, 61, 31,  9, 20, 11, 18, 12, 25, 27, 26,
       19, 14, 26, 39, 53, 57, 59, 33, 46,  0, 27, 55, 54, 26, 37, 46, 26,
       30, 53, 52, 26, 31, 59, 39, 39, 38, 23, 27, 39, 39,  1, 54, 14, 63,
       25, 59, 44, 26, 21,  5, 20, 43,  8, 39, 45, 45, 26, 18, 54, 59,  2,
       23, 30, 11, 40, 32,  7,  7, 47, 11,  3, 45, 61, 36, 47, 50, 19,  2,
        3, 22, 18, 27, 12,  7, 63,  5, 56, 37, 10, 63, 37, 36, 20, 25, 48,
       17], dtype=int8)


test outputs value:
%2, shape: [2, 3, 4, 5], exponents: [-6], 
value: array([ 72,  40,  57,  92,  92,  40,  95,  65,  65,  75,  79, 111, 108,
        58,  75,  58,  54, 105,  71,  87, 103,  42,  59,  60,  91,  50,
        69,  73,  56,  75,  66,  85,  79,  55,  32,  63,  58,  87,  62,
        99, 101,  47,  96,  35,  57,  74, 114,  79,  82, 103,  80,  90,
       105,  81,  39,  80,  91,  87,  48,  80,  65,  41,  89,  74,  31,
        73,  74, 116,  70, 116,  98,  86,  73,  34,  33,  92,  40,  87,
        54,  87,  68,  32, 104,  94,  32,  42,  90,  64,  85,  89,  61,
        67,  99,  40,  16,  94,  93,  84,  56,  92,  61,  16,  53,  57,
        48,  46,  72,  60, 108,  62, 110,  97,  62,  92,  50,  85,  52,
        73,  57,  59], dtype=int8)