graph main_graph (
  %onnx::Add_0[INT8, 1x1x1x1], exponents: [-6]
  %onnx::Add_1[INT8, 1x1x1x1], exponents: [-6]
) {
  %2 = Add[quant_type = 'S8'](%onnx::Add_0, %onnx::Add_1)
  return %2
}


initializers value:



values info:
%2[INT8, 1x1x1x1], exponents: [-6]
%onnx::Add_0[INT8, 1x1x1x1], exponents: [-6]
%onnx::Add_1[INT8, 1x1x1x1], exponents: [-6]


test inputs value:
%onnx::Add_0, shape: [1, 1, 1, 1], exponents: [-6], 
value: array([27], dtype=int8)
%onnx::Add_1, shape: [1, 1, 1, 1], exponents: [-6], 
value: array([13], dtype=int8)


test outputs value:
%2, shape: [1, 1, 1, 1], exponents: [-6], 
value: array([40], dtype=int8)