graph main_graph (
  %onnx::Mul_0[INT16, 2x3x4x5], exponents: [-14]
  %onnx::Mul_1[INT16, 1x1x1x5], exponents: [-14]
) {
  %2 = Mul[quant_type = 'S16'](%onnx::Mul_0, %onnx::Mul_1)
  return %2
}


initializers value:



values info:
%onnx::Mul_0[INT16, 2x3x4x5], exponents: [-14]
%2[INT16, 2x3x4x5], exponents: [-14]
%onnx::Mul_1[INT16, 1x1x1x5], exponents: [-14]


test inputs value:
%onnx::Mul_0, shape: [2, 3, 4, 5], exponents: [-14], 
value: array([ 4947,  2135, 16152, 12498,  4398, 14302, 14976,  7309, 11483,
       11445,    60,  9132,  3120, 13971,  7833, 13079,  5138, 13723,
       14829, 12134,  6088,  9058, 10940,  9755, 16373, 13235,  1805,
       11037,  5780,  6231,  8724,  2282, 11580, 14262, 11233, 11923,
        5632,  7891,  4678,  3720, 13935,   618,   633,   688,  4111,
        4392, 15082, 14612, 14427, 11714, 13254,  8670, 10511, 10754,
       12985,  9382,  8985,  4972,  1887, 15638,  1545,  7768,  2044,
       10026,  7279,  3771,  7436, 15171, 16029,  9561, 14676,  8595,
         775, 12830, 11661, 14110, 15739, 14869,  5612,  9041,  2564,
        9401,  2232,  8992,  3688,   491, 16157, 10597,  4733,  9840,
       11027,  2035,  2146,  9530,  4345, 16375,  3608, 11195,  3864,
        7470,  7219,  2323, 13773,  6498,   268,  6020,  7996, 16219,
        9473,  2525,  8741, 15598, 13249, 11561, 12705,  8173,  7890,
        2330,  1730, 10316], dtype=int16)
%onnx::Mul_1, shape: [1, 1, 1, 5], exponents: [-14], 
value: array([6017, 8994, 1000, 7724, 8676], dtype=int16)


test outputs value:
%2, shape: [2, 3, 4, 5], exponents: [-14], 
value: array([1817, 1172,  986, 5892, 2329, 5252, 8221,  446, 5413, 6061,   22,
       5013,  190, 6586, 4148, 4803, 2821,  838, 6991, 6425, 2236, 4972,
        668, 4599, 8670, 4861,  991,  674, 2725, 3300, 3204, 1253,  707,
       6724, 5948, 4379, 3092,  482, 2205, 1970, 5118,  339,   39,  324,
       2177, 1613, 8279,  892, 6801, 6203, 4868, 4759,  642, 5070, 6876,
       3446, 4932,  303,  890, 8281,  567, 4264,  125, 4727, 3855, 1385,
       4082,  926, 7557, 5063, 5390, 4718,   47, 6049, 6175, 5182, 8640,
        908, 2646, 4788,  942, 5161,  136, 4239, 1953,  180, 8869,  647,
       2231, 5211, 4050, 1117,  131, 4493, 2301, 6014, 1981,  683, 1822,
       3956, 2651, 1275,  841, 3063,  142, 2211, 4389,  990, 4466, 1337,
       3210, 8563,  809, 5450, 6728, 3002, 4331,  142,  816, 5463],
      dtype=int16)