graph main_graph (
  %onnx::Mul_0[INT16, 1x96x5x48], exponents: [-13]
  %onnx::Mul_1[INT16, 1x96x5x1], exponents: [-13]
) {
  %2 = Mul[quant_type = 'S16'](%onnx::Mul_0, %onnx::Mul_1)
  return %2
}


initializers value:



values info:
%onnx::Mul_0[INT16, 1x96x5x48], exponents: [-13]
%2[INT16, 1x96x5x48], exponents: [-12]
%onnx::Mul_1[INT16, 1x96x5x1], exponents: [-13]


test inputs value:
%onnx::Mul_0, shape: [1, 96, 5, 48], exponents: [-13], 
value: array([ 471, 3461, 5273, 8183, 6726, 6387, 6607, 3352, 2449,  218, 5176,
       5077, 2274, 5498, 1808, 7858, 6869, 1106, 4275, 2039, 2515, 2719,
       1921,  504, 2196, 1210, 1603, 7182, 5271, 4310, 1683, 6827, 7215,
       5679, 3806,  883, 2548, 4821, 1338, 1434, 8139, 5824,  158, 3575,
       5949, 2081, 5324, 7112, 8086, 4672, 2289, 1735,  401, 3062, 6858,
       7582, 1086, 3287, 2629, 7520, 4402, 2142, 6627, 7643, 5105, 8176,
       2774,  694,  111, 5616, 7846, 4793, 3937, 5678, 4351, 2575, 8029,
       6140, 7236, 1806, 4617, 2196, 2764, 5598, 2007, 1302, 7174, 1360,
       1905, 6498, 2946, 4681, 5699, 3000, 3153, 2781, 5478, 5149, 5176,
       5982,  595, 5803,  782, 1753, 6269, 3109, 6178, 5536, 5751, 5636,
       4280, 7666, 2583, 2123, 3857, 1180, 7881,  798, 3228, 7651, 3221,
       6455, 5172, 7164, 5446, 1440, 5071, 1334, 5252, 6614, 4965, 6790,
       7748, 5633, 5916, 8162, 3674, 3534, 6104, 2142, 2044, 4279, 6417,
       7278,  335, 5996, 2828, 1810, 7277, 4556, 5128, 3015, 5559, 1351,
       2334, 4700, 4506, 7630, 7354, 3419, 4138, 2677, 6449, 6510, 3494,
       4385, 4198, 7464, 2579,  843, 1116, 4765, 4262, 4041, 8192, 5650,
       1219, 4442, 2645, 2571, 4877, 3035, 4268, 6600, 6208, 1286, 3166,
       5344, 5805, 1506, 3130, 3472, 8100, 2461, 2819, 6891,  382, 7300,
       1595, 1333, 3345, 3347, 6205, 4750,  956,  326, 7484, 2884,  949,
       1920, 2003, 3149, 1374, 4197, 5868, 6597, 2768, 4574, 2596, 1732,
       5091, 4012, 4461, 4996, 5753, 5902, 6882, 6889, 1592, 6301, 2777,
       7942, 7782,  714, 6529, 8121, 7355, 7556, 2773, 1505, 2503, 3411,
        811, 5865, 1749, 4572, 2883, 3907, 7264, 5968, 5113, 6401, 7806,
       5052, 8135, 7906, 6986, 4954, 2746, 3227,  926, 4702, 1460, 6775,
       2730, 5334, 7066,   76, 2973, 4139, 3008,  871, 3851, 8092, 3918,
       3187,  864, 2061, 7521, 7725, 6327,  123, 5296, 4862, 3398, 4041,
        324,  591, 1790, 5081, 3199, 5316, 2816, 1194, 3230, 4584, 5744,
       2666, 4625, 3127, 1357, 6767, 7779, 5080,  612, 3310,  739, 2147,
       4234, 1199, 1632,  798, 1329, 3431, 7166, 6499, 7656, 6191, 2826,
       7347,  295, 2244,  665, 5856, 3369, 7488, 7142, 6567, 3201, 8105,
       4825, 6279, 2594, 5668, 1664, 2899,  888, 5998, 6805, 6648, 7553,
       4841, 8090, 3135, 1325, 3050,  779, 4312, 6764, 6507, 3806,  944,
       7788, 3308, 3583, 1411, 5904, 7429, 7846, 2609, 3662, 7520, 1657,
       2066, 6106, 3728, 5467, 6057, 5323, 5287, 4675, 3710, 3772, 5046,
       3445, 4374, 4030,  330,   92, 4244, 2235, 7214, 4544, 7993, 1122,
       5432, 1654, 6943, 5516, 7697, 6031, 7336, 6357, 7845,  179, 7395,
       7724,  936, 7534, 6366, 2377, 3320,  661,  339, 2116, 7288, 7074,
       1978,  306, 5572, 2547, 3932, 2519, 2826, 3256, 1108, 3800, 6770,
        592, 3567, 6080, 8099, 4244, 2994, 2863, 3177, 6152, 3474, 7253,
       5746,  813, 4465, 1063, 4205, 7613, 5571, 2577, 1171, 3748, 4192,
       2958, 2991, 7357,  340, 2348, 3929, 4704, 4927, 6512, 4914, 2784,
        436, 2970, 1692, 7753, 2081, 4417, 2793, 6974, 1077,  872,  705,
       4050, 5050, 6096,  854, 4821, 2884, 4971, 6537, 3642,  333, 7190,
       1797, 2141, 3658, 5065, 6352, 6497, 7457, 4599, 4793, 1314, 4852,
       5887, 1345, 4146,  126, 6453, 6635, 1104,  486, 5783, 2893, 6118,
       1152, 4359, 2235,   91,  593, 6483, 6341, 1801, 5930, 4042, 1244,
       2060, 4462, 3864, 4542, 2374, 1549, 7280, 2173, 1745,  370, 2363,
       3362, 3918, 6800, 1925, 3069, 2347, 4290, 1716, 3626, 2092, 3336,
       4874, 6541,  706, 6139, 7434, 7054, 1391, 3881, 3208,  671,  100,
       2783, 3918, 4330, 5373, 3786, 8144,  496, 4700, 3182,  879, 6245,
       7922, 3618,  354, 4060,  291,  367, 5726, 6273, 1557,  787, 2753,
        371, 2971, 6121, 5509,  128,  459, 2461,  899, 2358, 8040, 6277,
       8188, 5783, 2106, 3122,  909, 1783, 2808,  497, 1469, 4578, 2393,
       2339, 6051, 6006, 3837, 3978, 3485, 3128, 5648, 6649, 6679, 4179,
       2119, 6767, 7421, 2097, 7438, 1256, 4478, 7263, 7328, 1439, 1733,
       3696, 2673, 7105,  794, 2487, 3075, 4858, 3350, 2049, 7754,  458,
       7581,  791, 3111, 4737, 4529, 3521, 5404, 4740, 4233, 8046, 5244,
       7449,  859, 1254,  848, 3812, 7228, 6414, 6280, 4926, 4972, 4150,
       3658, 3592, 4885,  293, 2537, 2273, 7043, 6670,  512, 7610, 1980,
       1926, 2007, 4196, 2287, 7412,  880, 1769, 2202, 1350, 1959, 5845,
       1938, 2120, 3177, 8098, 2646,  831, 2599, 7700, 3036, 3517, 1342,
       6938, 7203, 6792, 5208, 3772, 7691, 5487,   66, 4126, 1527, 5456,
       3461, 4212, 4654, 2701, 5153, 7389, 2991, 7128, 5275, 3732, 1026,
       1201, 1252, 3938, 3783,   87, 1732, 6065, 6548, 2943, 5117,   96,
       4665, 7343, 6680, 3298, 7597, 2765, 4801, 3521,  377, 5399, 3663,
       2177,  866, 1444, 2242, 5849, 2825, 5438, 5107,  558, 1326, 6954,
       1144,  351,   33, 2883, 7886, 7519, 3909,   16, 6425, 3108, 4343,
       6376, 6421,  962, 7639, 3680, 1648, 1452,  540, 1772, 2095, 7855,
       2947, 1462, 4996, 3460, 6372, 6510, 4326, 2613, 7130, 8156,   23,
        232, 1396, 3950, 5615, 5763, 8052, 1968,  683, 4779, 2394, 1380,
       4249, 5355, 6630, 4251, 3972, 3765, 1685,  365, 2230, 7679, 7699,
       5059, 4996, 3391, 6110, 1021, 7269, 6794,  363, 7206, 6194,  337,
       6339, 3523, 5634, 3469, 8036, 4006, 6685, 5754, 7308, 7882, 3910,
        929, 5269, 6815, 7848,  763, 2722, 3020, 2494, 5608, 1862, 2849,
       5345, 6524, 2284, 6323, 2232, 1185, 7913, 4216, 5106, 1814, 4058,
       2629, 2094, 5954, 1539, 5875, 2372,  761, 4966, 4918, 5310, 5438,
       7798, 6591, 5765, 4016, 1860, 3262, 1594, 5639, 5408,  704, 3167,
       5227, 5925, 5037, 4190,  116, 4993, 7936,  224, 7053, 7213,  441,
       1135, 4918, 5373, 3206, 2207, 6889,  702, 3519,  896, 3488, 7016,
       7069, 5640, 4326, 2123, 5260, 5103, 6217, 1811,  621, 1753, 7360,
       7418, 8106, 7520, 7736,  352, 2562, 1271, 7196, 4264, 5093, 3144,
       6952, 4042,  356, 7212, 4756, 5773, 1915, 4272, 3799, 6578, 7579,
         85, 5716, 7005, 5050, 4503, 6486,  528, 1160, 4106, 6165, 5147,
       4259, 2864, 5283,  752,  856, 7384, 4288, 2687,  853, 6844, 7863,
       2878,  255, 4764, 1525, 7931, 6859, 7751, 5701, 2764, 5884, 3728,
       1872, 2940, 3736, 5010, 3189, 5424, 2905, 1096, 6166, 8107, 1792,
       1449, 7473, 8175,   81, 1620, 7449,  623, 1017, 7976, 3659, 3066,
       3092, 5659, 4186, 2861, 2456,  533, 5304,  779, 6508, 7420, 3148,
       5604, 5389, 2480, 5222, 7702, 7472, 2479, 7233, 3086, 1536, 6103,
       3311, 2580, 7218, 2611, 6170, 2208, 2022, 3475, 4246, 3151,  746,
        676, 3886, 8012,  801, 7567, 2033, 5147, 3520, 6172, 4849, 7492,
       3714, 2206, 4838, 5900, 3415, 2976,  556, 4023, 3498, 5346, 6318,
       6741, 5747, 5428,  924, 8173, 5768, 6359, 2164, 5185, 2916, 4155,
       5313, 7782, 4130, 4667, 7001, 5274, 7725, 4832, 4136, 6443, 2700,
       8188, 7787, 3761, 6585, 1497, 5704,  853, 4507, 7461, 5619, 2287,
        779, 7272, 1419, 4967, 4553, 1725, 1833, 7476, 4255, 6871, 2587,
       2057, 7768, 6535, 1049, 1469, 5499, 7556, 4927,  873,  558, 6414,
       7783, 3159,  285, 5948, 6824, 7013,  596, 4322, 7864, 3890, 6126,
       6807,  888, 2774, 7334,   32, 4939, 5054, 1572, 6064,  385, 4992,
       7931, 1810, 3671, 2805, 4163, 1258, 1646, 2954, 1693, 5271, 5768,
       1033, 5594, 7665, 3257,  652, 1936, 5706, 6858, 4892, 3950,  818,
       7584, 4494, 1655, 4877,  820, 3908, 3063, 5127, 1076,  961, 6427,
        105, 1685, 1701, 3396, 7144, 4403, 1960,  254, 4146, 3214, 6716,
        218, 5868,  120, 1274,  667, 2385, 6612, 6115, 1787, 3412, 6333,
       7431, 6222, 1501, 2687, 7933, 5030, 5401, 7898,  974,  432, 1864,
       3303,  958, 4655, 3099,   44, 5991,  218, 3022, 3472, 7795, 3110,
       4738, 6048, 5164,  754, 2709, 2273, 2699, 7984, 2316, 6130, 3039,
       3104, 3925, 4688, 1123, 3643, 7779, 2690, 7775, 3761, 1707, 3080,
       2228, 3117,  450, 1071, 8180, 5776, 6813, 1093, 4817,  134, 6903,
        491, 1023, 5900, 6010, 2892, 3693, 5825, 6739, 2482, 2249, 4977,
       2017, 6983, 5613, 6782, 1270, 6910, 3569,  607, 7237, 4083, 6695,
       3094, 2579, 1895, 3034, 5683,   73, 5194, 1955, 5868, 7879, 5962,
       1492, 2805, 3603, 1863, 1021,  229, 5947, 4633, 3428, 2106, 2715,
       4788, 2265,  757, 2020, 3603, 3726,  710, 5602, 3857, 4638, 6963,
       6160,  664, 7342, 4472, 7574, 1775, 6575, 1982, 5307, 3866, 5679,
       6505,   53, 2217, 1708, 3212,  839, 1488, 7579,  717, 6833, 4703,
       5989, 1990, 7435,  788, 1289, 7044,  804, 3726,  734, 3029, 7755,
       6447, 7242,  384, 1203, 3253,  679, 6566, 4305, 4810, 1082, 4624,
       7157, 3435, 5226, 7535, 8143, 3864, 5437, 6052, 6602, 4619,  776,
       2790, 5819,  155, 7491, 2433,  436, 3944, 5926, 4244,  729, 2589,
       6319, 5601, 7984, 3971, 1729, 6193, 2099, 1830,  319, 7256, 4681,
       7077,  154, 2464, 3411, 5430, 1189, 7102, 3552, 1278, 3216, 4755,
       2045, 2752, 6732, 7990,   12, 5644, 6473, 4327, 3299,  967, 5367,
       2023, 2451, 5862, 1646, 8067, 7968, 5243, 7700, 5899, 2070, 6948,
       1155, 6554, 6486, 3953,  657, 5501, 4782, 4711, 4298, 2968, 7683,
         95, 4210, 8036, 5447, 1209, 6370, 1004, 5787, 3530, 2081, 2631,
        316, 6731, 6657, 4491, 7258, 1550, 7832, 6908, 7969, 3749, 3376,
       7242, 4453,  700,  613, 7600, 4491, 1353, 7869, 1103, 4317, 2309,
       7191,  241, 8090, 1731, 4815, 1520, 7542,  443, 4862, 2034,  460,
       3864,   40, 4831, 6176, 3895, 5705, 4995, 1154, 4452, 4987, 1231,
       4164, 7325, 2599, 3095, 1538, 6346, 7214, 5604,  177, 1240, 4411,
       3661, 7288,  488,    6, 1738, 7492, 5532, 7575, 5108, 5019, 6685,
       5691, 4626, 7462, 7410, 2395, 7229, 2982, 4021, 3959, 8007, 3143,
       7865, 1147, 2088, 8081, 1017, 4992, 7125, 7005, 6751, 4980,  385,
       7520, 2553, 6025, 6484, 4587, 7730, 3546, 7626, 4593,  608, 4090,
       2324, 6206, 7724, 2576, 4200, 3238, 4156, 8031, 4310, 1778, 5900,
       5789, 3743, 6655, 3251, 6580, 3963, 3395,  825, 6928,  464,  363,
       4552, 6194, 3472, 2740, 6622, 7216, 5071, 5150, 5408, 7950, 6606,
       1641, 4407, 1274, 2888, 2159, 5037, 5998, 2683,  971, 5298, 5636,
       3014, 1820, 6801, 3034, 3482, 3115, 6499, 7632, 8031, 3310, 5499,
       4657, 2668, 6129, 3777, 7905,  884, 5230, 1318,  128, 1673,  784,
       3253, 5274, 2884, 1272, 2812, 7901, 6204, 2701, 7788, 3932, 3714,
       1785, 6056, 5144, 5371,  188, 1307, 7009,  913,  823, 5831, 5254,
        600, 5823, 5903, 3040, 1887, 1902, 3645, 4853, 4186, 7929, 7880,
       2507, 6996, 7931, 2807, 3358, 7319, 1466, 4455, 5612,  711, 5663,
       2193, 1347, 7958, 1348, 3364, 2587, 1851, 7252, 4156, 4135,  330,
       3167, 2217,  937, 1075, 4950, 4540, 1925, 3477, 1839, 2894, 7713,
       3268, 2849,  900, 1220,  905, 5338,  264, 7615, 1371, 7618, 1831,
       5046, 1105,  338, 1105, 6593, 1767, 1362, 5295, 3624, 2379, 7564,
        817, 5964,  319, 7448, 7098, 5022, 3608, 4342, 7855, 2534, 4173,
       4900, 4313, 5715, 1531, 7143, 7902, 4656, 1330,  986, 1356,  144,
       3483, 6572, 4445,   98, 6502, 2978, 4962, 4037, 3598, 7558,  852,
       7334, 5696, 2142,  589, 6475, 2850, 2615, 2700, 4043, 3560, 4482,
       3326,  835, 2446, 3607, 1391, 3485, 2522, 4210, 7874, 1146, 4800,
       6161, 5002, 7216, 5091, 2539, 1521,  788, 4159, 7297, 2941, 4960,
       2565,  850, 5215, 7037, 5487, 1519, 3878, 5567, 3842, 5147, 4240,
        476, 1650, 6135, 1042, 4412, 2515,   35, 5193, 6683, 6723,  443,
       7339, 8145, 6162, 7461, 4795, 1319, 3872, 4402, 7084, 7672, 3576,
       6543, 4518, 8160,   10, 1027, 3136, 4825, 7111, 2326, 5779, 2153,
       4380, 4501, 1416, 2654, 5907, 7537, 6668, 2687, 7563, 3626, 7422,
       2475, 4051,   86, 2130, 1558, 4560, 1417, 3302, 7112,   77, 4422,
       3991, 7852, 4040, 1318,  252, 4198, 2874, 5805, 7019, 5084,  800,
       5807, 1104, 4466, 3539, 7458, 4267, 1048, 7717, 1862, 5745, 3277,
       4573, 5738, 7019, 1501,  512, 2624, 1547, 3573, 1514, 3349,  918,
       5180, 5013, 5320, 5418, 1692, 5125, 2524, 5947, 4235, 5601, 5053,
       2545, 4855, 6004, 4606, 1659, 2116,  644, 1753,  721, 1822, 2472,
       1107, 6375, 5005, 4321, 8157, 1618, 6200, 4870, 3286, 6487, 2016,
       1549, 1963,  322, 1432, 6355,  448, 6651, 7671, 6179,  113, 3580,
       2934, 5454,   67, 1883, 4718, 7558,  258,  973, 6841, 7228, 5497,
       5136, 2159, 4725, 4181, 2613, 4152, 2130, 7722, 1708,  117,  477,
       6135, 2011, 3778, 7344,  753, 2567, 5811,  300, 4968, 6319, 1215,
       6566, 3040, 4312, 4789, 1891, 7116, 5316, 3214, 3630, 7112, 2015,
       3031, 6446, 1510, 5941, 3860, 3264, 1688, 7659, 3617, 5649, 7856,
       1456, 3720, 5578, 1675, 6274, 4004, 2196, 4991, 6834, 1536, 4475,
       2798,  175, 2095, 7508, 5515, 7339, 2617, 6560, 8044,  897, 8138,
       2646,  289, 8056, 4058, 7424, 2076, 2659, 7780, 6279, 3198,  353,
       5988, 7066, 7487, 4798, 3261, 7459, 6134, 5618, 7085, 2979,  603,
       2936, 3861, 6118, 7444, 5466,  942, 2959, 2902, 4859, 7617, 3483,
       5270, 6075, 5791, 1983, 3524, 3778, 6400, 3775, 1860, 1403, 2116,
       6781, 2807,   37,   39, 7593, 5523, 3022, 2082, 6734,  141, 3288,
        571, 7238,  677, 1326, 1263, 3862, 1263, 1333, 3211, 2056, 4416,
       2082, 7651, 8068, 5488, 3798, 2328, 6613,  788,  196, 7228, 2711,
       6752, 8047, 3575, 5930, 7292, 4129, 6078, 1421, 5227,  858, 2404,
       4220, 2442, 7828, 3083, 3285, 1315,  596, 3195, 3729, 7074, 4733,
       4078, 5507, 3801, 1293, 8186, 2983, 6827, 6368, 2758, 3488, 4442,
       5075,  177, 2401, 6041, 4006,  995,  320, 3957, 4259, 7992, 4142,
       7710,  947, 2750, 1155, 5510, 7398, 6929, 2533, 5895, 4558, 2821,
        851, 4699, 1726, 4156, 2380, 7086,  832, 4416, 2720, 3812, 3395,
       5002, 5526,  287,  602, 5293, 1088, 7892, 1812, 7819,  759, 3107,
       3742, 4651, 4150, 2549, 6283, 6774, 4427, 1596,   66, 5061, 4752,
        491,  990, 4284, 1707,  793, 1980, 4058, 7337,  842, 5111, 3129,
       2344, 2765, 4197, 7805, 3885, 6876, 5912, 3990, 2706, 3076, 4958,
       6158, 7190, 5918, 4476, 3305, 2650, 2924, 7667, 5589,  462, 3986,
       4697, 1262,  971,  930, 8160, 5177, 5184, 2343, 7759, 5874, 1176,
       2209, 2202, 4613, 5239, 2948, 6758, 3017, 3179, 1524, 7288, 5539,
       5676, 7231,  902, 2456,  791, 3628,  704,  194, 1756, 1508, 1958,
       6057, 7493, 6518, 6680, 7587, 3518,  861, 2855,  789,  246, 2587,
       6611, 4649, 4573, 3898, 3551, 1699, 3394, 1161, 5826, 7422, 4787,
       2859, 1317,  775, 4560, 7013, 2153, 1529, 5505,  308, 5361, 1557,
       5826, 7128,  300, 1060, 2936, 1143, 4598, 5755, 7709, 8077, 1480,
       2589, 6227, 3573, 3589, 1628, 8116, 3451, 2491, 7269,  248,  921,
       6523, 2958, 1872, 4255, 3188,  825, 7075, 3431, 7089, 8139, 3559,
       4343, 6814, 3082, 1436, 6836, 4434,  908, 2282, 1521,  618, 6733,
       6935,  802, 3508, 3061, 1558, 7526, 1659, 6335, 3445, 1465, 1450,
       7277,  692, 5148, 1124, 3326, 7932, 7992, 4918, 4327, 1355, 2670,
       2936, 4337, 4756, 3224, 2598, 5363, 6492, 6130,  524,  635, 5782,
       7468, 3144, 7408, 4275, 3279, 7167, 7983, 7730, 4978, 5012, 7540,
       3948,  706,  470, 1610, 5502,  976, 3300, 2543, 7001, 2732, 7805,
       3380, 7021, 1227, 4710, 4383, 6708,   85, 6653, 5380, 2264, 5063,
       2765, 2006, 4029,  101, 5421, 6428, 5178, 7507, 7420, 6537, 5071,
       5966, 2463, 6370, 2488, 2464, 5031, 2676, 2449, 2062, 5296, 1631,
       5241, 4291, 2430, 7534,  212, 2461, 2262, 4816, 1689, 1492, 5897,
       3188,  285, 4451, 7291, 5177, 5911, 6506, 4554, 5236, 4977, 1642,
       5325, 5620, 2338, 1043, 4583, 2603, 4047,  483, 2850, 3940, 4859,
       6094, 5070, 4057, 4117, 5711, 7522, 6070, 6399, 7842, 7700, 3350,
        299, 2841,  216, 2128, 6756, 3726, 3303, 2593, 1639, 4457, 5392,
       3392, 1627, 6827,  157, 5053, 3743, 7888, 5889, 1204,  594,  966,
       1079, 2439, 4482, 8057, 1253, 3772, 7817,  727, 1759, 6925, 6943,
       7346, 2520, 3375,  993, 1146, 3322, 4932, 4898, 5515, 2924, 4375,
       3479, 5408, 7226, 1839,  716, 6448, 6452, 5236, 1597, 1497, 5342,
       7844,  358, 5018, 4709, 1788, 6355, 2323, 3026, 5307, 1881, 3435,
       6276, 6652, 6212, 2353, 1055,  811,  643,   79, 7722, 7595, 2867,
       6818, 6794, 5286, 6408, 4147, 3978, 5559, 6520, 5424, 7977, 3546,
       3358, 6368,  723,  789, 6681, 4693, 2064, 7545, 2528, 4037, 4687,
       6986, 2802, 4948, 7652, 3918, 4138, 1990, 6077, 7427, 8171, 4286,
       4887, 4441, 7579, 7530, 5799, 7706, 2180, 2665, 7577, 3288, 1749,
         90,  768,  214, 4542, 7312, 5863, 1379, 3790, 7507,   69, 5098,
       4718, 1729, 6641, 6369, 5993, 5372, 3364, 3553, 4509, 4597, 8139,
       3259, 5043, 5081, 1580,  781, 6698,   32, 4652, 3864, 4177, 7770,
        313, 4398, 8114, 4126, 7155,  504, 3341, 1920,  281,  173, 3396,
        999, 3340, 2316, 5897, 7664, 4879, 3845, 1839, 7327, 6259, 5033,
       4682, 6621, 5775, 3194, 2685, 4380, 6460, 6462, 6855, 6581, 5383,
       1303, 6876, 1371, 8188, 6744, 8120, 6434, 8026, 3839, 5821, 6201,
       1053, 4063, 5257, 5996, 7396, 7132, 1482, 7410,   61, 2061,  192,
       4795, 4778, 1562, 1880, 1881, 1369, 3550, 7375, 2262, 3934, 3203,
       4052, 6093,  294, 6316, 6107, 4358, 7279, 2892,  615, 1456, 3693,
       3117, 3957,  242, 4379, 1324,  877, 2298, 4220, 4030, 4649, 1830,
       5721, 5552, 2818, 5472, 7819,  585, 3638, 6739,  722, 4170, 3329,
       4003, 6585, 6083, 3403, 4066, 7660, 2169, 2798, 7333,  398, 3023,
        213, 7101,  771, 3953, 2443, 5015, 6749, 3012, 7015, 4046, 7523,
       8050, 5166, 6716,  752, 7738, 5516,  807, 4665,  532, 3607, 7997,
       7896, 1383, 6599, 2347, 6477, 1889,  968,  348,   10, 1245,  335,
       3202, 2587,  744, 6905, 7410, 5392, 6047, 7788, 6479, 5112,   44,
       6600, 3620, 7737, 3827, 7911, 2998, 3544, 5017, 4195, 1448, 3924,
       7610, 3406, 2055, 7355, 1029, 5022, 2956,  250, 1334, 1937, 1720,
         48, 1867, 2410,  210, 2255, 5659, 4127, 4680, 5207, 4168, 4115,
       3339, 5428, 2467, 7288, 5180, 2488, 8081,  411, 4532, 4407, 5729,
       4371, 7211, 7898, 3817, 3195, 6802, 3989, 7281,  554, 7435, 1084,
       3779, 6003, 7842, 4822, 7370, 1401, 8179,  324,  752, 7172, 5924,
       2209, 5937, 7033, 5240, 1151, 5541, 6458, 3876,  767, 2134, 5112,
       6323, 5134, 3790, 7260, 5932, 4614, 2228, 3356, 7019, 7443, 4434,
        574, 3146,  835, 4853, 7171, 3386, 3926, 5021, 3473, 4194, 4124,
       4202, 1429,  886, 5928,  797, 3774, 6524, 8072, 6576, 2872, 2140,
       4425,  271,  822,  534,  407, 4703, 4831, 3740, 6801, 3362, 6622,
       3058, 4886, 5313, 4624, 6085, 1941, 4004, 8060, 3043, 6589, 3247,
       4086,  932, 1917, 5354, 3735, 6789, 5923, 7159, 6719, 1696,  762,
       6151, 4166, 1764, 4090, 3085, 1918, 5720, 5465, 4640, 6556, 3165,
       3107, 4579, 3538, 7471, 2113, 7290, 2901, 1635, 6363, 3874,  281,
       1016,  508, 1846, 5333, 6422, 1654, 3061, 6508, 4803,  422, 4011,
        637, 6882, 3625, 4568, 8150, 8137, 5670,  794, 5197, 7559, 4452,
       3697, 6124, 3364, 2474, 3533, 4459, 3759, 4947, 2830, 7961, 1434,
       3186, 2980,  393, 7501, 4110, 7344, 3474, 3772, 1976, 4732,  248,
       6537, 5832, 4164, 4676, 6627,   80, 3214, 8010, 4241, 8171, 5660,
       6970, 2894, 1385, 6671, 6785, 3440, 2498, 7180, 5085, 4380, 3894,
       7163,  443,  892, 7874, 1808, 1725, 3047, 1762,  880, 1807,   11,
        631, 1453,  229, 7405, 8124, 2261,  101, 4924, 6038, 7696, 4073,
        399, 7787, 5624, 3855, 7204, 5229, 5982, 4001, 6599,  881, 1992,
       6713, 2983, 1863, 5592, 6658, 7137, 4324, 1372, 1728, 4207, 4540,
       1606, 3463, 4787,  355, 4137, 6193, 7564, 5007, 2639, 5296, 4969,
       5923, 4210, 5851, 3068, 7732,  968, 6834, 6276, 3564, 7121, 6458,
       6281, 6804, 5576, 6110, 1301, 1963, 1452, 5565, 2848, 4901, 5118,
       5028,  939,  611, 6384, 6717, 1079, 5434, 5601, 7476, 5752, 5730,
        302,  521, 6528,  927, 5822, 7626, 5858, 7874, 2770, 6116, 6608,
       4136,  466, 6151, 3785, 1384, 1405, 7927, 1413, 5813, 5815, 6696,
       4024, 2848, 1781,  164, 3326, 4689, 7969, 2558, 2406, 5766, 7781,
       6000, 2469, 7439, 7783, 3477, 3637, 2318, 5842, 7688, 5686, 7982,
       5314, 7953, 2687,  789, 5324, 4145, 2544, 5795, 6582, 7865, 2855,
        129, 6694, 6271, 4684, 7272, 1270, 2065, 2203,  392,  610, 7624,
       2874, 2221, 2090, 4794, 1081, 2869, 6159,  873, 4035, 3390, 3385,
       3883, 2516, 4793, 3252, 6123, 3651, 4506, 1389, 8006, 2090,  548,
       5466, 2374, 7984, 1911, 7841, 5872, 2809, 4077,  552, 7751, 1972,
         97, 7174, 2671, 8162, 6230, 1036, 4437, 1358, 5931, 3516,  561,
       4991, 2353, 2148, 6889,  195,  892, 2743, 3654, 2136, 7078, 1929,
        834,   51, 7412, 5224, 4246, 4448, 2190,  841,  823,  794, 6601,
       1445, 5585, 1546, 5536, 3856, 2925, 3214, 7328, 3043, 2970, 2920,
        371, 3105, 6505, 4594, 7338, 6633,  402, 2169, 3185, 2920, 6584,
       1427, 2554, 1650, 4880, 1692, 3926, 7463, 3041,  148, 5247, 6146,
        775, 1679, 7095, 6878, 2734,  400, 7018, 7460,  836, 3266, 1817,
        455,  260, 1768, 5111,  505, 3850, 3895, 5096, 3934, 2907, 6436,
       4035, 4753,  563, 5143, 3248, 2835, 6817, 7241, 1432, 6345, 3471,
       2506, 3745, 3815, 6773, 7341, 6756, 7422, 3050, 3432, 3293, 3535,
       5099, 6203, 4296,  494, 1938, 3806, 7505, 6758, 2465,  494, 1469,
       4446, 7563, 1793, 1610, 5230,  949, 3777, 1481, 4732, 4294, 5542,
       1326, 1441, 7377, 4130, 5930, 7761, 7428, 1011, 6137, 1755, 2662,
       2894, 1378, 4107, 7026, 7616, 1642,  180, 4101, 2817, 7139,  100,
       4137, 1041, 4285, 3452,  715, 6635, 3770, 2117, 3614, 4130, 7335,
       7521, 5872, 1509, 5536, 5663,   26, 8096, 2541, 5414, 6592, 6803,
        951, 5592, 1856, 1930, 2781,  596, 1116, 2354, 4803, 7786, 4943,
       2936,  712, 7646, 8027, 1636, 1153, 1088, 2425, 4782, 7622, 4918,
       1171, 5481, 3791, 7032, 6068,  783, 2134, 7129, 4299, 7145, 2488,
       4500, 2386, 2457, 6278, 7175, 4208, 7003, 5620, 5643, 7344, 4815,
        730, 2662, 6085, 5273, 1422, 1272, 2737,  597, 1991, 6789, 8043,
       5031,  682, 6910, 7292, 1616, 4852,  680, 1671, 5264, 6026, 5301,
       5700, 4392, 5758, 4748, 4824, 3021, 4495, 2510, 4063, 4850, 6156,
       5276, 6821, 6750, 1525, 4294, 7700, 6224, 7286, 4084, 4842, 5754,
       8141,  703, 1462, 3958, 5167, 2973,  108, 4264, 5926, 6023, 2124,
       5410, 5274, 6411, 5478, 4067, 6530, 7333, 7715,  230, 7022, 1584,
       4144, 5352, 2458, 4709, 3341, 6661, 6095, 2319, 5750, 1361, 1499,
       8005, 3008, 7508, 6319, 3688,  619, 2693, 2577, 2263, 4822, 5568,
       1523, 2817, 3577, 5387, 1899, 6958, 5938, 4147, 6902,  897, 6908,
       7693, 7430, 7887, 1262, 6351, 1465, 6192,  395, 6039, 7724, 6641,
        981, 5507, 6080, 3090, 3950, 8114, 3192, 4160, 3895, 4734, 3614,
       1717, 7068, 7557, 4941, 3820, 4980, 4185, 7725, 2186,  709, 7043,
       3479, 3711, 4261, 8021, 5584, 4791, 2319, 5317, 6416,  833, 3263,
       1688, 4576, 4269, 3258,   46, 3476, 1114, 1071,  920, 4368, 6751,
       5189, 7252, 5392, 3576, 1227, 2219, 7909, 7949,  972, 1091, 3937,
       5534, 5930,  905,  212, 8026, 6739, 5015, 4419, 7507, 3084, 5403,
       3879, 7737, 4425, 2006,  396, 5530, 3037, 7406,  252, 7840, 1167,
       4108, 2018, 2407, 1238, 5096, 3875, 6568, 6176,  356, 2251, 2725,
       6619,  987, 3824, 6696, 7509, 4706, 6334, 5072, 8048, 7228, 6374,
       6786, 4191, 6646, 3222, 6331, 2154, 5738, 3143, 1903, 3844, 3251,
        844, 2127, 2148, 3867, 3616, 6638, 2725, 5098, 1660,  350, 7718,
       7402, 5456, 1390, 6532, 6339, 7126, 2262, 3983, 2098,  190, 7250,
       2568, 4597, 6590, 3687, 4906, 7352,  154, 3138, 3527, 6951, 5193,
       1080, 5550,  589, 2822, 4626, 6526, 4178, 1508, 7490, 2256, 3781,
       6479, 3342, 6436, 1834, 3888,  600, 4555, 3007, 3299, 8074,  648,
       5530, 4817, 2089, 2223, 3501, 7748,  517,  179, 7115, 2243, 6903,
       6408,  939, 1756, 1435, 2683, 5872,   34, 7834, 6443, 7151, 3085,
       6857, 7748, 6828, 3014, 6949,  615, 3764, 4278, 7969,   75, 4015,
        981, 4131, 1435, 7717, 1897, 6480, 2805, 4988, 2468, 2887, 3642,
        318,  947, 3569, 1471, 5580, 5336,  851, 2641, 3206, 4285, 7822,
       2419, 3789, 1162, 5351, 3832, 5551, 1414, 6175, 2993, 5012, 6294,
        960, 4817, 2798, 6317, 4595, 6031,  240, 3610, 3354, 4086, 5422,
        988, 5318, 5846, 4997, 3104, 4452,  270, 5637, 3365, 5913, 4828,
       5570, 3466, 7431, 2438, 6489, 6332, 3842, 7882, 1582, 2015, 6234,
        568, 5773, 3902, 6867, 7490, 7298, 4728, 6629, 3629, 6974, 4160,
       3659, 6110, 3594, 1158, 3353,  913, 2448, 1166, 1130, 5997, 1000,
       7913, 5043, 6616, 4412, 6341, 1587, 1685, 3568, 8192, 3280, 3872,
       1801,   94, 4900, 6925, 2107, 4210, 6129,   37, 2648, 1713, 7609,
        229, 2982, 3860, 1390, 2176, 5586, 6504, 5475, 4893, 8008, 2613,
       4613, 6468, 5211, 6943, 8078, 6814, 5277, 4701, 7316,  840, 1987,
         64, 1907, 5099,  561, 2302, 5632, 4285, 2264, 1302,  225, 6223,
        795, 7109, 8006,  722, 1504, 7675, 3956, 3681,  964, 6753, 1659,
       2495, 1993, 8060, 4875, 5035, 8035, 8109, 4053, 5819, 5074, 5322,
         69, 6413, 2499, 4118, 5850,  425, 5374, 6796, 6066, 3092, 2476,
       1559,  867,  197, 3254,  537, 5625, 5315,  880, 4070, 3047, 6001,
       7749, 7620, 6491, 7666, 7748, 2741, 8107, 4506, 3423, 1308, 4429,
       7527, 2426, 7000, 7501, 6396, 6136,  235, 3827, 4956, 3352, 6904,
       5464, 4389, 4192, 4150, 1536, 3473, 3912, 6363, 6663, 2808, 5842,
       6315, 3477, 6789, 7320, 2137,  892, 3725, 5765, 7186, 7417,  999,
       4116, 6406, 5056, 7602,   97, 3249, 1552, 3352,   49, 3219, 1232,
       4308, 7807,  157, 5143, 7772, 4305, 4487, 7499, 5738, 4622, 6876,
       3294,  124, 4289, 3368, 5030, 4910, 6238, 1481, 7566, 7178, 4364,
       4373, 7861,  288, 7074, 1357, 2732, 5798, 4257, 4896, 7508, 4585,
       2695, 7995, 3399, 5427, 4274, 4103, 2222, 4688, 1692, 7251, 6161,
       7884, 3365, 5105, 7361, 5497,  730, 7905, 6911, 4196, 4843, 3225,
       4948, 3921, 5779, 3342, 5154, 6816, 2420, 3875,  120, 6188, 2979,
       2638, 1199, 1636, 6183, 7817, 3257,  599, 4085,    9, 7778, 4250,
        907, 6091, 2005, 7713, 3465, 1514, 4535, 2072, 6623, 5543, 1325,
        960, 3581, 3384, 7980, 7901,  517, 7604, 1369, 7664, 6098, 5481,
       7922, 4214,  952, 3211, 6018,  224,  686, 1489, 1198, 6740, 2027,
       2767, 5989, 2318, 2903, 3806, 3845, 7999, 4896, 2498, 4360, 4783,
       3530, 7250,  893, 5410, 3726, 6214,  337, 7672,  761, 1931, 1279,
       3056, 1444, 5957, 1207, 2395,   30, 2203, 1191,   67, 3498, 6405,
       5840, 2518, 4520, 2560, 4521, 1850, 8164, 7821, 2160, 3081, 3522,
       2954, 1362,  819, 6964, 7039,  722, 3136, 7953, 3235, 2559, 3764,
       3339, 5709, 3783, 7767, 5687, 1230,  355, 3850, 2122, 4450, 1795,
       3063, 2455, 5019, 4240,   84, 7049,  298, 7831, 2661, 4525, 7524,
        667, 3642, 2942, 6295, 1744, 3704, 3965, 6897, 6093,   19, 3380,
       5995,  345, 1214, 3954, 5022, 3527, 7034, 2079, 4590, 1401, 1491,
       6355, 1260, 2077, 4990,  196, 6202, 7980, 2943,  396, 6941, 5618,
       7644,  480, 6266,  379, 2958, 3313, 6604, 2306, 2156, 5399, 3571,
       7545, 2299, 1445, 6152,  989, 4771, 7155, 1368, 7913, 4826, 2999,
       6013, 2399, 2402, 3518, 3155, 6479, 5331, 7997,  803, 2661, 6901,
       6171, 1594, 4138, 7304, 4871, 2664, 8111,  645, 7920, 3794, 3498,
        144, 7240, 1737, 1719, 5168, 2207, 4986, 3888, 1267,  583, 2767,
       5683, 6396, 5823, 7042, 6848, 2208, 4300, 4797, 7562, 1145, 4023,
       3202, 2513, 7934, 7487, 4234, 2422, 6015, 6899,  175,  442, 7025,
       3640, 2618, 5108,  468,  123, 7872,  198, 3874, 4056, 2528, 6199,
         71, 1909, 1399,  555,  825, 5635, 2781, 1523, 7840, 6860, 1757,
       1423, 1201, 1615,  460, 3429, 5042, 5891, 4854, 2177, 4893, 1112,
       6216, 1522,  376, 3751, 4771, 3111, 7325, 4517, 8006, 6810, 1771,
        199, 2001, 4277, 2359, 4652, 4487, 1439, 5271, 6165, 7245, 4226,
       2219, 5671, 7464, 1248, 1541, 7638, 7421, 1400, 6629, 3650, 7476,
       6839, 2923, 3863, 6609, 2677, 7241,  408, 3826, 2880, 2405, 2636,
        847, 1483, 7282, 2633, 7094, 1514, 6771, 1234, 5410, 2849,  148,
       6706, 1503, 3315, 3020, 6172, 3773, 7002, 2514, 1046, 7125, 5065,
       1750, 6503,  337, 6514, 2444, 5653, 6763, 3815, 3220, 5281,  738,
       4063, 4368,  720, 7984, 7247,  865, 5574, 8097,  173, 2108, 7483,
       4190, 7379, 2177, 2508, 2321, 3201, 2619, 3848,  438,  927, 5102,
       7659, 2498, 2852,   78, 3525, 1523, 2578, 4649, 2643, 5899, 6323,
        539, 4243, 8128,  503, 1625, 4468, 3608, 4123, 3518, 2485, 3187,
       1044, 3912, 2356, 6187, 7716, 4724, 8060, 5638, 1341, 4667, 3430,
       7911, 1912, 7970, 8141, 1365, 6041, 3057, 6402, 7723, 7343,  189,
       6686, 7001, 5114, 7994, 3554, 6352,  830,  697, 1653, 1330, 5488,
       4412, 3337, 2263, 2333,  841, 7323, 5744,  644, 2012, 8167, 4741,
       3811,  837,  526, 7910,  380, 6963, 5187, 6485, 6500,  644, 5496,
       1732, 3097,  311, 2730, 2337,  513, 1837, 8123, 2967, 4520, 2434,
       2409, 2198, 3209, 1029, 5983,  876, 2727, 4489, 5617, 2697,    0,
       4993, 1502, 3258, 4767, 1713,  366, 1095, 7715, 2945, 2435, 8149,
       3306, 1097, 1534, 2250,  347, 2284, 3625, 7137, 4060,  228,  843,
       4050,   69,  679, 6591, 3548, 2520, 4209, 2512,  521, 1653, 6301,
       3514, 5714, 2474, 5484, 4052, 7327, 4466,  158, 6747, 3266, 7844,
       4935, 1795, 6493, 1456, 7248, 3065, 4590, 6706, 2345, 6186, 7633,
       4838, 8155, 3178,   95, 3194, 2077, 1365, 3585, 3404, 6741,  578,
       1777, 6514, 6523,   34, 6570, 1162, 6594, 4343, 6504,  323, 1394,
       5320, 4532, 6572, 5486, 5777, 4781, 7008, 8131, 7384, 4260, 3507,
        373, 7284, 1290, 3572, 6084, 2928, 5049, 7694, 2966,  917,  893,
        947, 7674, 2655, 7981, 8070, 3449, 2347, 4329, 1121, 7930, 5963,
       6233, 1989, 3306, 6926, 5255, 8047, 4450, 3329, 2389, 7206, 7501,
       6066, 5690, 2089, 5487, 6800, 1119, 1783, 3877, 7256, 4348, 5455,
       4061,  914, 5122, 5293,  696, 2972, 4034, 4548, 6121, 1208, 7049,
       4684, 5621, 7038, 6624, 6205,  928, 7450, 1496, 6576, 6737, 7299,
       6808, 2482, 3159,  570, 7959, 7614, 8057, 3480, 4314, 6250, 4164,
        978, 5859, 5544, 2987, 7782, 3297,  564, 3749, 4106, 5351, 1283,
       1459, 6870, 6262, 4534, 6930, 2668, 1838, 2787,  913, 5458, 2269,
       2846, 6908, 4832, 7975, 6223, 7646, 2188, 1614,  153, 7078, 1202,
       2575, 1140, 1260, 6912, 1857, 2944, 6979, 7144, 1357, 4313, 3989,
       7572, 3822, 4607, 1530, 5681, 7868, 7845, 1363, 2436, 2354, 7309,
       1560, 3787, 3632,  862, 1902, 4033, 2598, 1553, 6453, 2207, 6894,
       2154, 7466, 4523, 4941,  744, 2799, 5275, 3869, 7054, 8168, 6022,
         93, 1431, 6517, 6584, 2995,  513, 2843, 7054, 1798, 7217, 7482,
       3286, 4838, 4526, 4390, 6812, 3350, 1522, 5930, 4355, 4533, 3111,
       1777, 3407, 2436, 1144, 5492, 4650, 3485, 7090, 3792, 1208, 6060,
       6607, 6148, 7246, 4017, 6807, 4753, 2406, 2219, 4605, 4297, 6531,
       5492, 1834, 1155, 6896, 6172, 3960, 1820, 1590, 4575, 2549, 4094,
       4840, 1683, 7966, 6050, 5642, 6147,  686, 3118, 6201, 3924, 8117,
        303,   93, 2960, 7543,  680,  115, 4339, 3506, 6281,  545, 4716,
       3228, 7119, 5115, 6588, 5445, 2768, 3839, 6972, 7707, 4568, 4347,
       2261, 3368,  931, 7736, 6222, 7458, 2265,  117, 7944, 6258, 2352,
        613, 1698, 2544, 4425, 1481,  582, 1301, 3495, 4270, 3534,  763,
       2430, 6821,  731, 2370, 3866, 7926, 6291, 7449, 2067, 4928, 2519,
       6290,  293, 2543, 8111, 2848, 2458, 6822, 1486, 2969,  101, 1081,
       5189, 1093, 6936, 1743, 5037, 4179, 1305, 3381, 7163,  247, 7264,
       1606, 5649, 4827, 2561, 2676, 1767, 5424, 6369, 2494, 4970, 3599,
       4705,  373, 6145, 2098, 1046, 3462, 7626, 2191, 8011, 5635, 2465,
       4489, 8165, 7813, 3545, 2932, 7008, 5965, 8066, 1630,  810, 7249,
       1652, 6538,  318, 2144,  778,  164, 6131, 4605, 6584, 4680, 1311,
       2870, 5390, 5605,  510, 6616, 7038, 6824, 4157, 6164, 5166, 6475,
       4764,   27, 7227, 2024,  419, 2103, 6873, 1083,  414, 3498, 7330,
        316, 5077, 2754, 1811, 1917, 5389, 2817, 2757, 3485, 8120, 7289,
       5142, 2569, 7452, 2796, 1297, 5752, 3703, 7927, 7649, 4368, 5181,
       3672, 4110,  205, 5043, 5365, 2859,  813, 7521, 3480,   39, 6870,
       7104, 5648, 4313,   12, 4216, 4021, 3295, 5450, 3558, 5010, 7490,
       5368,   38, 1600, 6793, 7518, 5180,   39, 6832, 1408, 4232, 7629,
       7166, 5020,  294, 4078, 1512, 5874, 4499, 1383, 6707, 2804, 2529,
       2999,   98, 3786, 2083, 3993, 6014, 5458, 3579, 2580, 7387, 5824,
       4640, 5176, 2349, 4923,  512, 5702,  684, 5846, 2178, 7708, 5807,
       2143, 7452,  209, 1206, 6858,  681, 5059, 1485,  470, 1298, 2628,
       4967, 1276, 4754, 5035,  733, 7721,   49, 5990, 1502, 5636, 6979,
       4942, 7773, 4209, 4558, 8140, 7420,  467, 5381, 2088, 2754, 6011,
       7048, 6565, 6773,  359, 2130, 8069, 5349, 4047, 3477, 3329, 1918,
       7765, 4712, 4193, 3205,  436, 3432, 5952, 6211, 7432, 1610, 7141,
       7543, 2046,  351, 1345, 6644, 2238, 5086,   37, 3767, 1142, 6906,
       4058,  521, 4624, 4860, 5730, 3556, 7234, 6767, 4228, 8096, 2073,
       4560, 5073,  989, 3992,  386, 3717,  483, 1951, 4455, 2599, 7148,
       3494, 4741, 3942, 7949, 1564, 7784, 5994, 5730, 1952, 7419, 7418,
       5580, 4352, 3377, 6716, 3398, 6789, 2974, 7070,  556, 7264, 1973,
       5792, 2172,  922, 2524, 1079, 3217, 1677, 7944, 3549, 4753, 1555,
       7468, 4626, 1391, 4542, 2980, 6614, 1800, 3883, 4262, 6581, 1601,
       7340, 1460, 7142, 3229, 1634, 3510, 6233, 3070, 2750, 1246, 3246,
       2920,  761,  706, 1527,  217, 4574, 7238, 4625, 5818,  745, 3356,
       3546, 3292, 5295, 2555, 2847, 7983, 2408, 7202, 3495, 1549, 6057,
        679, 5778, 2436, 1888, 7563, 4460, 3202, 6974, 7283, 8063,  586,
       4735,  137, 5560, 5637,  112, 7653,  847, 1255, 4517, 2976,  704,
        633, 1514, 6614, 6358, 6723, 2729, 4135, 3423, 5109, 6097, 1935,
        911, 2408, 7588, 2472, 6147, 4449, 3809, 6251, 4099, 6888, 8000,
       3769, 8115, 8166, 4138,  450, 3013, 7650, 1047, 7693, 4980, 1486,
       1113, 1025, 4579, 4466, 6075, 3500, 7836,  929, 1570, 6076, 2502,
       7479,  604, 1356, 3531, 1386,  455, 3469, 2333, 4951,  392, 4230,
        299, 7743,  269, 4169, 1787, 3699, 6767, 1338, 7137, 8064, 3157,
        954, 4765,   70, 8009, 1099, 8144, 3078, 2247, 2041,  459, 3752,
       3667, 4250, 2642, 4916, 6063,  545,  289, 5192, 6513, 6770, 8010,
        997, 6481, 5510, 7772, 4269, 3446, 5937, 4445, 5853, 3485, 3977,
       3437, 4605, 4121,  142, 5182, 5647, 5523, 6631, 7740,  533, 3571,
       6772, 2520, 5043, 2307, 3963, 3482, 7238, 7536, 5500,  135, 1150,
       5685, 7800, 3825, 4757, 6960, 1620, 3199, 7899, 2038, 3906, 2493,
       7120, 1270, 7981, 5358,  930, 5941, 3435, 3262, 4298, 3959, 2574,
       1903, 5531, 2147, 4466, 1446, 7219, 5227, 3480, 6473, 4992, 7981,
       1742, 5654, 1284, 1919, 1606, 5040, 7126, 3509, 3923, 3365, 4154,
        844, 1204, 1649, 6600,  373, 2640,  839, 5607, 4620, 4480, 7799,
       2684, 1515, 7483, 5939, 8042, 2770, 1606, 6196, 7311, 2053, 3622,
       7690, 7441, 4565,  848, 6345, 1797, 7238, 6693, 7721,  280, 7897,
       6161, 1983,  607, 5377, 7356, 1230, 4677, 6037, 4757, 2593, 5021,
         83, 4944, 1948, 7438, 7017, 6579, 5392, 6257, 6178, 6132, 6077,
       6994, 6098, 7336, 6644, 4310, 2317, 3716, 3215, 5988, 3495, 2712,
       3777, 4305, 1776, 5422, 4116, 6883, 7041, 3041, 6502, 4127, 4371,
       3965,   19,  514, 2369,  578, 3630, 7052, 3005, 4915,  153,  639,
       2175, 2358, 3597, 3195, 5418, 5668, 2356, 6021,  792, 5200, 1760,
        308, 2139, 7896, 1147, 2458, 3448, 2960,  810, 4891, 1411, 6526,
        170,  187, 1093, 5145, 1998, 5769, 1812, 4560, 3881,  356, 4943,
       2209, 6663, 3619, 2546, 1287, 1379, 8018, 4387, 1410, 2430, 5502,
        383, 5680, 3847, 5329, 6373,  973, 7134, 5777, 3179, 7575, 2991,
       2026, 6038, 5875, 7470, 5057, 7245,  153,  358, 4292, 7613, 1997,
       2737, 1015, 4108, 5989, 3483, 7344, 1797, 2004, 7736, 4127,  551,
       5769, 5068, 7188,   99,  397,  912,  536, 5987, 2574, 2205, 5354,
       3512, 2624, 4175, 7550, 3371, 5006, 5601, 1411, 6935, 5151, 4261,
        630, 3247, 1041, 4937, 3146, 2371, 1397, 3239, 5404, 3153, 4823,
       2313, 4665, 1269, 7506, 2587, 4577, 4485, 3867, 6954, 6424, 2253,
       2281,   82,  394, 6617, 8164, 6162,  737, 7609, 6677, 2146, 7374,
       2395, 5892, 2283, 7986,  882, 5495, 7922, 5900, 3628, 4465, 2914,
       1820, 3940, 6765, 1122,    8, 1556, 5544, 1517, 2442, 5910, 5730,
       4474, 1969, 3201, 2430, 3412, 3875, 7837, 7694, 6739, 3081,  494,
       3577, 2347, 6482, 6070, 3827, 7689, 6225, 7797, 8159, 3276,  205,
       4331, 2665, 7116, 5183, 4402,  162, 2094, 4860, 4136, 1521, 3415,
       6830, 3468, 1562, 4455, 2537, 4561, 1083, 5108, 7978, 5469, 6905,
       1501, 4670, 3849, 3104, 1783, 7915, 4865, 2176, 7244, 5655, 1814,
       5522, 4714, 4551, 7618, 7571,  485, 7332,  669,  460, 4996, 3366,
       1256, 5235, 7671, 5249, 3813, 7632, 6190, 7408, 7560, 2425, 5385,
        106, 7226,  436, 1266, 7009, 3965, 3804, 3572, 6256, 4522, 3521,
        179, 7014, 7809, 3533, 5432, 7428, 7432,  915,  937, 3759, 5940,
       5121, 3617,  907,  894, 3261, 6176,  493, 3173, 3151, 6084, 8056,
       8163, 7812, 1766, 7672, 2918, 3514, 1290, 1996, 3501,   23, 4433,
       1174,  285,  813, 3615,  746, 6072, 4068, 2886, 6535, 5014, 5576,
       7002, 2124, 1049, 7662, 2408, 6280, 1153, 5669,  855, 3821,  633,
       1071, 4726, 1596, 5493,  389, 1177, 4671, 7580, 6722, 6908, 7437,
       5479, 4845,  866, 3908, 6260, 8069, 2838, 2869, 3530, 2537, 2669,
       5512, 4241, 7877, 4409, 6887, 3452, 2233, 4264, 6994, 4554, 7173,
       5853, 2850, 7538, 3475, 2327, 7977, 1798, 3329, 4792, 2252, 2494,
       5173, 7545, 3503, 4303, 2437, 5516, 2265, 2615, 2100, 5390, 1791,
       1202, 5405, 4581, 3788, 6755, 2876, 5399, 4889, 6141, 2312, 1716,
        390, 6180,  113, 7108, 2339, 1056, 3895,  394, 7534, 5811, 2178,
        406,  887,   54, 3280, 4160, 1970,  321, 6312, 7280, 3991, 4644,
       1425, 1116, 6619,  975, 6161, 4627, 6086,  881,  712, 2914, 5839,
       3375, 6539, 4082, 3494,  475,  233, 3755, 7482, 3545, 7402, 1592,
        217, 2591, 2345, 7956, 3793, 4266, 7625, 6529, 5617, 3145, 6455,
       1785, 5829, 6290, 6249, 8158, 5967, 6558, 5146, 1331, 5525, 6904,
       6810, 2566, 6696, 6550, 4308, 1855, 3415, 2805, 6923, 7437, 5970,
       1728, 8155, 1802, 3187, 2466,  603, 1349, 2082, 5851, 8106, 1246,
       2612,  717, 6526, 2917, 2392, 1209, 2836, 1508, 6092, 1021, 6660,
       2219, 1903, 1426, 4962, 6713, 7419, 6614, 2664, 1092, 4722, 6072,
       6197, 1030, 6273, 5646, 1571, 7086, 4911, 5813, 1067, 2558, 5183,
       1117, 7949, 3951, 5007, 6676, 6116, 1352,  317, 1977,  576,  871,
       3875, 1716, 6691, 6811, 7845, 6147, 6173, 7603, 6080, 6793, 2927,
       1327, 4129, 3927, 7969, 6035, 2698, 5748, 7893,   22, 3563, 1751,
       4482, 4816, 2256, 3935, 4147, 2795, 7255, 5708, 4108, 6897, 7097,
       1421, 2786, 2277, 1289, 6945, 3600, 6213, 1157, 1322, 7559,   13,
        976, 3646, 2890, 7412, 6646, 1059, 2202,  528, 1776, 4569, 5163,
       6464, 2504,  918,  132, 2794, 5704, 6040, 5539, 7333, 5515, 1808,
       1860, 2629, 2130,   21, 4810,  578, 5752,  680, 6561, 2265, 5992,
       2829, 2481, 2971, 1371, 7717, 1955,  706, 5046, 2985,  466, 4849,
       1687, 5399, 5578, 1265,  910, 3033, 4441, 5544, 6057, 1497, 7434,
       3434,  118, 2907, 1342, 1380, 7208, 4573, 4929,  474, 1397,  420,
       4204, 3908, 3983, 1577, 1387,  987,  324, 2360, 3372, 4999,  493,
       2484, 7345, 2060, 5553, 6554, 7987, 4200,  217, 2003, 7614, 5675,
       8139, 5608, 7455, 1173, 5128, 2208, 1851,  409,  416, 7983, 5885,
       8148, 2191, 3147, 1876, 1479, 6416, 7113, 4399, 2176, 4933, 5213,
       4447, 6012, 3100, 2172, 5323, 7979,  686, 3806, 2860, 2607, 5593,
        379, 3017, 1952, 7236, 5092, 1169, 2083, 5867, 6219, 4683, 5185,
       1435, 2257, 1861, 7628, 3695, 7179, 3068, 4344, 4217, 1082, 3104,
       6462,  779, 5650, 5804, 3949, 3265, 1424, 4139, 1233, 5289, 2804,
       6735,  341, 2127, 4656, 6825, 4899, 1481, 2807, 2275, 3226,  331,
       5921, 5973, 2363, 3868, 1159, 3804, 5465,  114, 2924, 3662, 4270,
       6458,  205, 7568, 2266, 5977, 2176, 6841, 4920, 4243, 5891, 1726,
         79, 6926, 6120, 5988, 4610, 3663, 7325, 4779, 6006, 1865, 7225,
       2117, 7614, 2176, 7133, 4233, 4960, 8130, 4539, 1017, 2654,  329,
       7013, 4455, 6223, 5434, 6166,  270,  454, 1791, 1527, 1886,  628,
       4264, 5145,  446,  563, 1736,  968, 5426, 8189,  749, 2822, 7212,
       6992, 5609, 8027, 8124, 6797, 1108, 3987, 1339, 5967, 1384, 7392,
       6387, 1475, 3704, 4418, 3388, 5660,  819, 1034,  964, 4866, 7943,
       3433,  773, 3626, 4142, 4575, 2630, 7434, 2240, 4737, 4045, 7146,
       2913, 7647, 2412, 3460, 1607, 7760, 2112, 3250, 1135, 3858, 6185,
       6378, 6666, 1817, 7251,   81, 6449, 7712, 1447, 6579, 7912, 7948,
       6884, 6617, 2185, 2494, 5598, 7509, 6524, 1106, 2984, 3996, 4223,
       3308, 7596,  228, 7694, 4322, 1247, 6112, 6685,  541, 7239, 3600,
       4592, 2127, 4163, 3865, 7367, 3231, 3267, 2244, 3653, 4352, 3950,
       2722, 5015, 2651, 3278, 2439, 3884, 2944,  374, 4205,  227,  616,
       5653,  968, 3856, 7540, 7104, 1318, 5767, 1340, 3363, 3179, 3249,
       1773, 7732,  497, 1890, 1683, 7370, 2872,   39, 1495, 7504, 6745,
       7266, 3877, 7830, 4443, 3461, 7799, 7097,  939, 5001, 6411, 7643,
       5922, 2343, 1016, 1661, 4080, 3635,   35, 6178, 2157, 5356, 6644,
        600, 1683,  992, 6349, 2361, 6663, 3099, 6930, 2692, 3067, 6866,
       5274,  278,  322, 6419,  571, 3142,  664, 5666, 1642, 3717, 2318,
       5928, 4160, 2272, 7470,  838, 4438, 4406,  375, 5274, 7108, 3434,
         21, 7744, 5012, 7143, 7213, 1412, 2348, 1839, 7298, 7705, 6442,
       4845, 6456, 5597, 7543, 6048, 6106, 2349, 1424, 1232, 6449, 1083,
       5050, 1311,  870, 5782, 1225,  372, 6219, 3130, 3063, 5613, 5129,
       2730,   85, 3639, 3652, 3376, 7397, 7511,  619, 1892,  150,   64,
       7102,  285, 6364, 1731, 2246, 3081,  112, 5922, 6620, 2603, 3931,
       6649, 4509, 3373, 7424, 6789, 1434, 5606,  941, 5965, 6696, 2831,
       7356,  956, 6657, 6062, 1499, 2828, 4721, 8161, 1260, 1121, 2585,
       4759, 4106,   50, 1894, 5479, 7783, 4461, 4995, 6257, 2095, 7878,
       1677, 3835,  194,  174,  946,  743, 7288, 7887, 1372, 2905, 2230,
        454, 3595, 4201, 5184, 4267,  487, 4206, 5048, 3071, 6823, 7815,
       2848, 4679, 4057,  407, 2504, 2605, 5581,  201, 2975,  742, 5929,
        365, 4225, 4304, 4339, 3633, 5456, 4407, 8097, 4196, 6194,  342,
       7812, 5342,  222,  437, 5477, 7313, 5936, 6061, 2573, 1223, 8171,
       7541, 3902, 1987, 4332, 2190, 2264, 1722, 3709, 8018, 5845,  207,
       6495, 6784, 4726, 2807, 7112, 3992,  673, 5384, 6350, 4613, 5648,
        830, 2081, 4212,  577, 7992,  536, 7904, 4367, 6364, 2625,  905,
       5012, 4137, 1517, 6803, 4859, 5513, 3071, 4463, 4781, 7957, 2108,
       7958, 4108, 2735, 6726, 2484,  594, 3500, 7065, 7442, 5908, 4532,
       4038, 3450, 1726, 3378, 4989, 1645, 4725, 3509, 3850, 4264, 5585,
       5500, 4610, 5572, 1479, 7382, 1944, 4053, 5189, 4488,  160,  645,
       3295, 7124, 7570, 5128, 3204, 2875, 4195, 6849, 2898, 5432, 5981,
       6661, 4541, 6273, 3720, 1907, 4735, 2931, 1484, 1888, 5762, 4486,
       4717, 1125, 6013, 4111, 5816, 1531, 5877,  208, 4416, 4661, 3381,
       4423, 1014, 3843, 6524, 5959, 7332, 7818, 1529, 4734, 5831, 5697,
       2776, 5926, 3082, 1355, 6275,  655, 2818,  868, 7677, 1134, 3304,
        349, 3387, 7171, 6477, 2498, 4012, 1802, 6657, 8092, 2124, 1312,
       6899, 2922,  916,  215, 7381, 1342, 7305, 5747, 7015, 7299, 1441,
       4995,  461, 1572, 1712, 7377,  434, 1840, 1432, 6856, 5686, 8089,
       6020, 5039, 6183, 2098, 7225, 5632, 3129, 5878, 1833, 5594, 3665,
       3903, 1341, 3469, 4724, 1814, 5757, 6383, 7191, 1751,  296, 4260,
       3367, 1476, 8096, 2081, 1859, 3378, 5209, 2684, 4668, 4177, 5866,
       7597,  979, 5443, 7289, 1154, 8166, 7113,  654, 2554, 8158, 2251,
       6151, 5638, 5304, 3284, 6145, 3237, 8171, 4637, 6007, 3356,  512,
       3968, 3690, 4866, 6629, 4953, 6982,  633, 6223, 2247, 5685,  532,
       1699, 1255, 6357, 3830, 5371, 6628, 2193, 5553, 4922, 6908, 2770,
        454, 3123, 7373, 7708,  767, 7307, 3076, 4736, 2617, 1913, 3373,
       4381, 6633, 3788, 5518, 4926, 3632, 1073, 1769, 2136, 3113, 3002,
       3648, 3660, 6107, 3833, 4615, 5957,  634,  872, 7771, 4521, 4349,
       3354, 2969, 6098, 2873, 7516, 3705,  708, 3521, 7068, 7987, 6412,
       5450, 4721, 2281, 7262, 7621, 7996,  698, 6238, 3422, 6548,  852,
       6690, 1417,  724, 3373, 4829, 1630, 8124, 2335, 7946, 4329,  151,
       5847, 4887, 2259,  292, 4468, 6835, 5411, 4145, 1610, 3103, 3378,
       7549, 4007, 1044, 5756, 3595, 4710, 5455, 1385, 2307, 8047, 3232,
       2454, 3249, 5678, 5760, 2980, 6864, 7998,  603,  990, 6548,  763,
       7694, 1607, 3776, 4138, 4973, 1812, 1148, 4192, 1348, 7441, 5706,
       3955, 8078, 7788, 6395, 7847, 5866, 7992, 3853, 5621, 4161, 4330,
       1291, 1877, 5841, 1444,  345, 2083, 4107, 7129, 2235,  570, 6493,
       4833, 4555,  916, 5003, 3657, 2965, 1372, 7768, 5296,  228, 7312,
       7203, 4782,  213, 7547, 4985, 2579, 2465, 2742, 4557, 4777, 2411,
       7891, 1568, 3052, 3581, 7373, 3380, 5448, 5063, 3309, 6143, 4697,
       7843, 6866, 6326, 2682, 3095, 7225, 2741,  137, 1302, 3653, 3189,
       3733, 4708, 1726, 1086, 7185, 5058,  117, 3507, 7103, 4799, 6606,
       1223, 7695, 5005, 4789, 2118, 1800, 2675, 2467,  155, 5574, 2959,
       2211, 3969, 6315, 4847,  570, 4540,  686, 2640, 4215, 2300, 4778,
       1947,  465, 4925, 3504, 5237, 5922, 4345, 5524, 3698, 7959, 1304,
       6218, 3178, 4517, 7496, 7031, 2274, 6056, 2351,  663, 7167, 6507,
       7795, 3324, 3589, 2282,  869,  520, 2820, 5294, 2854, 2193, 5197,
       6089, 7973, 7863, 3541, 6757, 3866, 5936, 1349, 1007, 7770, 2835,
       7040, 7377, 5518, 6945, 5284, 2978, 4669, 7528, 7843, 7181, 5973,
       2165, 1714,  779, 1267, 2307, 5870, 6841, 2061, 6958, 1882, 6864,
       1236, 5833, 6393, 7695, 6833, 3615, 4141, 5939, 5071, 7279, 4226,
       7475, 5345, 6100, 5262, 4147,  488, 5823, 8165, 1905, 6910, 3169,
       5333, 2491, 2175, 2766,  606, 3483, 6909, 3230, 7957, 2299, 4865,
       4101, 2085, 4974, 1618, 1169,  762, 4735, 7453, 3927, 6021, 3650,
       4816, 1422, 6717, 6833, 1015, 3066, 7824, 6542, 2397, 7094, 5303,
       7692, 1355, 6104, 4951, 6052, 6581, 3253, 1396, 5387, 3698, 6491,
       4196, 3850, 4736, 1099, 1519, 3851, 1558, 3739, 3572,  309,  619,
       1948, 7936, 4900, 5872, 7521, 5549, 4162, 3924, 2277, 3980, 3200,
       8088, 5590,  870, 1901, 8177, 1694, 4030,  509, 6718, 3425, 5160,
        668, 3709, 3133, 7314, 7935, 6837, 2131, 3029, 1680,  276, 8156,
       1244,  714, 2479, 3617, 7951, 2106, 3361, 7574, 6290, 6852,  803,
       7612, 1134,  837, 1057, 6925, 3861, 4317, 4454, 2366, 4381, 7350,
       3765, 1921, 4073, 3629, 5396, 1520,  390, 5378, 5778, 2219, 7097,
       2047, 1717, 1915, 2817, 3721,  284, 6196, 5909, 3845, 5851, 3636,
       3000, 6577, 2092, 7482, 7251, 8006, 3767, 6243,  778, 1646, 1352,
       8087, 2623, 7165, 5653, 2460, 7285, 4721, 5006, 8152, 4020, 4579,
       7060, 2762, 3332, 7003,  323, 7862, 6491, 1338,   18, 1451, 4962,
        582, 6606, 4206, 1526, 4087, 2151, 5769, 1576, 1402, 1062, 5183,
       3062, 3692, 5200, 1503, 5278, 3774, 2643, 5446, 7268,  570,  615,
       2799, 1490, 2780,  914,  411, 3325, 5205, 3334, 5203, 2949, 2040,
       5255, 2692, 1898, 7537, 5622, 5589, 7958,  479, 4994, 3173, 4947,
       3631, 7511, 4527, 1286, 6002, 7416, 4024, 5327, 1601, 1004, 6595,
       6027, 2419, 1316, 4157,  290, 6729,  458, 2167, 7860, 1331, 6886,
       5581, 1293, 5415, 2024,  665, 3322, 3503,  561, 1932, 4808, 7596,
       6127,  352, 2317, 5605, 6226, 7357, 4131, 3263, 7898, 1386, 2587,
       2202, 3548, 7842,  892, 4987, 1088, 5259, 2643, 3352, 3993, 3490,
       3746, 5634, 2221,  817, 4461, 5201, 2979, 6092, 5189, 3892, 6377,
       7308, 4702, 7595, 3674, 6300, 6121, 4756, 3301, 6045, 1519, 6350,
       2016, 6846, 3366, 7861, 8042, 1757, 6801, 6598,  586, 6735, 5324,
        906, 4269, 1984, 3031, 3449, 6184, 2637, 5858, 5675, 6719, 1726,
       2229, 3831, 7589, 2211, 2887, 1541, 6065, 7541,  421, 5988, 7480,
       6292, 3591, 6250, 8146, 4926, 4698, 6832, 4562,  394, 7511,  203,
       1688, 7053, 1528, 2117, 5178, 3654, 5300, 3110, 5062, 7240,   74,
        442,  379, 3860, 1799,  199, 4490,  668, 8108, 2972, 6032, 1672,
       6883, 7841, 7661,  273, 4377, 2849, 6950, 2630, 3360,  875, 8048,
       4613, 6565,  222, 5541, 3721, 5383, 1324, 4289, 6707, 5926, 2982,
       2907, 2572, 3590,  633, 6876, 1078, 2850,  426, 4035, 2402, 3634,
       4056, 5031, 5037, 2350, 4896, 4339, 4067, 6936, 3931, 6692, 5923,
       7724, 7923,  314, 4613, 3832, 6131, 3056, 3982, 4263, 4315, 1993,
       2956, 7710,  146, 6661, 5875, 3126, 3970, 2156, 7465, 4710, 6318,
        668, 4857, 1710, 2335,  572, 5775, 3735,  169, 4846,  741, 3084,
       7042, 2769, 4775, 7752, 8037, 2286, 4046, 7666, 7012, 4924, 7274,
       5361, 7829,  830, 2357, 1481, 4301, 4155,  836, 3112, 6751, 3775,
       7349, 6882, 5271, 4828, 5681,  332, 6140, 1426, 2250,   50, 2976,
