graph main_graph (
  %onnx::Mul_0[INT16, 2x5], exponents: [-14]
  %onnx::Mul_1[INT16, 2x1], exponents: [-16]
) {
  %2 = Mul[quant_type = 'S16'](%onnx::Mul_0, %onnx::Mul_1)
  return %2
}


initializers value:



values info:
%onnx::Mul_0[INT16, 2x5], exponents: [-14]
%2[INT16, 2x5], exponents: [-15]
%onnx::Mul_1[INT16, 2x1], exponents: [-16]


test inputs value:
%onnx::Mul_0, shape: [2, 5], exponents: [-14], 
value: array([14202, 12714, 14159,  8767,  6514,  5353, 15319, 16250, 14377,
       13524], dtype=int16)
%onnx::Mul_1, shape: [2, 1], exponents: [-16], 
value: array([32767, 32767], dtype=int16)


test outputs value:
%2, shape: [2, 5], exponents: [-15], 
value: array([14202, 12714, 14159,  8767,  6514,  5353, 15319, 16250, 14377,
       13524], dtype=int16)