graph main_graph (
  %onnx::Mul_0[INT16, 5x2x48], exponents: [-14]
  %onnx::Mul_1[INT16, 1], exponents: [-15]
) {
  %2 = Mul[quant_type = 'S16'](%onnx::Mul_0, %onnx::Mul_1)
  return %2
}


initializers value:



values info:
%onnx::Mul_0[INT16, 5x2x48], exponents: [-14]
%2[INT16, 5x2x48], exponents: [-13]
%onnx::Mul_1[INT16, 1], exponents: [-15]


test inputs value:
%onnx::Mul_0, shape: [5, 2, 48], exponents: [-14], 
value: array([ 7529, 14767,  1410,  5580,  1639, 14821,  6663,   116, 15195,
        3969, 12248,  7911, 11254, 10423,   438, 11666,  7723,  5513,
        1980,  6978,  8274,  3265,  2071, 14560, 10637, 16077, 13909,
       10607,  8931,  9278,  5757,  3808,  7815,  1956,  7567,  7027,
       10948, 14458, 12488, 15215,  1021,  5688,  8057,  3734, 10239,
       12871,  7070,  3676,  5803, 13568, 13387,   895,   195,  6781,
        4774,   393,  4042,   355,  5793, 12524, 15353,  1232,  9564,
       11292, 12435, 13819,  6837,  4233,  3047,  8124,  7044, 12563,
       12424,  5770, 10998, 10772,  1378, 15333, 13462, 11911,  1294,
        3166,  6797, 10459,  4215,  2555,  3654,  6627,  8894, 15475,
        2169, 16256,  1500, 10352,  1431,  6930, 13687, 15563,  3463,
        1241, 11193,  4916, 13575,    67,  5804, 14116, 14100,  3223,
        4476,  3468,  7392,  2034,  1387, 13061,  3196,  3891,  3956,
       11872,  3922, 14340,  2383,  5646, 13849,  1269,  7572, 15499,
        8874,  9711,  1627,  2758,  5860, 12968, 11638, 11605,  9236,
        4122,  7334,  4714,  5773,  7677, 15848, 13025, 13176, 11953,
        8436,  9170,  5646,  8675,   736, 10405, 12396, 11174,  3808,
        8128,   296, 16054,  2135, 16303,  6230,   458,  3911,  8708,
        9349,  4606,  6235,  2931,  4794,  7876, 10409,  5919,  7832,
       10222,  2205,  5470,  8424, 10838,  2591, 11723, 10988, 14012,
       13250,  9066, 14657, 13785,  4012,  7093,  8591,  8867, 16218,
        7690,    83, 11400,  9428,  9493,  9910, 16318, 12429,  1130,
        2361,  6327,  9366, 14663,  7476, 15435,  3687, 10302, 11812,
        8582, 16014, 16111, 15324, 15097,  1643,  7710,  8863, 13769,
       14752, 11392,  4590, 13332,  7148,  3298,  8822,  9597,  7743,
       10572,  3257,  1506,   647,  1458, 15797, 11827, 12977,   371,
        2962, 12607, 11591,  2014,  8557, 12864, 15675, 13533,   962,
       11470, 13112,  7430,  3137, 13821,  5847, 10865, 14683,  4183,
        9063,  3558, 10074,  8050,  1854,  8081,  1771,  1918,   836,
        6414,  2777,  2512, 13320,  9593, 14923, 14562,  5917,  6340,
       11168,  8826,   143, 12560, 14681,  4699,  1452,   673, 15542,
        3108,   995,   344,  1131,  1288,  7207,   105,  1993,  5330,
       13626,   542,  1966,  4180, 15877,  5428,  6852,  3116,  6727,
        3285, 15609,  7967,  1128,  4268,   949, 14328, 14232, 16274,
       12648,  1364,   341,  1210, 11806,  5862, 11707, 11749,  9787,
        3043,  4859, 12928, 14391,  4581, 13266, 14576,   210,  5555,
         952, 11345, 15364,   571,  3602,   172, 12301, 13101,  2889,
        8049, 14456,  4908,  5839,   181,  2429,  9460, 15185,  7850,
       15686,  2243,   446,  3715,  8178,  1638,  7867,  8787, 10606,
       13109, 14538, 16015,  4700,  3566, 10358, 14261,  8772, 15068,
        8814,  6427,  9512,  6531,   464, 16103,  4467,  6393,  8617,
        6497, 10023,  1856,  5990,  2778,  5619,  7786,   629, 11101,
        4534,  3806,  3738, 12866,  6913, 12869, 11204, 15156,  1038,
       10112,   441,  2949,  1730, 15619, 14432, 10949, 10666,  4850,
        7458,  7293, 12015,  5182, 13175,  4799,  6747,   964,  2839,
       11513,  6804,  8684, 16243, 12271,  4838,  1792,  7073,  4820,
        9410,  2723, 14003,  4576, 12399,  2604,  7054, 10357, 10197,
       12099, 12238,  3655,  9192,  3455,  8437,  7014,  7055,  5886,
        8838,  9224,   597,  4308, 10872, 14737, 14624,   448,  6930,
        1901,  8000, 10700, 13763,   683, 13995, 13106,  1261,   788,
        8830, 15198,   290, 13960,  8333, 11879,  1518,  6635,  7376,
       13158,  2546, 16185,  7924, 11938,  6344,  7344, 11557, 14470,
        8823,  2665,  3489,  9511,  2141,  8973,  5290,  3262,  4017,
        1849,  7223,  5756], dtype=int16)
%onnx::Mul_1, shape: [1], exponents: [-15], 
value: array([4537], dtype=int16)


test outputs value:
%2, shape: [5, 2, 48], exponents: [-13], 
value: array([ 521, 1022,   98,  386,  113, 1026,  461,    8, 1052,  275,  848,
        548,  779,  722,   30,  808,  535,  382,  137,  483,  573,  226,
        143, 1008,  736, 1113,  963,  734,  618,  642,  399,  264,  541,
        135,  524,  486,  758, 1001,  865, 1053,   71,  394,  558,  259,
        709,  891,  489,  254,  402,  939,  927,   62,   13,  469,  330,
         27,  280,   25,  401,  867, 1063,   85,  662,  782,  861,  957,
        473,  293,  211,  562,  488,  870,  860,  399,  761,  746,   95,
       1061,  932,  825,   90,  219,  471,  724,  292,  177,  253,  459,
        616, 1071,  150, 1125,  104,  717,   99,  480,  948, 1077,  240,
         86,  775,  340,  940,    5,  402,  977,  976,  223,  310,  240,
        512,  141,   96,  904,  221,  269,  274,  822,  272,  993,  165,
        391,  959,   88,  524, 1073,  614,  672,  113,  191,  406,  898,
        806,  803,  639,  285,  508,  326,  400,  531, 1097,  902,  912,
        827,  584,  635,  391,  601,   51,  720,  858,  774,  264,  563,
         20, 1111,  148, 1129,  431,   32,  271,  603,  647,  319,  432,
        203,  332,  545,  721,  410,  542,  708,  153,  379,  583,  750,
        179,  812,  761,  970,  917,  628, 1015,  954,  278,  491,  595,
        614, 1123,  532,    6,  789,  653,  657,  686, 1130,  860,   78,
        163,  438,  648, 1015,  518, 1069,  255,  713,  818,  594, 1109,
       1115, 1061, 1045,  114,  534,  614,  953, 1021,  789,  318,  923,
        495,  228,  611,  664,  536,  732,  225,  104,   45,  101, 1094,
        819,  898,   26,  205,  873,  802,  139,  592,  891, 1085,  937,
         67,  794,  908,  514,  217,  957,  405,  752, 1016,  290,  627,
        246,  697,  557,  128,  559,  123,  133,   58,  444,  192,  174,
        922,  664, 1033, 1008,  410,  439,  773,  611,   10,  870, 1016,
        325,  101,   47, 1076,  215,   69,   24,   78,   89,  499,    7,
        138,  369,  943,   38,  136,  289, 1099,  376,  474,  216,  466,
        227, 1081,  552,   78,  295,   66,  992,  985, 1127,  876,   94,
         24,   84,  817,  406,  810,  813,  678,  211,  336,  895,  996,
        317,  918, 1009,   15,  385,   66,  785, 1064,   40,  249,   12,
        852,  907,  200,  557, 1001,  340,  404,   13,  168,  655, 1051,
        543, 1086,  155,   31,  257,  566,  113,  545,  608,  734,  908,
       1006, 1109,  325,  247,  717,  987,  607, 1043,  610,  445,  659,
        452,   32, 1115,  309,  443,  597,  450,  694,  128,  415,  192,
        389,  539,   44,  769,  314,  263,  259,  891,  479,  891,  776,
       1049,   72,  700,   31,  204,  120, 1081,  999,  758,  738,  336,
        516,  505,  832,  359,  912,  332,  467,   67,  197,  797,  471,
        601, 1124,  850,  335,  124,  490,  334,  651,  189,  969,  317,
        858,  180,  488,  717,  706,  838,  847,  253,  636,  239,  584,
        486,  488,  407,  612,  639,   41,  298,  753, 1020, 1012,   31,
        480,  132,  554,  741,  953,   47,  969,  907,   87,   55,  611,
       1052,   20,  966,  577,  822,  105,  459,  511,  911,  176, 1120,
        549,  826,  439,  508,  800, 1002,  611,  184,  242,  658,  148,
        621,  366,  226,  278,  128,  500,  398], dtype=int16)