graph main_graph (
  %onnx::Mul_0[INT16, 5], exponents: [-16]
  %onnx::Mul_1[INT16, 1], exponents: [-14]
) {
  %2 = Mul[quant_type = 'S16'](%onnx::Mul_0, %onnx::Mul_1)
  return %2
}


initializers value:



values info:
%onnx::Mul_0[INT16, 5], exponents: [-16]
%2[INT16, 5], exponents: [-15]
%onnx::Mul_1[INT16, 1], exponents: [-14]


test inputs value:
%onnx::Mul_0, shape: [5], exponents: [-16], 
value: array([ 9287, 32767, 32767, 29381, 16405], dtype=int16)
%onnx::Mul_1, shape: [1], exponents: [-14], 
value: array([7163], dtype=int16)


test outputs value:
%2, shape: [5], exponents: [-15], 
value: array([2030, 7163, 7163, 6423, 3586], dtype=int16)