graph main_graph (
  %onnx::Mul_0[INT16, 1x3x4x5], exponents: [-13]
  %onnx::Mul_1[INT16, 2x1x1x1], exponents: [-14]
) {
  %2 = Mul[quant_type = 'S16'](%onnx::Mul_0, %onnx::Mul_1)
  return %2
}


initializers value:



values info:
%onnx::Mul_0[INT16, 1x3x4x5], exponents: [-13]
%2[INT16, 2x3x4x5], exponents: [-12]
%onnx::Mul_1[INT16, 2x1x1x1], exponents: [-14]


test inputs value:
%onnx::Mul_0, shape: [1, 3, 4, 5], exponents: [-13], 
value: array([3637, 2454, 3699, 3147, 1068, 6002, 6713, 7053, 5175, 6681, 4416,
       2858, 4843, 5309, 2971, 2354, 1761, 6515, 4018, 3176, 3028,  321,
       6734, 2723, 1178, 7425, 5431, 2197, 6334, 2640, 3198, 5902,  368,
       3732, 6987, 4797, 6928, 5315, 7196, 7718,  514, 1137, 2976, 6996,
       2401, 8166, 7487, 4657, 3879, 3539,  156, 7054, 1825, 1543, 1428,
       5532, 1465, 6418, 4609, 3285], dtype=int16)
%onnx::Mul_1, shape: [2, 1, 1, 1], exponents: [-14], 
value: array([15984,  6740], dtype=int16)


test outputs value:
%2, shape: [2, 3, 4, 5], exponents: [-12], 
value: array([1774, 1197, 1804, 1535,  521, 2928, 3275, 3440, 2524, 3259, 2154,
       1394, 2362, 2590, 1449, 1148,  859, 3178, 1960, 1549, 1477,  157,
       3285, 1328,  575, 3622, 2649, 1072, 3090, 1288, 1560, 2879,  180,
       1820, 3408, 2340, 3379, 2593, 3510, 3765,  251,  555, 1452, 3413,
       1171, 3983, 3652, 2272, 1892, 1726,   76, 3441,  890,  753,  697,
       2698,  715, 3131, 2248, 1602,  748,  505,  761,  647,  220, 1235,
       1381, 1451, 1064, 1374,  908,  588,  996, 1092,  611,  484,  362,
       1340,  826,  653,  623,   66, 1385,  560,  242, 1527, 1117,  452,
       1303,  543,  658, 1214,   76,  768, 1437,  987, 1425, 1093, 1480,
       1588,  106,  234,  612, 1439,  494, 1680, 1540,  958,  798,  728,
         32, 1451,  375,  317,  294, 1138,  301, 1320,  948,  676],
      dtype=int16)