graph main_graph (
  %onnx::Mul_0[INT16, 2x48], exponents: [-14]
  %onnx::Mul_1[INT16, 1], exponents: [-16]
) {
  %2 = Mul[quant_type = 'S16'](%onnx::Mul_0, %onnx::Mul_1)
  return %2
}


initializers value:



values info:
%onnx::Mul_0[INT16, 2x48], exponents: [-14]
%2[INT16, 2x48], exponents: [-14]
%onnx::Mul_1[INT16, 1], exponents: [-16]


test inputs value:
%onnx::Mul_0, shape: [2, 48], exponents: [-14], 
value: array([ 3033,  1881, 13009,  9442,  6661,  8552,  3639,  6229, 15032,
       12487, 15016, 10646,  5614, 11630,  9942, 13665,  1411, 10062,
       12293, 16051,  5038, 10503,  3849, 13228,  9386, 15428, 15387,
        7067,  2029,  3660,  5750,  5596,  2079,  8686, 12383,  1296,
       13624,  7024, 12061, 10688,  3907,  3099,  2212, 13574, 10547,
       15906, 15773,  9584, 10771, 12463,  2627,  7061,   839, 15679,
       11635,  9315,  7240,  2596,  4477,  6982,  4507,  9587, 13467,
        1420,  7867, 10578,  1294,  7210,  7804,  8443,  4602,  8649,
       11787,  6453, 13376,  1661,  8532,  9480, 10871,  9588,  8453,
       15638,  2490, 10750,  3588,  3860, 10457,  2095,  5327, 14128,
        3405, 15279,  1686, 15959,  2508, 16049], dtype=int16)
%onnx::Mul_1, shape: [1], exponents: [-16], 
value: array([32767], dtype=int16)


test outputs value:
%2, shape: [2, 48], exponents: [-14], 
value: array([1516,  940, 6504, 4721, 3330, 4276, 1819, 3114, 7516, 6243, 7508,
       5323, 2807, 5815, 4971, 6832,  705, 5031, 6146, 8025, 2519, 5251,
       1924, 6614, 4693, 7714, 7693, 3533, 1014, 1830, 2875, 2798, 1039,
       4343, 6191,  648, 6812, 3512, 6030, 5344, 1953, 1549, 1106, 6787,
       5273, 7953, 7886, 4792, 5385, 6231, 1313, 3530,  419, 7839, 5817,
       4657, 3620, 1298, 2238, 3491, 2253, 4793, 6733,  710, 3933, 5289,
        647, 3605, 3902, 4221, 2301, 4324, 5893, 3226, 6688,  830, 4266,
       4740, 5435, 4794, 4226, 7819, 1245, 5375, 1794, 1930, 5228, 1047,
       2663, 7064, 1702, 7639,  843, 7979, 1254, 8024], dtype=int16)